{"web-scraper-order":"1754030674-1","web-scraper-start-url":"https:\/\/www.robertsbrothers.com\/roster\/Agents","agent_link":"More about Kyle","agent_link-href":"https:\/\/www.robertsbrothers.com\/bio\/kylebaggett","title":"Sales Associate - REALTOR®","address":"6721 Grelot Road, Suite A\nMobile AL 36695","description":"About Kyle Baggett\n      \n      Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority.\nAs a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none.\nThere's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen.\nNo matter your real estate needs, it would be my pleasure to assist you.","name":"Kyle Baggett\n          Sales Associate - REALTOR®","website":"Website","website-href":"https:\/\/kylebaggett.robertsbrothers.com\/","agent_phone_numbers":"843-437-6291"}
{"web-scraper-order":"1754030691-2","web-scraper-start-url":"https:\/\/www.robertsbrothers.com\/roster\/Agents","agent_link":"More about Anne","agent_link-href":"https:\/\/www.robertsbrothers.com\/bio\/annebaggett","title":"Sales Associate - REALTOR®","address":"3601 Spring Hill Business Park Ste 101\nMobile AL 36608","description":"About\n      With over fifteen years of experience as a nurse, and a thirty-year career as a real estate professional, Anne Baggett has dedicated her life to serving people with compassion.Born and raised in Mobile, Anne spent her summers on Mobile Bay, giving her a very special connection to the Gulf Coast and everything that makes it unique. She graduated from Convent of Mercy High School, attended Spring Hill College and graduated from Providence School of Nursing. After graduation, she worked for fifteen years as a Recovery Room Nurse, giving her extensive knowledge on what it means to truly serve others.With a growing family, she took on a new career as a real estate professional, which allowed her to serve others, create lasting relationships, and still have time for family and community service. Her goal is to give tireless service and a happy home hunting\/selling experience to her clients. As a top agent with over thirty years in real estate, she has truly found \"HOME\".Deeply committed to serving her community, Anne serves on the Advisory Board of Catholic Social Services, Archdiocesan Council of Catholic Women, a member of the Toy Bowl Board Youth Athletics Committee, a volunteer with Little Sisters of the Poor, and a Member of JDRF.Anne serves on the Advisory Board Roberts Brothers Charitable Fund (Legacy for Lost Children), is a Member of Mobile Chamber of Commerce, and Runner-up “Realtor of the Year” Nappies Award in 2011.A proud mother and grandmother, she loves staying involved in her grandchildren’s many activities.\n      \n\n\n      \n\n\n   Testimonials\n  \n    \n        \n          \n            Anne Baggett is the best! She is always thorough and keeps us informed step by step. She makes the entire process super easy for us.\n            \n\n              Susan H.,  10\/21\/2023\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Anne Baggett is amazing!!!\n            \n\n              Kathleen D.,  10\/21\/2023\n            \n            \n              \n            \n            Testimonial Tree","name":"Anne Baggett\n          Sales Associate - REALTOR®","website":"Website","website-href":"https:\/\/annebaggett.robertsbrothers.com\/","agent_phone_numbers":"251-423-5128"}
{"web-scraper-order":"1754030695-3","web-scraper-start-url":"https:\/\/www.robertsbrothers.com\/roster\/Agents","agent_link":"More about Michelle","agent_link-href":"https:\/\/www.robertsbrothers.com\/bio\/michelleautio","title":"Sales Associate - REALTOR®","address":"3601 Spring Hill Business Park Ste 101\nMobile AL 36608","description":"About Michelle Autio\n      \n\n      Michelle was born and raised here in beautiful Mobile. She is a graduate of St. Pauls Episcopal School and the University of South Alabama. She and her husband of 25 years, Mark (a Navy veteran), have two beautiful girls that are her inspiration. Her daughters attend Auburn University and St. Pauls Episcopal School. Michelle put her career in real estate on the back burner to dedicate her life to being a full-time stay at home mom. During this time she volunteered as a teacher and office worker at St. Pauls while never missing a field trip! \n\nShe has strong management and organizational skill while also a large network. Now that her girls are older she wants to continue to be a role model for them and has returned to her passion of helping others sell or buy their forever home. In her first year of selling real estate, even in a pandemic, Michelle was awarded Rookie of the Year for all of Roberts Brothers. And last year climbed to #18 in a company of almost 300! She is dedicated and puts her customer first, always answering the phone when it rings. \n\nIn her free time she enjoys performing as a gospel singer, playing tennis, leading the worship service at Volunteers of America, performing at womens conferences and vacationing with her family. Whether buying or selling, Michelle wants to get to know you and focus on your wants. Since she has always lived in Mobile she knows Mobile and Baldwin counties. Having a passion for getting things done, Michelle takes pride in understanding her clients time-sensitive needs and will put YOU first. She enjoys building lasting relationships with all her buyers and sellers.\n\n\n      \n\n\n   Testimonials\n  \n    \n        \n          \n            Our realtor, Michelle Autio, was awesome throughout the process of selling our home. She went above and beyond to reach out to potential buyers, represented our interests with integrity, and patiently held our hands all the way through closing. We highly recommend Michelle and Robert's Brothers.\n            \n\n              Mattie M.,  6\/16\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle Autio is an excellent realtor to work with. She went above and beyond in showing us houses all over Mobile and Baldwin county until we found the perfect one. She was able to answer any question we had, even if she had to talk with several people to get the answers. She was punctual, curteous, cheerful and very easy to like. If we ever need assistance with a home. either buying or selling, she will be our first call. The Hendricks\n            \n\n              Amy H.,  4\/23\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle was so very helpful. She walked me through the process. And she was able to answer any questions that we had. She truly did make the home buying process enjoyable.\n            \n\n              Lori M.,  4\/8\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            My fiance and I were well taken care of and were ran through everything along with educational tips since we are first times buyers. Nothing but pleased by the help of Michelle Autio.\n            \n\n              Robert E.,  4\/8\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle made this a painless, easy, and enjoyable process. She is a consummate professional who I will use in the future for our next home. Thank you Roberts Brothers and thank you Mrs. Audio.\n            \n\n              James M.,  4\/7\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle Autio was so helpful in helping us sell our parent’s home. She went above and beyond to help us through a difficult time and to make sure everything worked out.\n            \n\n              Rebecca R.,  3\/3\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle is professional and caring. She works very hard to keep all parties informed.\n            \n\n              Kristin B.,  12\/28\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle is a wonderful realtor. She is very professional, hard working and very kind always keeping in touch with you to let you know what's going on . I am so very thankful that I met Michelle she sold my dad's house in Mobile as I live in Washington state. I would highly recommend Michelle one of the best realtors in Mobile.\n            \n\n              Rose W.,  10\/29\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle is a wonderful realtor. She is very professional, hard working and very kind always keeping in touch with you to let you know what's going on . I am so very thankful that I met Michelle she sold my dad's house in Mobile as I live in Washington state. I would highly recommend Michelle one of the best realtors in Mobile.\n            \n\n              Rose W.,  10\/29\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle A. Was amazing , while I with through the most biggest accomplishment in my life …\n            \n\n              Porshia T.,  7\/30\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle was so helpful from the time I met her at an open house till I purchased my home. She’s friendly, down to earth, and responded quickly whenever I needed her. If I ever buy another house, I’m using her!\n            \n\n              Lynn B.,  7\/22\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle is a pleasure to work with. The buying process was a breeze as she was there every step of the way to answer questions and guide me along with whatever actions were needed from me. She was always pleasant, patient, efficient and responsive. I would highly recommend her to anyone and when I have real estate needs in the future, she will be my first call.\n            \n\n              Monte B.,  7\/4\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle has now sold us 3 houses. Her professionalism and attention to detail is unsurpassed. She’s our girl!\n            \n\n              Ashleigh O.,  7\/2\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Our agent Michelle Autio did a fantastic job in every aspect. She guided us through it all, from getting the house ready to be shown, all the way to closing. She couldn’t have done a better job!!\n            \n\n              Joseph M.,  7\/2\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            We relocated from out of state and Michelle went above and beyond with us to help us find exactly what we were wanting, and facilitated a smooth transaction.\n            \n\n              Twila D.,  3\/6\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle went out of her way many times to make sure our questions were answered. Kept in touch though closing. She did a magnificent job. Was helpful every step of the way.\n            \n\n              Roger D.,  3\/6\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle Autio has an incredible talent for detail and follow up. Her ability to put the homebuyer’s needs and wants, as it pertains to their home purchase, is impeccable.\n            \n\n              Ashleigh O.,  10\/6\/2023\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle Autio was a phenomenal agent! She was proactive every step of the way. Every interaction was personal and she ensured all elements of our house purchase went smoothly. I cannot recommend Michelle enough! ⭐️⭐️⭐️⭐️⭐️\n            \n\n              Audrey M.,  9\/28\/2023\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            We closed on our home here in Mobile a couple of months ago and are just a few weeks short of moving in after the renovations. We are so excited and could not have done it without Michelle Autio. Mobile friends if you need to buy or sell a home call her. She’s the best! And we put her through it with the problems selling our home in Florida. She should have gotten a commission off of that one. We’ve been friends since childhood and I’m so thankful to be back in touch with her.\n            \n\n              Suzanne B.,  7\/20\/2023\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            My wife and I got contact with Michelle in last year and she has helped us to make two purchases! She's not only being nice, patient, and helpful throughout the entire processes of our house hunting but also continue to provide helpful suggestions\/information after we complete the purchase. She has been and will continue to be our realter of choice!\n            \n\n              T. S.,  7\/19\/2023\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle is absolutely wonderful. She is the agent for my brother, father, and soon my nephew. I keep sending my family to her because she continues to deliver personalized and professional care. Oh how i wish she could assist me in Georgia as well.\n            \n\n              Toni S.,  7\/18\/2023\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle, you are such an awesome agent!! You are beyond professional and knowledgeable. I was blessed to be lead to someone determined to find me the right house within my budget. I loved the fact I could always call you anytime with my concerns and you always kept me updated. Your knowledge and expertise is why we are here now! I don’t know where you got all your energy and patience! But I am so thankful you remained focused from day one and kept the same tempo the entire time. It helped me remain hopeful when at times I was ready to give up because of the market itself. If I asked you questions, without delay, you alway found the answer and guided me through this process while looking out for my best interests. I feel like some people are delight and great to work with personality wise yet not proficient or knowledgeable at their jobs and there are those that are absolutely not approachable but overly excels and delivers on what they promise. But I sincerely feel you and Lindsey Bembry (my wonderful loan officer) embody both of those positive characteristics which simply sets you ladies above the rest. I would easily refer friends to Roberts Brothers! Thank you for never judging and always encouraging. My family and I love our new Home.\n            \n\n              Olivia K.,  7\/18\/2023\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Michelle was a Godsend. We had touched base a year ago but my personal health intervened before we could even get started. After a year I knew I needed to sell the house quickly before it deteriorated. I got back with her on the last Thursday in June. She did comps the next day. She came up with a strategy Monday the 3rd of July. And I had a great offer on July 11th and we closed on the 14th, 2 weeks after the process started. She was professional, knew her area, and came up with the best offer for me. And she has a great smile, and personality that made working with her oh so easy.\n            \n\n              Rebecca B.,  7\/17\/2023\n            \n            \n              \n            \n            Testimonial Tree","name":"Michelle Autio\n          Sales Associate - REALTOR®","website":"Website","website-href":"https:\/\/michelleautio.robertsbrothers.com\/","agent_phone_numbers":"251-599-1959"}
{"web-scraper-order":"1754030699-4","web-scraper-start-url":"https:\/\/www.robertsbrothers.com\/roster\/Agents","agent_link":"More about Taylor","agent_link-href":"https:\/\/www.robertsbrothers.com\/bio\/tayloraustin","title":"SALES ASSOCIATE - REALTOR®","address":"200 N. OWA Blvd. Suite H\nFoley AL 36535","description":"About Taylor Austin\n      Taylor Austin is your dedicated real estate professional serving the beautiful Gulf Coast of Alabama. With a passion for art, socializing, reading, and traveling, Taylor brings a unique blend of creativity, adaptability, and enthusiasm to every client interaction.Originally from the small town of Brewton, Alabama, Taylor has recently relocated to the Gulf Coast in pursuit of a successful real estate career. Being from a small town, Taylor learned the importance of integrity and reliability when forming genuine connections. Taylor pursued academic and athletic endeavors in Brewton, attending the local college. Playing sports her entire life played a big roll in how she handles adverse situations. Sports instilled a strong work ethic, teamwork mentality, and competitive spirit, all of which seamlessly integrate into Taylor’s real estate practice.With years of experience in the service industry, Taylor has mastered the ability to connect with people from all walks of life and easily embraces the fast-paced nature of real estate. Patience, understanding, and a genuine desire to relate to others define Taylor’s approach, allowing for adaptation to any situation and ensuring a positive experience for clients.As Taylor puts it, Working with the community and the people within it is not just a job, but a privilege. Every interaction is an opportunity to make a positive impact and build lasting relationships. Taylor’s goal is to advocate tirelessly for clients, providing them with a personalized and unparalleled experience. Knowing her leverage with the reputation and achievements of Roberts Brothers Inc., Taylor hopes to showcase all of the knowledge Roberts Brothers Inc. continues to provide through out her journey. Taylor aims to use her expertise in social media marketing and plans to showcase properties effectively and reach a wider audience. Taylor aspires to become clients’ go-to-real estate agent, known for her integrity, professionalism, and dedication to exceeding expectations.","name":"Taylor Austin\n          SALES ASSOCIATE - REALTOR®","website":"Website","website-href":"https:\/\/tayloraustin.robertsbrothers.com\/","agent_phone_numbers":"334-313-2781"}
{"web-scraper-order":"1754030704-5","web-scraper-start-url":"https:\/\/www.robertsbrothers.com\/roster\/Agents","agent_link":"More about Janice","agent_link-href":"https:\/\/www.robertsbrothers.com\/bio\/janicearrington","title":"SALES ASSOCIATE - REALTOR®","address":"6721 Grelot Road, Suite A\nMobile AL 36695","description":"About Janice Arrington\n      She was born and raised in Mississippi, but relocated to Mobile, Alabama to further her education and embarked upon a new career path. She received her A.A. Degree in Business Administration from Jones County Junior College. As a business-oriented person, she endeavored into banking and accounting. As a life-long learner, she received her B.A. in Elementary Education from the University of Southern Mississippi. This milestone led her to receive her M. Ed. in Administration. She retired with 25 years of dedicated service from the Mobile County Public School System. As an entrepreneur, she also has experiences in buying and selling residential property. She is eagerly awaiting to assist your real estate needs during your buying and selling process. Besides investing time with others, she also enjoys spending time with her husband, daughter, and countless family members. \n      \n\n\n      \n\n\n   Testimonials\n  \n    \n        \n    \n          \n            Janice was 💯\n            \n\n              Lamar B.,  6\/28\/2025\n            \n            \n              \n            \n            Testimonial Tree","name":"Janice Arrington\n          SALES ASSOCIATE - REALTOR®","website":"Website","website-href":"https:\/\/janicearrington.robertsbrothers.com\/","agent_phone_numbers":null}
{"web-scraper-order":"1754030708-6","web-scraper-start-url":"https:\/\/www.robertsbrothers.com\/roster\/Agents","agent_link":"More about Sherry","agent_link-href":"https:\/\/www.robertsbrothers.com\/bio\/sherryarchibald","title":"SALES ASSOCIATE - REALTOR®","address":"6721 Grelot Road, Suite A\nMobile AL 36695","description":"About Sherry Archibald\n      Sherry’s roots trace back to the Midwest state of Ohio, but for the past two decades, she has called Mobile, AL home. Her familiarity with Mobile and its surrounding counties blossomed as she accompanied her children to various club sports events like soccer, football, volleyball, and golf. This firsthand knowledge of the area is just one of the many tools she possesses to assist you in finding your perfect permanent residence, rental property, or beach getaway. \nAs a real estate professional affiliated with Roberts Brothers, Sherry offers unparalleled access to top tier resources for both buying and selling properties. Roberts Brothers is renowned for its distinguished reputation of excellence and professionalism, positioning them as leaders in the real estate industry. Beyond her real estate, Sherry finds fulfillment in serving her church and local community, as well as enjoying leisurely walks on the picturesque campus of Springhill College  \nWhether you’re seeking to establish yourself in South Alabama or simply relax on the beautiful beaches, Sherry is committed to being your trusted guide. Reach out to Sherry today for personalized, reliable, and dedicated service that exceeds expectations.","name":"Sherry Archibald\n          SALES ASSOCIATE - REALTOR®","website":"Website","website-href":"https:\/\/sherryarchibald.robertsbrothers.com\/","agent_phone_numbers":"251-776-3318"}
{"web-scraper-order":"1754030712-7","web-scraper-start-url":"https:\/\/www.robertsbrothers.com\/roster\/Agents","agent_link":"More about Mark","agent_link-href":"https:\/\/www.robertsbrothers.com\/bio\/markandrews","title":"Associate Broker - REALTOR®","address":"900 Bienville Blvd.\nDauphin Island AL 36528","description":"About Mark Andrews\n      \n      When you are ready to buy or sell, contact me and let's put the plan together now. \n \n As a lifelong resident and successful business owner in Mobile, I am Ready, Willing, and Able to help you meet all your real estate needs. \n \n When you're ready to sell, I'll help you build a marketing plan to fit your needs and goals. Together with myself, the backing of more than 70 years of Roberts Brothers strength in Mobile and Baldwin counties, and more than 200 other Roberts Brothers agents, our efforts will move you closer to reaching your goals in real estate. I also want the buying process to be one that creates a lasting relationship that will bring you back to me now and in your future referrals. \n \n Feel free to contact me at MarkAndrews@RobertsBrothers.com through our office number (251) 661-4660, or direct cell (251) 591-4438.\n\n\n      \n\n\n   Testimonials\n  \n    \n        \n    \n          \n            Mark did a great job helping us find the home of our dreams. Look forward to working with him again in the future.\n            \n\n              Greg F.,  9\/25\/2023\n            \n            \n              \n            \n            Testimonial Tree","name":"Mark Andrews\n          Associate Broker - REALTOR®","website":"Website","website-href":"https:\/\/markandrews.robertsbrothers.com\/","agent_phone_numbers":"251-591-4438"}
{"web-scraper-order":"1754030717-8","web-scraper-start-url":"https:\/\/www.robertsbrothers.com\/roster\/Agents","agent_link":"More about Barbara","agent_link-href":"https:\/\/www.robertsbrothers.com\/bio\/barbaraandrews","title":"Sales Associate - REALTOR®","address":"29640 A Hwy 181, Suite 103\nDaphne AL 36526","description":"About Barbara Andrews\n      \n      Check out this fantastic private estate with 114 acres only 15 minutes from downtown Mobile!\nhttps:\/\/www.youtube.com\/watch?v=CVMwVrxxQSI\nPrime Location in Downtown Bay Minette!\nhttps:\/\/www.youtube.com\/watch?v=yFgeAKjCx-g\nCall me for a showing today!\nBarbara Andrews\n251-689-4942\n\nBeing a native Mobilian, I am an ambassador for our beautiful historic Gulf Coast. Growing up on Marine Street in downtown Mobile, playing in Washington Square, cheering at Ladd Stadium during the Senior Bowl while my dad reported stats for the Mobile Register or walking through the wooden revolving door of the children's room at the Ben May Library, give me \"story\" behind our location.\n\nAnd isn't real estate all about LOCATION!! LOCATION!! LOCATION!! Later moving to west Mobile county and helping my parents build our family home in Theodore, gave me experience in home construction, style and creative problem solving. Dad bought 14,000 bricks from the old LeVert home, staircases, doors, light fixtures from historic homes and incorporated them into our new home on Belle Terrace Drive. While in Theodore, I enjoyed fishing on Fowl River, skiing on Dog River and strolling in Bellingrath Gardens.\n\nI am married to Hamp Andrews and we have three married adult children, three adorable grandchildren and one on the way! We enjoy living on the Eastern Shore where we golf, go antiquing and cheer for our grands!\n\n\"It has been satisfying helping my customers achieve their real estate dreams. I have helped grandparents find homes closer to their grandchildren. Families are happier, needs are met and love is shared!\"\n\nIf you are looking to buy or sell, give me a call, text or email.\n\n\n      \n\n\n   Testimonials\n  \n    \n        \n          \n            Great to work with!\n            \n\n              John H.,  6\/26\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Barbara was excellent to work with! GREAT communication and was always available to answer any questions! I would rate higher than a 10 if I could! Thank you Barbara, you were an absolute pleasure to work with!\n            \n\n              Kathryn A.,  6\/26\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Barbara Andrews and Roberts Brothers did an outstanding job, from getting our home ready to list to the final closing. Barbara was so helpful and professional. She kept me informed and updated on each step of the process and was always available to answer any questions as they arose.\n            \n\n              Evelyn H.,  5\/19\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Barbara performed beautifully for us and made the transition seamless. As well as being a good friend, she is also a thorough and thoughtful professional realtor. We loved working with her and would tell others the same.\n            \n\n              Carter B.,  5\/15\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Barbara Andrews was excellent. I would highly recommend her. I actually have already! Thank you.\n            \n\n              Beth I.,  5\/4\/2025\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Barbara Andrews has helped me with buying and selling several properties. Every time, it has been more than pleasant. She is detailed oriented and is on your side. My last property was for sale and I had moved out of town. She kept me updated on the visual details of the property and the market there. She sold it for me and it was a breeze, even from a distance. She takes care of her clients. I highly recommend Robert’s Bros. Realty and Barbara Andrews!\n            \n\n              Rebecca J.,  12\/4\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Seamless transaction!\n            \n\n              Frances R.,  8\/20\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Barbara was truly a God-send to us! She quickly learned exactly what we wanted and needed and was strategic in the houses she sent us. That was very special! She relentlessly pursued our perfect house and even though we took almost 2 years to find it, she never gave up and kept the most positive, encouraging attitude. Barbara was always such a delightful person and never made us feel negative in any way. We would highly recommend her to be anyone’s agent! Thank you for a wonderful experience Roberts Brothers!\n            \n\n              Barbara L.,  6\/18\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Barbara is a great agent. She showed us homes for over 2 years. We worn her, out but her diligence paid off for us. After the long journey Barbara land our dream home. Thank you Robert's Brother's\n            \n\n              Fred A.,  6\/16\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            My past experiences include 5 years as a realtor and 25 years as a residential mortgage loan officer for BBT bank Florida. I have dealt with hundreds of realtors and I can very truthfully say that Barbara Andrews is one of the best I have had the pleasure of working with. Without Barbara, our purchase would never have come to fruition. She consistently went above and beyond to insure that our closing was successful and then helped us beyond measure with our move. I was out of the country and she jumped right in to meet contractors at the house and then to actually help all day with the actual move. She was truly a Godsend!\n            \n\n              Sue K.,  5\/28\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Working with Barbara Andrews throughout the marketing and sale of my property was first class. Thank you!\n            \n\n              Gerritt G.,  3\/26\/2024\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            I alone have bought and sold over 10 homes in my life. Barbara Andrews is one of the most dedicated and professional agents my with and I have ever worked with.\n            \n\n              Raymond R.,  12\/26\/2023\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Barbara Andrews is a top notch realtor and person. She went above and beyond for us in every way. She truly cares about her clients and treats them as real people with varying needs, tastes and emotions. I would heartily and highly recommend her to anyone looking for a realtor, as a buyer or a seller. I cannot say enough about Barbara. I have bought and sold 12+ homes before, and she was the best person to work with by far. Love her!\n            \n\n              Nancy S.,  12\/26\/2023\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Barbara Andrews was extremely helpful throughout this process. I enjoyed having her as our realtor. She went above and beyond to guide us through this transaction. Be glad to recommend her to anyone in need of a realtor in this area.\n            \n\n              Jeri A.,  8\/15\/2023\n            \n            \n              \n            \n            Testimonial Tree\n          \n        \n        \n          \n            Barbara was very knowledgeable in the area that we were looking and showed us many good options. Very easy to work with. She made the whole process easy for us.\n            \n\n              Carl D.,  8\/14\/2023\n            \n            \n              \n            \n            Testimonial Tree","name":"Barbara Andrews\n          Sales Associate - REALTOR®","website":"Website","website-href":"https:\/\/barbaraandrews.robertsbrothers.com\/","agent_phone_numbers":"251-689-4942"}
{"web-scraper-order":"1754030721-9","web-scraper-start-url":"https:\/\/www.robertsbrothers.com\/roster\/Agents","agent_link":"More about Susan","agent_link-href":"https:\/\/www.robertsbrothers.com\/bio\/susanandersen","title":"Sales Associate - REALTOR®","address":"200 N. OWA Blvd. Suite H\nFoley AL 36535","description":"About Susan Andersen\n       Susan is proud to be part of a team that has served our community for nearly 80 years. She shares the same deep commitment to clients and colleagues that has defined our company’s legacy. With 27 years of experience as a registered nurse in this very community, Susan has dedicated her life to caring for others. Now, she brings that same level of compassion, dedication, and attention to detail to every real estate transaction. Whether you're buying your forever home or selling a place filled with memories, Susan is honored to walk beside you through every step—now and in the future.\nThank you for choosing Roberts Brothers, and for placing your trust in Susan.","name":"Susan Andersen\n          Sales Associate - REALTOR®","website":"Website","website-href":"https:\/\/susanandersen.robertsbrothers.com\/","agent_phone_numbers":"251-609-0869"}
{"web-scraper-order":"1754030726-10","web-scraper-start-url":"https:\/\/www.robertsbrothers.com\/roster\/Agents","agent_link":"More about Rodney","agent_link-href":"https:\/\/www.robertsbrothers.com\/bio\/rodneyaldridge","title":"SALES ASSOCIATE - REALTOR®","address":"29640 A Hwy 181, Suite 103\nDaphne AL 36526","description":"About Rodney Aldridge\n      \n      Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority.\nAs a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none.\nThere's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen.\nNo matter your real estate needs, it would be my pleasure to assist you.","name":"Rodney Aldridge\n          SALES ASSOCIATE - REALTOR®","website":"Website","website-href":"https:\/\/rodneyaldridge.robertsbrothers.com\/","agent_phone_numbers":"704-860-5804"}
