{
  "@context": "https://schema.org",
  "@type": "Product",
  "image": "https://i5.walmartimages.com/seo/Campbell-s-Condensed-Cream-of-Potato-Soup-10-5-oz-Can_163ba47c-0b3c-4908-a628-13b98039e927.56ee23a9e64bb29d83b9b0c85ca27e4b.jpeg",
  "name": "Campbell's Condensed Cream of Potato Soup, 10.5 oz Can",
  "sku": "10321686",
  "gtin13": "051000016416",
  "description": "Add rich, creamy flavor to your favorite dishes with Campbell's Condensed Cream of Potato Soup. This vegetarian soup is crafted with potatoes and farm-fresh cream to provide a deliciously smooth foundation to any recipe. Use it as the hero ingredient in classic dishes like Easy Chicken and Biscuits, or substitute it for roux or bechamel as a sauce starter. Campbell’s convenient canned soup is a year-round pantry staple and a must-have for creating something quick and easy. It's also delicious on its own, topped with fresh herbs or a drizzle of olive oil, or enjoyed with a sandwich or salad. Simply mix the condensed soup with 1 can of milk and microwave on high for 3 to 3.5 minutes in a covered microwave-safe bowl, or heat in a pot on the stove, stirring occasionally. Each 10.5 oz recyclable can contains about 2.5 servings of microwave soup and features a non-BPA lining. From Cream of Potato to Chicken Noodle and everything in between, Campbell's makes delicious soups in flavors your family knows and loves, with quality, farm-grown ingredients in every can. M'm! M'm! Good! This product is packaged in a metal can, and is shelf-stable.",
  "model": "200000000000",
  "brand": {
    "@type": "Brand",
    "name": "Campbell's"
  },
  "offers": [
    {
      "@type": "Offer",
      "url": "https://www.walmart.com/ip/Campbell-s-Condensed-Cream-of-Potato-Soup-10-5-oz-Can/10321686",
      "priceCurrency": "USD",
      "price": 2.79,
      "availability": "https://schema.org/InStock",
      "itemCondition": "https://schema.org/NewCondition",
      "availableDeliveryMethod": "https://schema.org/OnSitePickup"
    }
  ],
  "hasMerchantReturnPolicy": {
    "@type": "MerchantReturnPolicy",
    "applicableCountry": "US",
    "merchantReturnDays": 30,
    "returnFees": "https://schema.org/FreeReturn"
  },
  "review": [
    {
      "@type": "Review",
      "name": "Creamy and Versatile Soup",
      "datePublished": "December 12, 2024",
      "reviewBody": "Campbell's Condensed Cream of Potato Soup is a versatile pantry staple that delivers a rich, creamy flavor perfect for enhancing recipes or enjoying on its own. The smooth texture and savory taste work wonderfully in classic comfort dishes like casseroles or as a base for homemade sauces.\n\nI love that it's vegetarian and made with farm-fresh cream and potatoes. While it's convenient and easy to prepare, it's slightly on the salty side when consumed alone, which is why I docked one star. That said, it's still an excellent choice for quick, hearty meals.",
      "reviewRating": {
        "@type": "Rating",
        "worstRating": 1,
        "ratingValue": 5,
        "bestRating": 5
      },
      "author": {
        "@type": "Person",
        "name": "Kelly"
      }
    },
    {
      "@type": "Review",
      "name": null,
      "datePublished": "June 27, 2025",
      "reviewBody": "use this soup in a clam chowder as the base ingredient.  not easy to find so i purchased plenty to have on hand.",
      "reviewRating": {
        "@type": "Rating",
        "worstRating": 1,
        "ratingValue": 5,
        "bestRating": 5
      },
      "author": {
        "@type": "Person",
        "name": "Jeanne"
      }
    },
    {
      "@type": "Review",
      "name": null,
      "datePublished": "January 14, 2025",
      "reviewBody": "I love this potato soup, no problem with the product, I done an online order and ended up getting 2 potato soup and 2 cheddar cheese which I thought this came in a 4 pack! I don't even like cheddar cheese soup. 🍜 if I can the chance I will return to store or give it away. I don't get out in cold weather or I'd shopped myself.",
      "reviewRating": {
        "@type": "Rating",
        "worstRating": 1,
        "ratingValue": 3,
        "bestRating": 5
      },
      "author": {
        "@type": "Person",
        "name": "Nancy"
      }
    },
    {
      "@type": "Review",
      "name": "Good, but too much salt!",
      "datePublished": "July 26, 2016",
      "reviewBody": "I enjoy eating this potato soup except I would like to get it in a Healthy Request receipe. The flavor and texture are good but there is too much salt for me to eat it frequently.",
      "reviewRating": {
        "@type": "Rating",
        "worstRating": 1,
        "ratingValue": 3,
        "bestRating": 5
      },
      "author": {
        "@type": "Person",
        "name": "ACutup"
      }
    },
    {
      "@type": "Review",
      "name": "Why?",
      "datePublished": "August 1, 2016",
      "reviewBody": "I have eaten this all my life.  I almost did not buy it this time due to the fact that for months I have found rotten and low quality potatoes in each can. I have pictures because I started to send them to Campbell's. This time I only found 1 bad potatoe so maybe they are getting back.  Campbell has always had high quality food, I hope they recover that reputation with me.",
      "reviewRating": {
        "@type": "Rating",
        "worstRating": 1,
        "ratingValue": 2,
        "bestRating": 5
      },
      "author": {
        "@type": "Person",
        "name": "Pat2"
      }
    },
    {
      "@type": "Review",
      "name": "A HAZARD TO EAT",
      "datePublished": "August 8, 2025",
      "reviewBody": "Could not eat it.  It was supper acid hot.  I started burning inside of mouth.  Two of us had the same result.  Had to put about 99.9% of soup into the trash.\n\nIn the past when we eat this soup it was not acid hot.",
      "reviewRating": {
        "@type": "Rating",
        "worstRating": 1,
        "ratingValue": 1,
        "bestRating": 5
      },
      "author": {
        "@type": "Person",
        "name": "WILLIAM"
      }
    },
    {
      "@type": "Review",
      "name": null,
      "datePublished": "August 4, 2025",
      "reviewBody": "The soup tasted spicy hot like jalapeño had been added. Others in my home tasted the soup and confirmed. POTATO SOUP SHOULD NOT HAVE JALAPEÑO FLAVOR IN IT!",
      "reviewRating": {
        "@type": "Rating",
        "worstRating": 1,
        "ratingValue": 1,
        "bestRating": 5
      },
      "author": {
        "@type": "Person",
        "name": "Michelle"
      }
    },
    {
      "@type": "Review",
      "name": "Damaged Item this time!",
      "datePublished": "October 31, 2024",
      "reviewBody": "Campbells Cream of Potato soup can was received damaged with a huge dent in can near top seal of lid of can. I didn't  want to take a chance seal was broken. I cannot  believe the picker employee thought this was ok to distribute in my delivery order! The usual response I receive is to return the item by 30 days.  I am unable to return this to the store since I am a handicapped person who doesn't drive anymore. In the garbage it went! This is happening too frequently…damaged food items, out of date items past expiration dates, or items that are missing from orders that were supposed to be in the shipment. How can I return something I never received! The computer generated AI is not helpful and a waste of time! It is very frustrating and very expensive.",
      "reviewRating": {
        "@type": "Rating",
        "worstRating": 1,
        "ratingValue": 1,
        "bestRating": 5
      },
      "author": {
        "@type": "Person",
        "name": "Betsy"
      }
    },
    {
      "@type": "Review",
      "name": "No Potatoe Soup",
      "datePublished": "March 13, 2025",
      "reviewBody": "We got 1 cream of potatoe soup and the can is badly crushed!  The other 3 cans are  cheddar soup and we don't eat that ! I was going to make dumplings and now don't have the potatoe soup !",
      "reviewRating": {
        "@type": "Rating",
        "worstRating": 1,
        "ratingValue": 1,
        "bestRating": 5
      },
      "author": {
        "@type": "Person",
        "name": "Viv"
      }
    },
    {
      "@type": "Review",
      "name": null,
      "datePublished": "June 30, 2025",
      "reviewBody": "did not receive it, only received 1 item out of a 26 item order!!",
      "reviewRating": {
        "@type": "Rating",
        "worstRating": 1,
        "ratingValue": 1,
        "bestRating": 5
      },
      "author": {
        "@type": "Person",
        "name": "leana"
      }
    }
  ],
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": 4.5,
    "bestRating": 5,
    "reviewCount": 887
  }
}