{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/makivajohnson", "description": "About Makiva Johnson Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Makiva Johnson", "website": "https://makivajohnson.robertsbrothers.com/", "agent_phone_numbers": null, "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/jenniferjohnson", "description": "About Jennifer Johnson As a dedicated retired military spouse, Jennifer understands the importance of finding a home that suits your family’s needs. With four wonderful children, two of which are now young adults, and her first grand baby, Jennifer has navigated the challenges and joys of family life and understands the unique needs of both buyers and sellers. Over the past five years, Mobile has become her home, and herself and her family have grown to love this community. Jennifer is excited to leverage her deep local knowledge and commitment to helping families find their ideal homes. Call, text, or email Jennifer today and let Jennifer do the work for you and your loved ones, ensuring you make the right move for your future. Jennifer is proud to be a part of the Roberts Brothers team, an excellent and professional company with a long-standing reputation in the industry. Rest assured, Jennifer is here to be your go-to resource in the community for all your buying or selling needs. Let Jennifer work for you, and make your real estate dreams a reality. Testimonials Jennifer Johnson was patient and incredibly helpful to me. As a first time home buyer, her expertise and knowledge was greatly appreciated and valued. She really listened when I told her what kind of features I was looking for in my future home, and she put in the work to find a house that came close to having it all. Her flexibility and dedication to setting up multiple viewings (and we saw A LOT), all lead to finding a beautiful house, that I can't wait to make a home! She is great at what she does and I am so thankful to have worked with her, as I went on this journey to start the next chapter of my life. Thank you! Emily C., 5/6/2025 Testimonial Tree I can't say enough good things about Jennifer. She tirelessly worked to get my house sold after I had moved to a different state and she made sure everything went smoothly from start to finish. Thank you so much for all of your hard work! Steve B., 3/5/2025 Testimonial Tree Jennifer Johnson was amazing and our total advocate during the home buying process! We knew she had our back the whole time, answered all our questions, and always made herself available to us! 10/10 stars Hayley M., 7/7/2024 Testimonial Tree", "name": "Jennifer Johnson", "website": "https://jenniferjohnson.robertsbrothers.com/", "agent_phone_numbers": "251-431-4199", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/angelajohnson", "description": "About Angela Johnson Angela is a native Mobilian, a dedicated and hardworking realtor with a true passion for helping clients achieve their real estate goals. With extensive experience in the industry, Angela has a deep understanding of the local market trends. Known for her professionalism, integrity and personalized approach, Angela takes the time to listen to her clients' needs and develop customized strategies to meet their specific wishes. Whether it's buying, selling or investing in real estate, Angela provides guidance, market insights and negotiation skills to ensure a seamless and successful transaction. Angela's background as an insurance adjuster helps her to provide valuable insights such as, a keen eye for detail when evaluating property conditions, property evaluation and negotiation skills. And throughout her career, she has built a vast network of industry professionals, including lenders, inspectors and contractors, allowing them to provide comprehensive assistance to clients at every step of the transaction process. Angela and her family attends Dayspring Baptist Church and she's an active member of her community. Angela's commitment to faith and her community values informs her work as an agent, fostering a compassionate approach when assisting clients in finding their dream homes. Angela cherishes every relationship she gets to build with her customers and clients, which typically turns into long time friendships. She understands that buying and selling property is one of the biggest decisions you will ever make. Angela is passionate about giving personal attention to every detail of every transaction so that her buyers and sellers can have a happy experience and make wise choices. Contact Angela today for all your real estate needs and experience firsthand her unwavering commitment to delivering exceptional service. Angela's motto: SOLVING PROBLEMS & ACHIEVING GOALS Testimonials Our realtor, Angela Johnson with Roberts Brothers, Inc., made searching for a new home and finally finding \"the one\" a fun and fulfilling time for my family and I. Angela was very professional and gave it her all in looking for the perfect home that met our needs. She did it and we are happily moving in this week! Thanks, Angela! Caryl Colburn Caryl C., 6/9/2024 Testimonial Tree As a first time home buyer I had no idea what I was getting into, but Angela was there to help at every step. She went above and beyond helping me find my new home I am super grateful... Leverne P., 6/5/2024 Testimonial Tree Angela was very helpful in showing us as many houses as we needed until we found our home! She made the process easy and was very helpful along the way. She is so friendly and Im so glad we chose her as our realtor! Kelsey and Israel B., 6/5/2024 Testimonial Tree", "name": "Angela Johnson", "website": "https://angelajohnson.robertsbrothers.com/", "agent_phone_numbers": "251-366-6171", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/johnnyjernigan", "description": "About Johnny Jernigan Born and raised in Mobile, Johnny has deep roots in the Gulf Coast. Johnny graduated from high school in Mobile and then married his high school sweetheart, Karen. They have been married since 1984 and their journey has taken many twists and turns. Johnny is an ordained minister and is a nationally known motivational speaker. He assists many churches with strategic planning in helping them develop a networking process to effectively serving the needs of their communities. That experience over the past 30 years has enabled Johnny to learn the value of team building, networking and a \"get it done mentality.\" Three wonderful children, influence in 13 nations and counting, millions of frequent flier miles and numerous relationships across the Gulf Coast, Johnny is perfectly positioned to help others buy, sell or develop their real estate needs. Johnny leads in a professional, relational and hard working process. From Johnny's heart to your home, people are at the heart of Johnny Jernigan's passion for life. So why did Johnny get into the Real Estate business? Whether buyer or seller, Johnny loves to help people. From any walk of life, Johnny has developed a pathway process to ensure that people succeed. By joining the award winning Roberts Brothers Real Estate Team, this allows him to bring his proven track record for life success to an efficiency at the real estate table. With a proven networking solutions process, social media marketing, integrated team connections with lenders, inspectors, contractors and other real estate specialist, Johnny can assist any buyer or seller. Johnny will give a personalized relationship with every client, from contract to close. So why would Johnny be a good agent for your real estate needs? His attention to the heart of every client. Traveling extensively over the past 30 years, Johnny is able to adapt to every situation and serve them uniquely as if they are his only concern. Listening is a lost art in modern culture. If we can listen to the heart and hope of every client, we can properly assist them in a smooth, efficient and hopefully, an enjoyable process for all of their real estate needs. Johnny has proven through these past 30 years of leadership training and professional networking that drive, determination and a \"whatever it takes\" mindset is indeed the answer. Johnny will assist every client with a professional and passionate process in serving their needs. Life experience, life passion and a love for people…..from my heart to your home. This is what agent Johnny Jernigan wants to share with you. Please call Johnny Jernigan at 251-622-0251 or email at: JohnnyJernigan@RobertsBrothers.com Testimonials Johnny Jernigan with Roberts Brothers went above and beyond for my mine and my husband’s home purchase. We were living 8 hours away from the property we were purchasing. Johnny met with repairmen and inspectors at the house on our behalf and was in constant communication with us. He also gave us great advice and wisdom on our offers. Courtney M., 12/27/2024 Testimonial Tree Meet with Johnny, prepped home for sale with a few of his recommendations. Had multiple offers on first day. Very smooth closing. Thank you Johnny Stephen and Angie H., 6/15/2023 Testimonial Tree", "name": "Johnny Jernigan", "website": "https://johnnyjernigan.robertsbrothers.com/", "agent_phone_numbers": "251-622-0251", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/shawnjenkins", "description": "About Shawn Jenkins Shawn Jenkins is energetic and full of life she loves this dream she gets to live on our beautiful Gulf Coast. Southern Alabama has always been her home, and she has a deep love for all this area has to offer. She is involved in everything this area has to offer from the beautiful old oaks with our Mardi Gras traditions to our coastal waters and warm beaches. After raising her family, she now loves spending time with her grandchildren and seeing them experience everything our area has to offer. She has worked with her husband Jake in the landscape and contract business for many Years and has a lot of knowledge on the uniqueness of each area. She is highly excited and motivated to help you find the area that will fulfill your dreams Roberts Brothers has served the Gulf Coast for 75 years and has the highest listings and sales in our area. She is proud to be a part of the Roberts Brothers family and their abundance of knowledge and commitment to excellence. Shawn is committed to giving her clients an experience of a lifetime with the utmost professionalism and care. Give Shawn a call and let her help you in this community we know as family. “The secret to selling is to sell what you believe in “Frank Bettger” Testimonials Shawn Jenkins took care of everything for me for the sale of my property. She was professional and responsive and kept me updated throughout the process. I highly recommend. Misty N., 7/28/2025 Testimonial Tree We worked with Shawn Jenkins and she did an excellent job navigating the fact that we were in two different locations and doing initial identification of properties prior to prioritizing what we bought. This is an older home and we knew there were projects we wanted to tackle prior to move in and Shawn worked with owners’ realtor to make that happen. Additionally, Shawn has a vast network in the area and gave us contact information for a handy-man, craftsman, plumber, potential cleaning service, yard and landscape options etc. Being from out of town, this was extremely helpful. Kathleen C., 6/20/2025 Testimonial Tree", "name": "Shawn Jenkins", "website": "https://shawnjenkins.robertsbrothers.com/", "agent_phone_numbers": "251-656-4434", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/vivianjackson", "description": "About Vivian Jackson When I was young, my father brought our family from Memphis, Tennessee to Atlanta, Georgia to pursue a career with Delta Airlines. I was originally licensed as a Georgia Real Estate agent in 1979. For the last twenty two years I was licensed in Atlanta with Metro Brokers Better Homes and Gardens. I am happy to now be in Alabama and with Roberts Brothers, Inc. I received a diploma in Interior Design at Lanier Technical College and became an ASP Accredited Stagging Professional. My husband and I recently relocated from Atlanta to Foley to be surrounded by water and beaches. Please let me aide you in staging your home and listing it for sale on the market or show you one of the many beautiful properties available here.", "name": "Vivian Jackson", "website": "https://vivianjackson.robertsbrothers.com/", "agent_phone_numbers": "4044023980", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/maddyireland", "description": "About Maddy Ireland Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you. Testimonials I would definitely recommend robert brothers especially if Maddy Ireland is the realitor . -josh Joshua J., 6/6/2025 Testimonial Tree Maddy was an absolute pleasure to work with. She was kind, engaging, knowledgeable, and extremely helpful with our journey to find a new home for me and my family. 10 out of 10 would recommend using her and I will definitely use her if needed in the future. Thank you! Crystal D., 6/6/2025 Testimonial Tree Maddy has been absolutely amazing during this process. She genuinely showed cared about not just the sale but for us as well. I would recommend her to everyone whether they are purchasing or buying, she can get it done!!!! Thank you for everything Maddy!!!! Darnesha D., 6/3/2025 Testimonial Tree Maddy Ireland is a great representative of Roberts Brothers. I have enjoyed working with her and getting to know. Keep up the good work! Harold J., 3/11/2025 Testimonial Tree Working with Maddy has been a delight! She was very knowledgeable, professional and a joy to work with! Melissa K., 3/8/2025 Testimonial Tree Our realtor who guided us with the purchase of our condo in Dauphin Island, Maddy Ireland, was attentive to details, responsive to questions and concerns and easy to work with. She made our buying experience a pleasant one! Catherine R., 11/5/2024 Testimonial Tree Maddy Ireland was a fantastic realtor and is very enthusiastic about her job. She kept us informed every step of the way and was a pleasure to deal with. We highly recommend Maddy to anyone interested in purchasing a property. Jon A., 11/5/2024 Testimonial Tree I cannot image a more satisfactory experience. Maddy Ireland did an excellent job from start to finish. She successfully marketed my property and quickly obtained a good price from a qualified purchaser. She kept me informed at every step, always responded quickly to any requests, and managed the entire transaction in a wholly professional manner. I would recommend her without reservation to anyone wanting to sell their home or other property. David K., 11/30/2023 Testimonial Tree", "name": "Maddy Ireland", "website": "https://maddyireland.robertsbrothers.com/", "agent_phone_numbers": "251-398-0098", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/kristihunter", "description": "About Kristi Hunter Your Goal is My Goal I am originally from Wyoming where I met and married my husband who was in the Air Force for 21 years. Throughout those 21 years we lived in Arkansas, California, the Philippines, and Germany. We did extensive travelling everywhere we went. We enjoyed learning new cultures and getting to know the many types of people and their customs everywhere we went. Being in the military was a great experience for our family. We had our son in Germany and later adopted our daughter from China. We moved to Mobile after retiring from the Air Force and have lived here for almost 20 years. From moving so much, I have learned to communicate with many types of people and cultures and made lots of friends along the way. I now incorporate that into my business by getting know my clients and what is important to them. My goal as a Realtor, is to help my customers with their goal of either buying or selling a home. I understand this is one of the biggest investments people make in their lives. Therefore, I strive for excellent commuication so I can help them achieve their goal. Also, important to me is to build a friendship with all my clients that go beyond the real estate transaction. Real Estate for me, is a tool for helping others and building new relationships. I also am the Administrator for the Academy of Real Estate at Roberts Brothers. I get to help new students with the process of becoming a Realtor. Again, helping people achieve their dream of becoming a Realtor is truly satisfying. In my free time, we still love to travel and spend time together with family and friends. We enjoy doing many activities from board games to disc golf to going to the mountains and amusement parks. We also enjoy our church helping in different ways there. Client Testimonial \"Kristi Hunter was always available to assist with any questions and concerns. Her customer service and knowledgeable expertise was invaluable in purchasing our new home. She provided additional information due to our move to AL from out of state and gave helpful insight and resources to make the transition an easy one. Kristi is the realtor you want to use for sure!\" -Sandra \"Kristi Huter made my home buying process as stress free and fun as possible. It was my first home and she told me and showed me everything I needed to know. She is a very honest and amazing real estate agent and I would always and currently do recommend her to anyone wanting to sell or buy a home.\" Kacey Testimonials Kristi did everything possible to make the buying and selling experience as pleasant as it could possibly be. Reagan L., 6/29/2024 Testimonial Tree Kristi has been our realtor 3 times - twice as our selling agent and once as our buying agent. We chose Kristi initially at the recommendation of a friend and subsequent times because of the quality of her services. Professional, prepared, and prompt she makes real estate exchanges easy. Easy going, she takes the stress out of the process. Above all, trustworthy, she has our best interest at heart, keeps her word, listens to our desires, and chooses honesty and openness in all her dealings. No matter what was needed, from window replacements to painting, she was there to point us to reliable sources to get the jobs done. Utilizing excellent marketing strategies & extensive company resources, she helped us get under contract within a couple of weeks each time. She is an excellent realtor. Hannah W., 6/20/2024 Testimonial Tree Kristi Hunter has been so amazing to us. Four years ago we bought our home while working with her, and we sold that same home four years later. She has been so knowledgeable, patient and helpful during both sales. We feel so lucky to have found her and recommend her to others. Orly N., 6/22/2023 Testimonial Tree Kristi was wonderful. We bought and sold our home with her and each step along they way she was knowledgeable, patient and well-informed. All of her advice was spot on, and she had excellent recommendations for us along the way. OrlyNaum, 6/14/2023 Testimonial Tree I am beyond happy I chose Kristi to be my realtor to find my first home. She is understanding, knowledgeable, and a true professional. I was assured and at peace throughout the process. She cared about my purchase and responded to me quickly. KaceyWard4, 6/1/2022 Testimonial Tree I am beyond happy I chose Kristi to be my realtor to find my first home. She is understanding, knowledgeable, and a true professional. I was assured and at peace throughout the process. She cared about my purchase and responded to me quickly. Kacey26, 5/2/2022 Testimonial Tree Kristi was highly knowledgeable, friendly, and professional. She used the information I provided and showed me a variety of good possibilities. She was always available for my many questions and went above and beyond providing additional resources before and after my move. I would definitely recommend her to anyone house hunting. She’s a pleasure to know and work with. sandra0127, 6/1/2020 Testimonial Tree We recently bought and sold a house with Kristi. She was extremely knowledgeable about the market and house buying &amp; selling process. She listened dilligently to what we wanted and worked nights and weekends to fit our schedules. Kristi was very patient with us and answered all our questions and concerns. She was determined to sell our house for top dollar and get us the best deal on our new house. She made what could have been a very stressful process, very smooth. If you are buying or selling, you need Kristi's patience, knowledge, and work ethic. She genuinely cares for each of her clients and works tirelessly for them. Buyer0819, 7/1/2019 Testimonial Tree A co-worker recommended Kristi to us and we are so glad we worked with her to buy our first home. We were on a short timeline to purchase a home and Kristi was very willing to work late with us and on weekends to search for the right home. She was very knowledgeable and worked with a builder to find us a new construction in addition to scheduling showings with existing homes. She very diligently asked us what we did and did not like about the homes as we toured each one, and used that information to recommend additional homes. She spend time educating both my husband and I on the homebuying process and we felt she was genuinely invested in helping us find the perfect home. She maintained great communication along the way, and sent us pictures and updates of our home as we were out of state for the majority of the home buying process. Overall we are extremely pleased with Kristi. She is a wealth of knowledge for local resources which extend beyond the purchase of a house and the services necessary to make it a home. jacob r., 6/1/2019 Testimonial Tree We recently bought and sold a house with Kristi. She was extremely knowledgeable about the market and house buying & selling process. She listened dilligently to what we wanted and worked nights and weekends to fit our schedules. Kristi was very patient with us and answered all our questions and concerns. She was determined to sell our house for top dollar and get us the best deal on our new house. She made what could have been a very stressful process, very smooth. If you are buying or selling, you need Kristi's patience, knowledge, and work ethic. She genuinely cares for each of her clients and works tirelessly for them. Buyer0819, 5/13/2019 Testimonial Tree Kristi helped me work with a tight budget with high expectations. Her willingness to listen when it seemed like an impossible quest earned her my respect and appreciation. She is genuine and sincere. Absolutely honest. theocentric1, 6/1/2018 Testimonial Tree We were out-of-state (WAY out of state) owners of an executive home in West Mobile. Kristi not only worked tirelessly to show the house (including multiple open houses) she also acted as our local rep to oversee minor maintenance and repairs. She checked in with us almost daily to update us on showings, etc. and to address any concerns we might have, and offered outstanding advice on sale negotiations. Finally, she gladly represented us at closing, making our long-distance communications with the closing agent and buyers easy and friendly. A superb professional realtor! TTMaine, 7/1/2017 Testimonial Tree We have bought two houses with Kristi in the last year. One for us and one for my parents. Very patient and knowledgeable. Always had time to answer questions, etc. Nothing short of professional and easy to deal with. Highly recommended. jmdean71, 6/1/2017 Testimonial Tree I purchased a home with Kristie as the Realestate Agent, and sold one with her within a six month time frame. Both of these transactions were handeled very smooth and professional to my satisfaction. I'm amazed at the poise and professional experience she has gained in such a short time in the Reality business. I have recommended her to others and will continue to do so. Eurie Williams willipat, 6/1/2016 Testimonial Tree We are military therefore have bought and sold many homes. Kristi through hard work and diligence sold our home in under 10 days in a market that I expected it to take as many as 120 days. She provided professional flyers, held an open house and followed up on all inquiries on our home. She researched the market and was able to help price the home to sell and it did... quickly! She truly made us feel we were her most important client at all times. I would defiantly say she is a premier seller's agent as well as a buyer's agent! user8999672, 9/1/2015 Testimonial Tree Kristi was amaizing! We were relocating to a different state and Kristi eased our minds on the whole process and actually sold our home of 17 years in 3 DAYS!! She was always available to answer any questions I had for her. jamiecmccullough, 8/1/2015 Testimonial Tree First time my husband and I had fun selling a house. Kristi is an absolute joy to work with. She was confident from the beginning that she would sell our house quickly. She sold it in less than seven days! Kristi obviously cares about her clients and clearly wanted to sell our house as much as we did. Our questions were answered before we asked them. She knows her job well. She responded astonishingly quickly to all of our queries and concerns. Kristi is a confident, diplomatic realtor who gets the job done with impeccable proficiency. This seasoned (old) military couple would highly recommend Kristi without hesitation for all your real estate needs. zuser20150317143404204, 7/1/2015 Testimonial Tree As first-time home buyers, Kristi made the buying process superb from A to Z. Determined to help us find 'the one' for our family, she showed us as many homes as it took before we were ready to make an offer. She brought knowledge and expertise to the table, while always sticking to our budget and family goals. Throughout the whole process Kristi was prompt, professional, and very easy to communicate with. I would recommend her to family and friends, it truly has been a pleasure! We love our new home and couldn't be happier. user2364717, 6/1/2015 Testimonial Tree As first-time home buyers, Kristi made the buying process superb from A to Z. Determined to help us find \"the one\" for our family, she showed us as many homes as it took before we were ready to make an offer. She brought knowledge and expertise to the table, while always sticking to our budget and family goals. Throughout the whole process Kristi was prompt, professional, and very easy to communicate with. I would recommend her to family and friends, it truly has been a pleasure! We love our new home and couldn't be happier. user2364717, 4/22/2015 Testimonial Tree", "name": "Kristi Hunter", "website": "https://kristihunter.robertsbrothers.com/", "agent_phone_numbers": "251-802-7576", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/dianehunter", "description": "About Diane Hunter Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you. Testimonials HIGHLY RECOMMEND! Diane was great to work with in the purchase of our new condo at Lighthouse on the Bay! She knew a lot about this beautiful property and we got all of our questions answered. She has even followed up a couple of times since closing to make sure we did not need anything or have any questions. It’s a rare thing these days when you get service after the sale. We would definitely reach out to Diane again if we are in the market to either buy or sale property in Baldwin County. Pam and Trey M., 7/8/2025 Testimonial Tree She is the best Realator we have had the pleasure of using in the sale of our property. Judy Miles Judy A., 7/2/2025 Testimonial Tree Diane is INCREDIBLE. Absolutely 5 star service. She helps and fights for you every step of the way and walks you through every piece of the process to make sure you don’t get lost in all the paperwork. Cannot recommend Diane enough. She is amazing!! Nickolas K., 5/20/2025 Testimonial Tree Diane took care of our needs in the purchase of the home on Dauphin Island Amy E., 5/14/2024 Testimonial Tree I had a wonderful experience working with Diane Hunter! She found exactly what we were looking for! She is very helpful and caring. Thanks Diane! Stephen C., 2/28/2024 Testimonial Tree", "name": "Diane Hunter", "website": "https://dianehunter.robertsbrothers.com/", "agent_phone_numbers": "504-913-5392", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/nancyhughes", "description": "About More information about me. Its All About You... We are all unique and each of us will approach buying or selling a home in our own way. As a Full Time Realtor for over 20 years I enjoy working to make your Real Estate experience easy and comfortable for you! I enjoy delivering specialized service that caters to your lifestyle and decision making. I am available days, nights and weekends to work around your schedule so lets talk about it! Give me a call! I am here for you! Nancy Hughes 251-605-0179 NancyHughes@RobertsBrothers.com About Me... I am a full-time REALTOR in Mobile since 2003. I work for the leading/largest Real Estate Companies in South Alabama. Served on the Executive Board of Directors of Mobile Area Association of REALTORS. Served on the Community Relations Committee of Mobile Area Association of REALTORS Serves on the Board of Directors of Family Promise. I love spending time with my family, friends, photography, and volunteering. Testimonials Your office helped me purchase this property 5 days after Hurricane Katrina in 2005. I remember how easy and effortless the entire process was back then. No wonder I reached out to your office again this year when it came time for us to sell the townhouse. Nancy called us right away and went to work. She assisted us every step of the way in finding sub contractors to fix all aspects of the property since we live in New Orleans and it was a challenge getting things done from here. All the repairs were done on time and she lists and sold the property in a couple of weeks, well above the price we had in mind. Nancy is a dedicated professional with a thorough understanding of the market. We were able to get the entire transaction completed without a single trip to Mobile. We are extremely happy with Nancy and your agency overall! Raj M., 9/20/2024 Testimonial Tree We are from out of the area and Nancy was instrumental in helping us to prepare for sale and finally accept a good offer. We are so appreciative of the communication and follow-through on her part. She attended to every detail. We couldn’t have done it without her help. I would highly recommend Robert’s Brothers and especially Nancy Hughes for your realty needs. Michelle M., 9/18/2024 Testimonial Tree Nancy Hughes was very helpful in our first-time homebuyer process! We appreciate her answering all of our questions with a quick response. We are loving our new home and can't wait to make many memories here! Courtney M., 8/6/2024 Testimonial Tree Nancy did such a fantastic job and was always available to help. She also did a very good job communicating. Really appreciate all of her hard work! Brandon W., 5/16/2024 Testimonial Tree Nancy Hughes has been so helpful and has gone above and beyond for our family. She sold us the house 4 years ago and then helped us re sell it this month. Being out of town could have made things difficult, but Nancy had everything moving so smoothly for us. Absolutely no hiccups to speak of. Thank you Nancy and Roberts Brothers! Cindy S., 4/26/2024 Testimonial Tree Nancy was very helpful to us in obtaining the best sales price and went above & beyond helping to coordinate various consultants. Carl S., 4/25/2024 Testimonial Tree My husband and I have brought and sold a home with Robert Brothers. Our realtor is Nancy Hughes, she made process very smooth. Nancy is one in a million, very professional from beginning to end. Shelia G., 3/4/2024 Testimonial Tree Nancy Hughes has been very professional, caring, respectful, attentive and patient during the process of searching, purchasing and the closing of our home. I feel like she is apart of our family now. Shelia G., 1/4/2024 Testimonial Tree Nancy Hughes is wonderful. It was quite a search as we both knew my exact wants, needs and amt to spend. When the right house appeared, she worked tirelessly guiding me thru all the steps involved . Her knowledge of the home buying process, ability to understand what her clients are looking for in a home, willingness to search till finding THE house and her cheerful personality combine to make her the perfect realtor. Thank you Nancy! Carla S., 9/12/2023 Testimonial Tree", "name": "Nancy Hughes", "website": "https://nancyhughes.robertsbrothers.com/", "agent_phone_numbers": "251-605-0179", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "559 North Section St. Fairhope AL 36532", "profile_url": "https://www.robertsbrothers.com/bio/dianehorst", "description": "About Diane Horst I have been a Realtor in Mobile and Baldwin Counties since 1996, specializing in Eastern Shore, South Baldwin resort and historic properties. I have a ABR designation and am a member of The Council of Risidential Specialists. My greatest compliment is repeat business and referrals from past clients. My formal educaton is in design. Over the past 35 years, I have, and continue to, serve on numerous civic and historic preservation boards, locally and in Northern Virginia. I am a lifelong member of St. Pauls Episcopal Church, Mobile, AL.", "name": "Diane Horst", "website": "https://dianehorst.robertsbrothers.com/", "agent_phone_numbers": "251-490-7644", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/rachelhodges", "description": "About Rachel Hodges After holding a real estate license in her home state of Connecticut for several years and gaining experience across multiple facets of the industry, Rachel and her husband made the move to the beautiful Mobile area in 2022.Rachel recently joined Roberts Brothers, a well-respected company that serves all the local counties and is known for its exceptional support. In fact, Roberts Brothers played a key role in helping her and her family relocate from Connecticut to Alabama, making the transition a smooth and positive experience.Now, Rachel is eager to help buyers and sellers navigate the real estate market in Mobile and the surrounding communities. With a passion for real estate and a deep appreciation for the Gulf Coast lifestyle, Rachel is excited about this new chapter both personally and professionally.In her free time, Rachel enjoys baking, visiting farmers markets, reading, gardening, spending time with her family—including her dogs and chickens—meeting new people, and exploring everything this vibrant community has to offer.", "name": "Rachel Hodges", "website": "https://rachelhodges.robertsbrothers.com/", "agent_phone_numbers": "860-822-3514", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/billhinton", "description": "About Bill Hinton Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you. Testimonials Great job promoting the home from the start that provided sellers on the first day! Christopher M., 6/30/2025 Testimonial Tree I was shopping around for lots in Spanish fort and they answered my inquiry. Provided all the documents I needed prior to getting under contract. I was able to close on the properties within a month. It was easy and they were a great help. Thanks again. Blake A., 5/13/2025 Testimonial Tree Bill was great and very helpful through the whole process with anything we needed! Rachel D., 3/11/2025 Testimonial Tree Bill did a good job. He kept us informed all along the way. Closing was quick. Minette H., 9/5/2024 Testimonial Tree Bill Hinton is excellent and goes the extra mile. Linda L., 8/22/2024 Testimonial Tree From the very 1st Phone Call that I made to Mr. Hinton about the Property he had listed , he answered all my questions and was very helpful through the whole process on me Purchasing the Property . Thank You , Mr. Hinton . Buck Fillingim Harold E., 7/2/2024 Testimonial Tree Bill Hinton did an excellent job! He kept me informed on what I needed to do to accomplish my move to Alabama. I feel like my move was smooth because of his experience and excellent service! Rachelle H., 6/6/2024 Testimonial Tree Bill Hinton went above and beyond to facilitate my move to Alabama. He communicated with me and helped guide me through the process. I feel like my move was smooth because of his excellent service! Rachelle H., 6/6/2024 Testimonial Tree Bill was the best Christi Z., 12/5/2023 Testimonial Tree He did a great job Frank M., 11/4/2023 Testimonial Tree Bill Hinton is in a class of his own. He went above and beyond our expectations. He helped us in every aspect. I truly believe that without someone with his acquired knowledge and skills could have sold our home. We originally bought our home from Bill and when it was time to sell, we didn't think twice about who we wanted to handle it. Linda S., 9/3/2023 Testimonial Tree", "name": "Bill Hinton", "website": "https://billhinton.robertsbrothers.com/", "agent_phone_numbers": "251-454-5830", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/emilyhatcher", "description": "About Emily Hatcher As a lifelong resident of Mobile I know what makes Southwest Alabama, and especially Mobile and Baldwin Counties such a uniquely special place to live. I have developed a great knowledge of neighborhoods, public spaces and cultural events throughout Mobile and use that in helping my clients to find not only the best home, but the perfect place to put down roots and build friendships. After graduating the University of Mobile with a bachelor's degree in Phycology, with a History minor, I spent three years with the Mobile Area Chamber of Commerce working in Membership Development. I became interested in real estate through local business associates. I joined the Robert's Brothers Team in August of 2020 with a multi-million-dollar sales year. My greatest joy in real estate is to help someone find a place to call their own; a place that fulfills all the desires they mentioned in our first conversation. I am a member of the local, state and national Association of Realtors, and an Ambassador for the Mobile Area Chamber of Commerce. I am continuing to develop my knowledge and understanding of real estate as I am currently working on my Brokers License. My husband Ray and I have four children, and when they are not involved in various team sports, we enjoy travel and the beach. We are members of South Coast Church in Mobile. Testimonials Emily is a phenomenal realtor. She is extremely knowledgeable of the entire process and area. She is patient and will keep you up-to-date all all information regarding your transaction. 10/10 would use again! Zachary N., 4/2/2025 Testimonial Tree Emily Hatcher provided five star service in all departments.. Emily was prompt and efficient in all areas and went above and beyond the call of duty at every turn. No one could ask for a better realtor or representative for their transaction. Thank you again and look forward to working with you in the future! Daniel M., 12/10/2024 Testimonial Tree Emily always works through all the issues related to negotiations of the initial contract and the final closing. Very knowledgeable! Emily has handled 4 houses for us in the last six months with prices ranging from $169k to $775k. Affordable H., 7/13/2024 Testimonial Tree Our agent is always on top of everything and makes the process move quickly and smoothly! Affordable H., 6/23/2024 Testimonial Tree Emily always handles every detail of my transaction in a professional and friendly manner. I am able to leave everything with her and know that it will be done on time and completely! Terry H., 5/30/2024 Testimonial Tree Emily did a great job communicating with us through the sales process. Addressed our concerns as well as those of the buyer. Robert T., 5/23/2024 Testimonial Tree", "name": "Emily Hatcher", "website": "https://emilyhatcher.robertsbrothers.com/", "agent_phone_numbers": "251-487-0198", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/richardharski", "description": "About Richard Harski With over 16 years of experience, Richard has made his mark on the real estate industry. \"Let's Get Moving\" is his mantra-and shows in the results of his energetic business style and strong work ethic. Consistently in the top 10 % company-wide, Richard recently started his own real estate team, offering his clients next level service. A native Mobilian, Richard earned his degree in Business Administration from Auburn University. His grandfather was a real estate investor, and having the opportunity to watch him was an inspiration to Richard. Although he began his career in the banking industry, Richard found his calling in real estate in 2011. In 2014, he joined Roberts Brothers. Richard enjoys giving back to his community as an active volunteer and financial supporter of the many incredible hospitals along the Gulf Coast. He and his wife often give to and attend charitable events at USA Health Children's and Women's Hospital and The Mitchell Cancer Center and University Hospital. Married for 15 years, Richard and his wife, Nichole, have 8-year-old twins, George and Camile and their white lab named Daisy. They live in Mobile, AL. When he's not listing and selling real estate, Richard enjoys boating on the beautiful waterways of coastal Alabama and taking advantage of observing the plentiful wildlife in Mobile's timberlands. Testimonials Richard Harski did an excellent job with the sale of our house. He communicated quickly and effectively. He gave us really solid insight and direction. Made the whole process very smooth. Couldn't recommend him enough. John H., 6/23/2025 Testimonial Tree Richard Harski has been an outstanding agent, constantly following up on potential leads, invaluable advisor. I recommend him unequivocally and without reservation to anyone, looking for an agent to help sell real estate. The E., 6/18/2025 Testimonial Tree We had a great experience. Thank you! Blair P., 5/28/2025 Testimonial Tree I cannot complement enough the attentive communication we received from Richard Harski. It is also helpful that, simply put, he is just a nice person that really cares, which makes what could be a stressful process much more pleasant. I would recommend him highly. Paul S., 3/14/2025 Testimonial Tree Richard worked tirelessly to market and sell our family home. He was creative and highly engaged with a pool of potential buyers from the instant we listed with him. He understands the market and gave excellent advice each step of the way. In addition to being a genuinely nice person, he is a true professional and I recommend him and his team unequivocally and without reservation. The E., 1/2/2025 Testimonial Tree Despite the fact that I reside many miles away from where I was looking to purchase a property, Richard made the property search and sale process go very smoothly. Richard and his staff worked diligently to provided the necessary information and offered remote showings to assist in my ability to make an informed decision about the properties I was interested in. Jeremy, 12/16/2024 Testimonial Tree Best agent we have ever had. Pays attention to every detail, has great market insight, works aggressively for his client’s best interests, and is always accessible and quick to respond to any questions. Bryan S., 12/14/2024 Testimonial Tree Richard kept us updated and was always willing to answer our questions. Janet E., 10/19/2024 Testimonial Tree Richard communicates very well! He also is not too proud to admit he will have to look up an answer if he doesn’t know it already. Those things make the transaction much less stressful. Thank you Bernie W., 10/19/2024 Testimonial Tree I really enjoyed working with Robert's Brothers. Richard was extremely professional, helpful, and communicative. He was easy to work with and helped me find a great house. I will definitely call Richard again in the future when I need a realtor. John S., 5/30/2024 Testimonial Tree Richard Harski is a fine real estate agent. He knows the market and has an ability to work with the other agents and to get a deal done. He's a finisher! Gary G., 3/13/2024 Testimonial Tree Richard went above and beyond in assisting us with this small land purchase. I cannot thank him enough. You have a great young man working for you. I wished we had some like him in our Corrosion Engineering business. Leo C., 1/3/2024 Testimonial Tree We searched many houses with Richard and had many offers accepted but kept leaping from the deal due to exisiting damage. I was therefore a little afraid that every time we asked Richard to show us a new house, he'd think we were wasting his time but he was always very receptive to us, no matter the time of the day or day of the week. Maybe he knew we were going to purchase a house before we knew ourselves! Eddie C., 12/21/2023 Testimonial Tree Richard is/was amazing through the whole process and communicated everything with me quickly and clearly. Selling your first home can be an emotional roller coaster, too. He was patient and understanding with me plus knew who to call to get the sale going and done. Highly recommend!! Carol J., 12/11/2023 Testimonial Tree Richard Harski was an exceptional agent. He was always available and always 2 steps ahead. Made the entire process smooth and easy. Very friendly and personable. He made what would normally be a stressful transaction very pleasant and easy. Owltstanding agent! John H., 11/2/2023 Testimonial Tree Richard was a consummate professional and went above and beyond in all aspects of our business dealings. Without a doubt the easiest experience I’ve had selling a property. Tyler Reeve Robert M., 9/17/2023 Testimonial Tree Richard Harski is an awesome person with great experience, respectful, and working towards your best interest. All ways comes with a plan to get things done. José A., 8/14/2023 Testimonial Tree My wife and I have used Richard on multiple occasions (both as buyers and sellers) over the years. Recently he found a property for us that is exactly what we had been looking for. Amongst other offers already in place, he put us in a position to acquire that property. He communicates well throughout the entire process, is energetic and truly wants what is best for his clients. If you're looking for someone to service your real estate needs in this highly competitive market, Richard should be your first call. Josh C., 6/15/2023 Testimonial Tree Richard and I have worked together and many deals over the past year. Always on top of things so closing are quick, never a break in the line of communication and very helpful with setting up inspections, closing, etc Russell G., 6/15/2023 Testimonial Tree Richard takes a personal interest in helping you find what you want. He has been great in helping my wife and I buy and sell two houses as well as some recreational property. Highly recommended. Todd O., 6/15/2023 Testimonial Tree Richard went above and beyond throughout the buying and selling process. He is very experienced, easy to work with, and maximized our profits. I would highly recommend! Grant S., 6/15/2023 Testimonial Tree Richard assisted me in purchasing my first home. I had a lot of questions and concerns during the process. He was able to answer my questions & made everything so easy. He is professional and is very experienced. I would highly recommend! Sarah S., 6/15/2023 Testimonial Tree", "name": "Richard Harski", "website": "https://richardharski.robertsbrothers.com/", "agent_phone_numbers": "251-423-7830", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/erinfowler", "description": "About Erin Fowler Erin has always felt incredible blessed to call Real Estate her passion. She doesn’t just love it. She breathes it.With over two decades in the real estate industry, she serves as an experienced leader, educator, and go-to expert in Relocation. A real estate professional since 2001, Erin holds a license in three states: Mississippi, Alabama, and California. Her family transferred to the West Coast and then back to the Mississippi Gulf Coast in 2018. She has served as a dedicated leader in her community, including many years with the Alabama State Chapter Women's Council of REALTORS.As a Certified Relocation Specialist, she has mastered the process of buyer and seller transferee packages provided by employers and the conditions that need to be fulfilled to maintain those benefits. High Standard Service is at the forefront of everything she does, and the personal connection she creates with her buyers and sellers extends beyond the closing process. Whether it be helping her buyers get acclimated to their new communities or assisting her sellers in choosing a trusted realtor in their new location, Erin is a dedicated professional from start to finish.Her family has always been her biggest support. She and her husband, David, have been married for 34 years and have two sons. Her older son Andrew and his wife, Amanda, have a daughter, Caroline. Luke, her younger son, is married to Jordan. In her free time, she loves traveling, spending time with her granddaughter, Caroline and relaxing with her Cavalier King Charles, Bella Rose. Testimonials Erin is the Realtor I didn’t know I needed! She helped me navigate all of the challenges of buying a new home from out of state and also brought her personal touch of peace and guidance to help me stay focused through each stage. From the first showing (of many!) to closing day several months later, she patiently walked me through contracts, inspections, buyers’ rights and sellers’ responsibilities, and always responded quickly to my concerns. I’m grateful to Erin for her knowledge, her practice, and for being part of the amazing team of professionals who helped make this adventure possible. Patricia J., 9/10/2024 Testimonial Tree Erin was amazing and very helpful throughout the selling process. She always did a great jop to ensure the potential buyers were legitimate and minimized the back and forth between parties by asking questions ahead of time and being prepared. She even went out of her way to help support getting some of the negotiated tasks completed. Matt H., 8/7/2024 Testimonial Tree Ms Erin Fowler was just about the best real estate agent a client could ever ask for. She went over and above the call of duty to make our home sale a seamless and painless success. We are forever grateful for her and for her partnership with Roberts Brothers Real Estate. I would recommend their services for any real estate transaction without hesitation. Thank you from the bottom of our hearts. Andrew M., 8/1/2024 Testimonial Tree Erin Fowler was great to work with. She did an outstanding job marketing and selling our home in Ocean Springs. We would work with her again and would recommend her to others. Steven C., 6/27/2024 Testimonial Tree We love Erin! She helped us navigate the process of buying our first home and was so helpful that we chose to work with her again to buy our second home. I cannot emphasize how quick and painless the process was. Erin is very responsive and I trust her to look out for our best interests. 10/10 would recommend:) atpitocchi1, 3/6/2024 Testimonial Tree My family was fortunate enough to have Erin assist with a relocation move. Erin was simply the best! Her knowledge of the market and the process was incredible. Erin made sure that we were updated every step of the way and went above and beyond by assisting with tasks that were not necessarily her responsibility. I highly recommend utilizing Erin's expertise for any and all real estate transactions zuser20200712125514500, 2/19/2024 Testimonial Tree Erin went above and beyond in helping me sell my parents home. Her ideas for a sale were spot on and she assisted in ways she did not have to (including with a last minute ceiling collapse on closing day!). Erin communicated with me every step of the way, even when she was on vacation on planning her son's wedding. She is the absolute best at what she does and I would highly recommend her for any real estate needs! schurch970105, 10/23/2023 Testimonial Tree Erin represented us for a relocation move and was awesome to deal with. Her knowledge of both the market area and the relocation process helped us tremendously. Erin was always reachable and answered any and all questions we had during the process. She definitely became family. I would highly recommend Erin for any and all your Real Estate needs. steve z., 9/19/2023 Testimonial Tree Erin did a tremendous job, couldn’t ask for more! She was responsive, took quick action, met all our size and prize objectives and how’d us work through our unique situations. Highly recommend Erin to anyone looking in the Ocean Springs area. rlang321, 9/16/2023 Testimonial Tree Erin is like family to us. She always operates with the utmost integrity and trust. She got us into Ocean Springs and she was the only person we trusted when we needed to move. No one knows OS and the surrounding areas like Erin. She is a rock star! stephanie h., 9/15/2023 Testimonial Tree Erin knocked it out of the park for us again, this time with the sale of our home! We worked with Erin to buy in Ocean Springs and were 100% certain we would again when we sold our home. Her knowledge of the area, expertise in handling the complexities of corporate relocations, and excellent communication are unmatched! Thank you, Erin for going above and beyond for us once again! We will recommend Erin to anyone we know relocating to Ocean Springs! candice g., 8/3/2023 Testimonial Tree My family recently had the pleasure of working with Erin as our realtor, and we cannot recommend her highly enough. Erin truly goes above and beyond to ensure her clients' satisfaction. Her professionalism and dedication were evident in every step of the transaction. Throughout the entire process, Erin maintained excellent communication. She promptly responded to my calls and emails, keeping me updated and informed at all times. Her transparent and honest approach helped build trust and confidence. Erin genuinely cares about her clients. She took the time to understand my family's goals and aspirations, and her personalized approach made us feel like we were her top priority. Erin's dedication to providing exceptional customer service sets her apart from others in the industry. Working with Erin Fowler was an absolute pleasure. Her expertise, professionalism, attention to detail, and caring nature make her an outstanding realtor. I would wholeheartedly recommend Erin to anyone in need of a real estate agent. She will go above and beyond to ensure your family finds the perfect home. schmeer4, 7/5/2023 Testimonial Tree Erin made the selling process seamless. She was knowledgeable premarket, during the selling and closing process. She handled all questions big or small with ease and grace. user8582657, 5/23/2023 Testimonial Tree Erin was absolutely wonderful! She is full of life and makes the stressful process of home shopping/buying much more enjoyable! She was very helpful during the entire process but especially at the end during closing week. Our closing date was moved and there was a last minute mad dash to get documents completed before we could close. Needless to say it was a very stressful week but Erin kept me sane and made sure we were able to close that same week. Highly recommend Erin!! ztflattmann, 3/21/2023 Testimonial Tree Erin did a phenomenal job assisting us with the purchase of our home in Ocean Springs. We were an out-of-state buyer and she was our ‘eyes on the ground’, reviewing each and every property as if she were the interested party herself. She is beyond knowledgeable of the area, she goes above and beyond to assist you in and and EVERY aspect of your transition/move, and she has excellent relations locally — this factor is crucial to expedite the process, particularly in a smaller city. She intently listened to our needs/wish list and worked diligently to find homes that met our requirements. She went the extra step to understand the personal dynamics of our family as well. We walked away feeling like she was not merely interested in the transactional process of helping us purchase a home, but truly vested in our happiness and successful transition. zuser20200102080056137, 3/15/2023 Testimonial Tree I enjoyed working with Erin and finding my home in Ocean Springs. Not being from the area, it was great to have Erin help me find the perfect home. Erin was always responsive and quick to identify solutions when needed. cnkarrigan88, 3/14/2023 Testimonial Tree Erin was great to work with selling our house. She was responsive and communicated with us through the whole process. We had some issues come up with our relocation company that she was able to help us resolve. She works hard for her clients! brookefehr, 3/11/2023 Testimonial Tree Moving is so stressful, especially with only a few weeks notice, across the country to a state you've never lived (or even visited!), and with two young kids. Erin was our saving grace. Through all our highs and lows, she was calm and steady, positive and supportive. She was 100% on our team throughout the entire process. We actually had to walk away from our first home (our choice) and Erin was more than supportive. I was stressing because we were back to square one and I was supposed to be moving the family in but Erin stayed the course and found us more options and we wound up in the perfect beautiful home! She was a shark of a negotiator to make sure our offer was the best it could be on a very sought-after home. She was able to avoid the ever-feared \"best and final\" offer nightmare because of her negotiating skills. And what's more, she's a delight to work with. She made our move to the south feel like we were going to be ok and that's the best we could ask for sienna941, 1/13/2023 Testimonial Tree Erin is awesome! We recently moved into the Ocean Springs area and she was perfect in helping us find a home. We were relocating for work which meant we were under time pressure and looking from afar. Erin used a “FaceTime-like” app to help us see homes virtually before we even got on site. She did a good job of pointing out potential issues and helping us come to a good decision point. When we found our new home, she negotiated well. Post-contract acceptance, she was even able to negotiate a $15K credit for some home inspection finds. In short, Erin is who you want when buying a home. All the important work stuff aside, she’s an absolute delight and will keep you laughing through the often times annoyingly stressful parts of buying a new home. stephanie h., 10/11/2022 Testimonial Tree Erin helped us with buying basically site unseen, across states. This market is crazy and ever changing and she was on top of it all. If she didn’t have the answer immediately, she was timely with her responses back. There were lots of ups and downs, learning each other and trusting her as “boots on the ground.” I know she did not take that lightly and we were able to be patient and get the home and neighborhood we didn’t know we needed. I would highly recommend Erin to friends new and old. user74882679, 8/10/2022 Testimonial Tree She is very engaged within the community and other realtors in the area. She understands her covered market very well. Was quick to inform us as homes became available user1327724, 8/1/2022 Testimonial Tree Best, sweetest, and most personable realtor there is! Erin is a delight to work with and was able find us our dream home in a small window of time that we had. Highly recommend using Erin for all of your real estate needs! carlyvernon, 7/25/2022 Testimonial Tree Erin went above and beyond for the sale of our house. Very friendly, personable and knowledgeable.Erin sat down with us and heard all of our concerns and what goals we wanted from the sale of the house. When it came to relocation- Erin was spot on with any and all questions. Erin will find out the answer for you, but not only that she'll be straight up honest. Our house, when listed sold quickly. Erin is fair and will work hard to list your house and get it sold. Erin keeps you updated every step of the way, any appointments made, she'll send you a reminder. We highly recommend Erin Fowler. You'll not go wrong choosing the best in the business! tinamarvray, 7/19/2022 Testimonial Tree Very glad we were referred to Erin! She was a great advisor in our purchase. She was always professional, courteous, and prompt with communication. She made buying our home from 7 hours away a breeze! Highly recommend! dougmcd66, 6/6/2022 Testimonial Tree Erin Fowler is the best realtor in the state of Mississippi. I reached out to her with my wants and needs for my future home and she had more than 10 options for me by the end of that day. As a first time home buyer, I was oblivious to the real estate world. I did not know where to start the process of buying a home. From offer to closing, Erin was with me step by step whenever and wherever I needed her. She is organized and professional with everything that she does and will always go the extra mile to get the job done right. If you or anyone you know is looking to buy or sell a home, please reach out to Erin. I promise you will be more than satisfied! pjb182, 11/3/2021 Testimonial Tree Erin gets an A+ from me. As a first time home buyer, I had some hesitation and anxiety about the process. Erin was just what I needed - someone who was patient, reassuring, and supportive (but not pushy). She was on top of everything from day one and made this a very easy process for me. She was a true pleasure to work with and has become a great friend in the process. I give Erin my highest recommendation! Jason 3., 10/25/2021 Testimonial Tree Erin was everything anyone would ever want in a realtor: knowledgeable, professional, warm and personable. We could not have asked for a better experience. Mike and Gale. jztg95hhx4, 7/12/2021 Testimonial Tree Erin is amazing! This is the second property we have purchased with her in Ocean Springs. She went above and beyond for us with both homes. We could not ask for anyone more responsive, experienced, kind, and knowledgable! My 3 small children also LOVE Mrs. Erin! If your looking for a realtor stop now because you have found her! bretlynnstark6, 7/6/2021 Testimonial Tree As first time home buyers, we were nervous about the experience. Erin Fowler was an angel through the entire process. She is so kind and incredibly knowledgeable that our anxieties dissipated immediately. She felt like a family member that only wanted the best for us. She is a fierce advocate for her clients. We love Erin so much and would be lucky to have a realtor half as good as her in the future. I can not recommend her more highly. adam k., 6/30/2021 Testimonial Tree Words, sometimes fall short when describing someone so spectacular. Having recently moved to the Biloxi, MS area, I immediately began looking for a home when it became obvious the apartment I had rented wasn't worth the dollars I could be investing in equity. God puts people in our paths for a reason; Psalm 119:105, \"Your word is a lamp to my feet and a light to my path.\" Not to over exaggerate, but I believe I found Erin Fowler, lighting my path to be as near to divine intervention as I've experienced. After contacting Erin who was the listing agent for a house advertised on Realtor.com, she listened earnestly to my initial wants and developed a framework for searching properties. Not only did Erin tell me what she could do, she was honest enough to admit locations she wasn't entirely familiar with, but would be willing to refer agents who would have a better understanding. Fortunately, the criteria Erin and I agreed on fell within her expertise, and she charged to work! Within one day, Erin began communicating available properties and scheduled viewings by the first weekend. At some viewings, Erin wasn't afraid to explain advantages and disadvantages to each property reviewed, while ultimately leaving the decision process to me, with willingness to explore acquisition details. After two weeks of being unable to find a home, I left on vacation leaving Erin with full confidence in her ability to find me the property I could call home for many years ahead. Lo and behold, Erin found a home meeting all the criteria I had asked for. Within one-hour of the home being marketed, she had completed a virtual walkthrough, facilitated and received acceptance of our offer. Erin didn't stop there. Erin had already helped me identify a lender giving us the advantage of pre-qualification, she rabidly researched local and existing insurance providers, provided local vendor lists for any needed/wanted improvements and even made sure I knew who my utilities providers would be. As I was unfamiliar with the purchasing process in Mississippi, Erin provided me general outline/timeline of each step in the process. On another essential front, Erin was tenacious defending me during the purchase process. She expertly steered me from accepting any risks, monitored email exchanges between agents, my lender and insurance providers. Erin also recommended home inspection and home appraisal experts. With genuine enthusiasm, I fully endorse Erin Fowler. If you're reading this review, pray, seriously, pray you can sign Erin to help find your home. rvn1028, 6/17/2021 Testimonial Tree We did our homework when searching out realtors in the Ocean Springs area, and personally I feel we hit the jackpot with Erin. She contacted us immediately after we reached out to her. We are from Iowa and were looking for our forever home in Mississippi. Her initial call to us was so warm and welcoming. She made us feel important, and at the end of the call felt like we had just talked with a long lost friend. Erin stayed in contact with us several times a week. Any questions we had, she has always been there to answer, or to research the answer for us. We planned a trip to Ocean Springs and met her our first night there. She met us at a wonderful restaurant that she picked out for us to eat at, and just got to know us. We had the best time! That night, it was then we knew we had picked the best of the best! The next day, we spent the entire day with her. She took us to several homes to see, took us out to lunch, and made the whole house shopping process joyful. We flew home and stayed in contact with Erin, and continued to house shop. She even facetimed us doing a walk through of a home we liked. We finally found a house we liked, she did another walk through for us, and we placed our offer and it was accepted! I have told everyone how wonderful of a person/realtor she is, and I feel like I have a wonderful friend in the process. I can't wait to get moved into our new home, and to see Erin again face to face. We wouldnt have been able to have had a great buying process if it werent for Erin. alisaonley, 6/10/2021 Testimonial Tree Erin is a true delight with a warm personality and strong negotiation skills. She is very responsive and worked hard to find the best home for our family. I would highly recommend her. mary c., 4/7/2021 Testimonial Tree Erin is absolutely the best agent! Her expertise made this process easy and stress free! She was always happy to show us as many houses as it took to find the perfect one, and once we found it she made purchasing it a breeze! sydschmidt714, 3/26/2021 Testimonial Tree We could not have asked for a better realtor than Erin for our move from Texas to Mississippi. She is so knowledgeable of the area and made sure we found exactly what we wanted. Erin is also an expert at corporate relocations and she made sure to cover all the bases so that there weren’t any issues along the way. She is so responsive and was always available to answer our questions. After we closed, we had some updates done to the house and Erin frequently went by to check on the progress and make sure everything was completed perfectly. She took care of our home as if it were her own. Erin has gone above and beyond to exceed all our expectations and we are so happy with the service she provided. candice g., 3/16/2021 Testimonial Tree Erin showed me several homes and put in 3 contracts. Market was competitive, she never put pressured me to quickly make a decision. She was good about letting me come to terms and decide. betsymowers26, 2/15/2021 Testimonial Tree From the minute we reached out to her, she took the reigns and made this the easiest (and most profitable) sell we’ve had. Even working through holidays to get us the perfect deal. Can’t recommend her enough! ryanjs202, 2/1/2021 Testimonial Tree Erin is the best! She was on top of everything from the initial listing appointment through closing. She kept us in the loop through every stage and she hustles all with a smile. Highly recommend working with Erin to buy or sell real estate! kara r., 1/1/2021 Testimonial Tree Erin provided exceptional, personalized service and worked tirelessly to ensure that the purchase of our new home went as smoothly as possible. She is also an excellent communicator and was always at the ready to help us quickly resolve unexpected issues and keep things on track. She was an absolute joy to work with, and we will definitely recommend her to anyone looking to buy or sell in the area. angklein4, 12/12/2020 Testimonial Tree Erin was an amazing realtor from beginning to the end of the process. She guided us through the whole way and was always available when we needed her. She is honest, professional and so much fun to work with. You definitely will not be disappointed! I feel like we not only met a great realtor, but a friend! sfalvey1018, 12/5/2020 Testimonial Tree I can not say enough wonderful things about Erin Fowler. She was a pleasure to work with throughout the whole process. She made sure my husband and I stayed informed and answered all our questions in a timely manner. All parties involved with the sale were not local but she was able to get everyone the documents needed and made sure everything went smoothly. I highly recommend her as an agent. Friendly, honest, respectful, and knowledgeable are just a few words I would use to describe Erin. My experience could not have been any better! zuser20170531084041274, 8/21/2020 Testimonial Tree A+++ On everything!!! - Her attention to detail Is amazing! - Always on time. - She has such a positive vibe making the search for our new home fun and stress free. - Very professional having your best interest at heart. I give Erin five stars all the way! ?????????? marizelva, 8/7/2020 Testimonial Tree Erin was wonderful! We had to purchase our home in a short amount of time and during social distancing. She went above and beyond for us and did a bunch of virtual tours for us. We ended up buying a house that we love! Thank you Erin! bretlynnstark6, 8/7/2020 Testimonial Tree Erin is a fantastic realtor. She quickly understood our needs and wants and directed us toward multiple suitable properties. From start to finish, she was responsive and helpful and an overall great real estate agent. melindayo, 8/7/2020 Testimonial Tree Very helpful and dedicated, I was fortunate to have a great partner in Erin during my home sale. She checked all of the boxes in being knowledgeable, independent/responsive, and compassionate of the stresses that we all encounter when moving. I would strongly recommend Erin to anyone. kyleobowler, 2/24/2020 Testimonial Tree Erin is the best realtor I've worked with. She is very quick to respond and very knowledgeable about housing in the gulf coast region. She was able to sell my home in under 24 hours due to her extensive list of contacts. I also appreciate that she doesn't beat around the bush with information. She'll tell you her honest opinion when working through the selling process. 666lizards, 2/24/2020 Testimonial Tree Erin was the best Realtor I could have asked for when we decided to move across the country. She was always responsive, professional, honest and helpful. Erin knows the area very well, she made us feel like our home search was just as important to her as it was for our family. Erin was an absolute asset for us during our home search. alysonm28, 1/7/2020 Testimonial Tree Erin helped me so much! She was very thorough in my search for a new home. She worked with me and was there when I needed her. I recommend her to anyone! toritaylor1596, 6/13/2019 Testimonial Tree Erin was very knowledgeable about the process of selling and buying a home. She helped us sell and quickly find a home. I think she truly cares about her clients and looks out for what’s best for them. leeeverett46, 6/6/2019 Testimonial Tree I am currently working with Erin on purchasing a home. She has been such a blessing for my family and myself. Every time I have a question I call or text and she is quick to respond. She is always happy and never makes me feel like I ask too many questions. She is consistently positive and I can tell she absolutely loves helping others. Her personality is contagious and makes home buying super fun and makes me want to be a better person outside of this home buying experience. Very glad to be working with Erin and will be friends with my realtor even after we find our family home. jennmitt21, 6/4/2019 Testimonial Tree I would recommend Erin Fowler to anyone who is buying or selling. We sold my grandmother's home after her death. It was a stressful time, but Erin made the process so easy. Her local knowledge of the market and what we needed to do to get the house quickly sold was appreciated by my entire family. We could not have found a better real estate agent. She was always available. She was very open and available with communication, and I could not be happier with her level of service. I will 100% recommend her to anyone, and I definitely look forward to working with her again in the future. nikimay2, 5/30/2019 Testimonial Tree Erin has helped us many times over the years as we have considered moving to a new home. She knows the trends within the industry and knows what will sell you house the quickest! I highly recommend Erin! schurch970105, 5/30/2019 Testimonial Tree", "name": "Erin Fowler", "website": "https://erinfowler.robertsbrothers.com/", "agent_phone_numbers": "251-510-2645", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/duncancrow", "description": "About Duncan Crow Duncan’s extensive background and deep-rooted connection to Alabama make him a valuable asset in the real estate market. With nearly forty years of legal experience, he brings a wealth of knowledge to his real estate practice, ensuring that both buyers and sellers are well-informed and supported throughout their transactions. A father of three sons, Duncan’s commitment to family and community shines through in his professional dealings. His active involvement in church and civic life reflects his dedication to service, and his musical talents—performing in local bands and participating in community theater—demonstrate his creative side and ability to connect with others. Understanding the often-overwhelming nature of buying and selling homes, Duncan prioritizes a smooth and stress-free experience for his clients. He empathizes with first-time homebuyers and aims to demystify the process, fostering an environment of trust and transparency. For sellers, he recognizes the pride and emotional investment they have in their homes, and he works diligently to ensure their property is valued appropriately, helping them to maximize their return on investment. With his combination of legal expertise, passion for real estate, and commitment to community, Duncan is well-equipped to guide his clients through the intricacies of the real estate market with professionalism and care.", "name": "Duncan Crow", "website": "https://duncancrow.robertsbrothers.com/", "agent_phone_numbers": "(251) 554-9546", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "900 Bienville Blvd. Dauphin Island AL 36528", "profile_url": "https://www.robertsbrothers.com/bio/genefox", "description": "About Gene Fox Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you. Testimonials Gene was very professional and stayed ahead of the process and kept me well informed while handling the sell of our property. Brian B., 1/1/2025 Testimonial Tree Gene leverages his experience and vast knowledge of the area to assist his clients to make educated decisions. Gene is very personable and transparent which allows for easy discussions. We will continue to lean on him for all of our real estate needs. MICHAEL K., 12/20/2024 Testimonial Tree Gene Fox is a \"go-getter\" agent. This was the second home he sold for me and he worked tirelessly on both sales. I highly recommend Gene Fox and Roberts Brothers. Katherine S., 7/19/2024 Testimonial Tree Gene has helped sell and buy a few properties for me. He goes the extra mile to get it done. He and Cherish removed my personal property when my condo sold while we were gone. I would not go anywhere else for my real estate needs. Roberta A., 6/25/2024 Testimonial Tree Gene was fantastic! Very professional and knowledgeable! We are very thankful for all of his help! Steve & Laura Owen Laura G., 6/14/2024 Testimonial Tree Gene is great! Phillip B., 11/4/2023 Testimonial Tree Gene was very helpful in the selling process and especially so in the Closing Process. They Buyers Lender Had many delays and Gene aggressively pushed the process including contacting the lender to get to Closing. Michael L., 10/15/2023 Testimonial Tree Gene Fox is more than just a realtor. He has gone above and beyond his normal duties to help us with ideas for changes we wanted to make to our property. He has made phone calls, made sketches and put us in contact with people to help make our beach house everything we wanted. Michael G., 8/25/2023 Testimonial Tree", "name": "Gene Fox", "website": "https://genefox.robertsbrothers.com/", "agent_phone_numbers": "251-370-8150", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/hopebrown", "description": "About Hope Brown Hope Sessions Brown has been in the real estate industry for over 20 years, providing quality service and creating lasting relationships with her clients. Her extensive background in finance has allowed her to close nearly 2 million in her first full year of selling real estate in Mobile, earning her the Rookie of the Year award for the Roberts Brothers West office in 2015. She has since been a multiple million dollar producer every year. After living in Florida when she started her family, Hope returned to Mobile with a new appreciation of life on the Gulf Coast and is dedicated to giving back to her community. She is always looking for ways to help her clients and build relationships old and new to Mobile. She is able to provide knowledge and expertise in both the sale of million dollar estate properties, to more rural areas with a more modest way of life. Her love for family and passion for cooking and gardening keep her grounded in the fast paced and growing city of Mobile. Client reviews of Hopes work speak for themselves: \"Hope is not only an experienced, capable, and reliable agent, she is also one of the most caring and positive people you will ever meet. Hope help me buy a home when I had given up. My experience with her was so wonderful that when I decided to buy my next home, she was the first person that came to mind. Now Im living in my dream home thanks to the expertise of Hope...I can not recommend her enough. I tell everyone I know to go see her first thing! I was in my new home in less than a month from the time I first went to see it.\" - April R. \"Hope is excellent at what she does! She is extremely knowledgeable about the market and worked hard for us...she gave great support and understanding through one of the biggest moments of my life.\" -Stephanie M. \"My husband and I would gladly work with Hope again and would highly recommend her to anyone looking to get their home sold.\" - Stephanie D. \"Hope Brown was amazing! I told her what I was looking for and she found it. She didnt try to talk me out of anything I wanted or push any house on me. She was amazing!\" - Matt K. Testimonials We didn’t get the house we originally wanted, but it was not Hope Browns fault. She found one that was even better and still in the same location and price range by the next morning. The easiest to work with and could not have asked for this first time home buying experience to be any easier!!! Cameron S., 7/1/2025 Testimonial Tree Hope kept me updated on the whole process of selling my father’s house. Would definitely recommend her to help sale your home! carol g., 6/21/2025 Testimonial Tree Working with Hope is always such a breeze! One thing about me is I hate to make big purchases but Hope made it super easy 5 years ago and made selling the home just as painless. We will always recommend her to anyone in need. Tristian D., 5/22/2025 Testimonial Tree Hope is the best there is! Not only did she help us with selling our house but she was also our realtor when buying it 5 years ago. Our family has grown and we needed to get back closer to family and she delivered as always with helping us to as smoothly as possible sell our house. Thank you hope for always answering our questions and making this process much easier! We always refer hope to anyone we come in contact with looking for any sort of realtor help. Tristian H., 5/21/2025 Testimonial Tree Exceptional service from Hope Brown. Great communication all throughout the process between selling and buying a home. Overall a great experience! Edwin M., 4/23/2025 Testimonial Tree We will miss working with Hope! Hope’s knowledge is extensive. She truly cares about her clients, and doing her job with integrity. Meliah M., 4/18/2025 Testimonial Tree Working with Hope was an absolute pleasure. Her extensive knowledge and availability to answer questions made the process go smoothly. Thanks to her expertise, we were able to sell our home quickly and find our perfect new place—even in a tight market. I highly recommend Hope to anyone looking to buy or sell a home. Julie S., 4/8/2025 Testimonial Tree Hope always goes the extra mile for her clients. She is honest, calm and trustworthy. Please consider Hope for yout next move in real estate. Terry is awesome at keeping all the moving parts together for a smooth closing. Janet R., 2/18/2025 Testimonial Tree Hope is absolutely amazing at what she does! You WILL NOT find a better agent! She goes above and beyond for her clients & treats you like family! She is an extremely hard worker & such a sweet person! She not only sold our house, but found us the perfect house with every single thing we wanted! Absolutely amazing experience. Terri is amazing as well! Very informative & keeps up with everything you need on the paperwork side! Makes sure everything is done on time! A dream team! Morgan H., 1/16/2025 Testimonial Tree Hope was amazing and made selling my property a lot easier than I ever expected. She kept me informed and helped me make all the right decisions, all while also counseling me through it all. It was my absolute pleasure working with her!! Lisa S., 5/27/2024 Testimonial Tree Always goes above and beyond for us. Shes helped us buy and sell 2x now and we love her so much. Haleigh M., 3/25/2024 Testimonial Tree Hope Russell Brown and Terri's Concierge Team provided stellar service for us during the entire out-of-state move we made from Atlanta into Mobile. Hope was friendly, extremely knowledgeable about the area, the vast array of available homes, their builders, and price points for us. We never felt pressured or rushed to make such a big decision, and Hope was always on call to answer questions for us as we needed. Her business acumen was spot-on, and she was calm and collected during a time when we felt anything but. Terri and the Concierge service allowed us the opportunity to seek utilities and other home services on our own time, and every document we received was presented in the same thorough, timely, and relevant manner that our home search was given. We unreservedly recommend Hope Russell Brown, Terri and the Concierge Team, and Roberts Brothers for buying or selling property in Mobile. We were completely satisfied and are so excited to begin this next new chapter in our lives. Bradley and Heather White Heather N., 3/5/2024 Testimonial Tree Hope was amazing during the entire process. She accommodated every request and went above and beyond in service. She is an amazing agent! Perry C., 2/16/2024 Testimonial Tree What can I tell you, she filled me with Hope the moment I met her. She's caring and simply wants to help you find the home/land that makes you happy. She cared enough to refer me to another agent for my investment real estate goals. It's not what you know, it's who you know and thank goodness I met Hope. Kirk M., 2/15/2024 Testimonial Tree I have greatly enjoyed working with Hope Brown through the process. She was always right there when I needed anything or answer any questions. I greatly appreciated how smoothy she made sure everything went, while making sure I understood everything. Carson H., 1/21/2024 Testimonial Tree Hope was very easy to work with I have some mobility issues and she was very helpful in providing assistance with that. she helped me find a smaller home to move into and was able to sell my other house within very short period of time. delightful individual. Susan B., 11/29/2023 Testimonial Tree Hope was easy to deal with, made herself available at various times. I have bought many many houses in my lifetime and this was very easily accomplished with her. Susan B., 9/14/2023 Testimonial Tree Hope was very pleasant to work for and always kept in contact with me. What was going on what needed to be done and it was very smooth transaction selling my house. Scott J., 6/22/2023 Testimonial Tree I can not say enough about Hope. Her knowledge and attention to detail gave us such peace of mind. She was a step ahead of us at every turn. There wasn’t a question she couldn’t answer. Hope’s experience makes her one of the best in the industry. Not only did Hope help us with the purchase of our home, she went on to help our daughter and son-in-law along with several other family members find theirs too! Johnnie M., 6/17/2023 Testimonial Tree Hope Brown deserves ten stars. She is the consummate professional: inspired, driven, caring, and an excellent communicator. Every aspect of the sales process was perfectly handled. Hope instilled instant credibility in her abilities with confident, decisive actions that led to a successful and satisfying close. I give her my highest recommendation. Bob H., 6/16/2023 Testimonial Tree As first time buyers, Hope made it very easy all the way to the end! It was a very intimidating to us and she kept us calm. Hope was a great person to work with! BJ S., 6/16/2023 Testimonial Tree", "name": "Hope Brown", "website": "https://hopebrown.robertsbrothers.com/", "agent_phone_numbers": "251-463-4304", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/hopebrooks", "description": "About Hope Brooks My husband and I moved with our family to the Malbis area in 2001 and quickly fell in love with its charm. With access to some of our county's best schools and Alabama's gorgeous beaches so near it has been the perfect place to raise our girls. Our family continued to grow and we now have 4 beautiful daughters, a son-in-law and 2 grandsons whom we adore.I am dedicated to providing you with an exceptional experience and vow to work tirelessly to hear your dreams and make them a reality. Allow me to list your home and get the most return with the least stress on you or lets find a house to make your home! I look forward to helping you with all your real estate needs.Now serving a third generation of customers, Roberts Brothers, Inc. has over 300 sales associates staff in five branch offices covering the residential and rental markets in Mobile and Baldwin County, Alabama. Roberts Brothers is the leading Real Estate company in South Alabama and has offered superior service to its clients and customers for over 75 years. My husband and I moved with our family to the Malbis area in 2001 and quickly fell in love with its charm. With access to some of our county's best schools and Alabama's gorgeous beaches so near it has been the perfect place to raise our girls. Our family continued to grow and we now have 4 beautiful daughters, a son-in-law and a grandson whom we adore. I am dedicated to providing you with an exceptional experience and vow to work tirelessly to hear your dreams and make them a reality. Lets find a house to make your home! Let me help you with all your real estate needs. Now serving a third generation of customers, Roberts Brothers, Inc. has over 300 sales associates staff in five branch offices covering the residential and rental markets in Mobile and Baldwin County, Alabama. Roberts Brothers is the leading Real Estate company in South Alabama and has offered superior service to its clients and customers for over 75 years. Testimonials Already recommended a few of my friends! Ashton G., 5/22/2025 Testimonial Tree Hope was great in an otherwise unfortunate series of events. Matthew F., 4/19/2025 Testimonial Tree We highly recommend and Hope Brooks was wonderful and did a fantastic job in every way! She was extremely helpful and we really appreciate her. Sheila L., 6/5/2024 Testimonial Tree Hope was absolutely amazing! She listened to what we were looking for, took the time to find multiple house that fit what we wanted and when we found our home she made the whole buying process a breeze! We can’t stop raving about her and will always suggest her to anyone looking to buy. Amber & Steven, 6/15/2023 Testimonial Tree Hope is an amazing professional agent that I will send all my friends to! She was more than patient with us during the search for our home. She helped us every step up the way and took the time to understand our unique needs in a multigenerational home. Thank you , Hope, for treating us like family! Julia C., 6/15/2023 Testimonial Tree Hope was so amazing to us. I would recommend her to anyone. Having Hope in our corner gave us the confidence to get our first home, and a great spot to start our family. Taran and Ashlie P., 6/15/2023 Testimonial Tree", "name": "Hope Brooks", "website": "https://hopebrooks.robertsbrothers.com/", "agent_phone_numbers": "251-605-9582", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/AlicenBrizendine", "description": "About Alicen Brizendine Throughout her life as a military child, Alicen has lived in over ten different places from South Texas to Puerto Rico and everywhere in between, which she attributes to her genuine love for people and her desire to help in any way possible.She was afforded the opportunity to compete as an NCAA Division One athlete, which instilled in her keen time management and organizational skill sets that she is confident are beneficial to you as your agent.Alicen is a Faith Academy graduate. Following her high school graduation, she moved to Mississippi to attend the University of Southern Mississippi, where she was a golfer for two years. After her sophomore year, she married her husband Matthew, and began following him around with his Coast Guard career.After a couple of transfers, Alicen graduated from Georgia Southern University, having earned a BBA with a major in Marketing. She is also a University of Southern Mississippi grad, where she earned her Masters in Business Administration.Her first job out of college was a Listing Coordinator / Marketing Manager for a Real Estate Agent in Savannah, Georgia. She knew from that moment, that her heart belonged in real estate.Alicen and her family have planted roots in Mobile, following her husband completing his military service and transition to Airbus. They have three children, Nora, Brooks, and Holden and also two rescue dogs, Duke and Ranger.She is an active member in her church, West Mobile Baptist Church, the Mobile Jaycees, the secretary for her HOA, and enjoys volunteering with various organizations, such as Ransom Ministries.She loves everything about Gulf Coast life and can’t wait to help you find that feeling of being home in being here as well! Testimonials Alicen and Cheeka were fantastic. We wanted to get into a house well before our wedding next year, and they hit the ground running. They showed us houses we wanted to see and suggested others we hadn’t seen yet. They were extremely knowledgeable, which was so helpful for us as we’re first time homebuyers. They were punctual, quick to answer calls or texts, and were just all around amazing people. We would absolutely recommend them to anyone we know and even use them again if we ever buy in the future! Emma C., 5/27/2025 Testimonial Tree Alicen and Cheeka went above and beyond for us!! They made this process easy for us and were always communicating and ready to answer all of the questions we had. Couldn’t recommend them enough! Emilee B., 3/17/2025 Testimonial Tree I can’t say enough great things about Alicen Brizendine and Cheeka Pack! From start to finish, they are both incredibly professional, knowledgeable, and truly invested in helping me achieve my real estate goals. Alicen's attention to detail and Cheeka’s knack for understanding exactly what I was looking for made the entire process seamless and stress-free. Their communication is top-notch—they keep me informed every step of the way and always makes me feel like I am a priority. Whether it is answering my endless questions or providing expert advice, they are patient, kind, and truly go above and beyond. What really stands out to me is their dedication to understanding my needs and making sure I fell confident in every decision. Thanks to Alicen and Cheeka, I am getting a chance to find the perfect home for my family and couldn’t be happier! If you’re looking for a team that is professional, personable, and gets results, I highly recommend them. Jennifer L., 1/26/2025 Testimonial Tree Alicen is very enthusiastic!! She is very kind & sweet. Alicen has great knowledge of homes and knows exactly where to find your dream home because she pays attention to detail in what you dream of in a home. She’s not pushy & very easy to work with! If you need a realtor, she’s definitely worth working with! Tiffanie P., 1/25/2025 Testimonial Tree I have worked with Alison on multiple transactions, pre-approving buyers, and helping them find their forever home. I can honestly say that out of the hundreds of realtors I work with, Allison has a unique gift about her. She really cares, really listens, and exudes professionalism. I would recommend her everyday! Annaleigh N., 1/25/2025 Testimonial Tree The absolute best!! SO SO SO helpful and open to what I wanted! Kathryn K., 1/25/2025 Testimonial Tree", "name": "Alicen Brizendine", "website": "https://alicenbrizendine.robertsbrothers.com/", "agent_phone_numbers": "361-765-4628", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/toribritt", "description": "About Me: I am knowledgeable about Mobile County (having lived here for 40 years) I have more than 15 years experience in sales. I have also worked in the legal field for 15 years, I know that cient relationships are very important. I have dealt with sensitive and confidential information as well. I love helping a client/customer with this process. Whether it is curb appeal, to staging the interior of a home. I have great ideas to share with my clients/customers to spruce up their home for a sale. I am always available and committed to providing great service. I enjoy meeting my clients & learning all about them and how I can meet there needs. I am an honest, hardworking and reliable with an upbeat personality and great communication skills I am a member of the local, state and national Association of Realtors. I am on the Committee for the Governmental Affairs and Community Relations within the Association of Realtors. I am involved in the Mobile Area Chamber of Commerce Young Professionals and also part of the Roberts Brothers Young Professionals. I am continuing to develop my knowledge and understanding of real estate. Testimonials We were very pleased to have Tori Britt list our home for sale. Not only did she list it, she also found the Buyer. Tori is very professional, friendly & calls you back in a timely manner. We chat with her every week. We will most definitely refer our friends & family to her. Now, we can finally move to Illinois. Thank you! Charles & Paula M., 7/21/2025 Testimonial Tree We listed our home with Tori Britt. Not only did she get us more money than we expected, she brought the Buyer too! Our home was on the market about 1 month before we went under contract. We now get to move closer to our grandchildren. Smooth process with Tori. She has great customer service skills and always responds within a timely manner. I will refer her to family & friends. Charles M., 4/10/2025 Testimonial Tree Our Attorney referred us to his Real Estate Agent, Tori Britt with Roberts Brothers West. She held our hands througout the entire process. Not only was she a great Agent, she answered all of our questions in a timely manner. I will for sure use her again. Billy B., 2/24/2025 Testimonial Tree We were referred to Tori Britt by our Attorney. She treated us like family. We listed my parents' house for sale with her and Roberts Brothers. Tori marketed the property every single week and was able to find the Buyer as well. I will most definitely use Tori Britt in my future real estate deals. It says alot that she listed the property and was able to find the Buyer too! Now that's top notch service! Carol B., 2/24/2025 Testimonial Tree Our sale was fast. Only on market for 2-3 weeks and had an offer and Tori got a grand more than what they offered. We know this wasn’t a big money making sale, but it was perfect for us to have it sold in less than a month from listing. Highly recommend your company, especially Tori for the diligence and not backing down until it was done. Thank you so much. Christopher E., 11/18/2024 Testimonial Tree Tori showed excellent customer service and “held my hand” throughout the entire process. 10/10 would definitely rely on her again for my 2nd home! Devin L., 9/28/2024 Testimonial Tree My agent Tori Britt is why I would recommend Avena K., 8/8/2024 Testimonial Tree We chose Roberts Brothers Inc. and Tori Britt because they are the best. Tori was always available and worked graciously with my siblings and I as we sold the family home. Tori went out of her way to make sure our home was shown in the best possible light and made sure it was marketed in as many locations as possible. I would definitely recommend this group and Tori to get your property sold. Belinda F., 8/7/2024 Testimonial Tree TORI WAS ABSOLUTLY AMAZING TO WORK WITH SHE WAS ALWAYS ANSWERING QUESTIONS WHICH WERE MANY. TORI NEVER LOST HER PATIENCE WITH 5 SENIORS LOL. SHE WENT OVER AND ABOVE TO GET OUR MOMS HOME SOLD. SHE WORKED WITH US ALL AND WAS ALWAYS TRYING TO FIGURE OUT ANOTHER WAY TO GET MOMS HOUSE SEEN BY AS MANY AS SHE COULD. SHE WOULD TALK TO OTHER AGENTS AND GIVE US THIER OPINIONS AND FEED BACK. TORI EVEN FED OUR DOG WHEN I WAS OUT OF TOWN FOR A WEEKEND. I THINK WE COULD NOT HAVE GOTTEN A BETTER AGENT TO HANDLE GETTING MOMS HOUSE SOLD. TORI WAS ALWAYS AWARE OF THE MEANING OF THIS HOUSE TO ALL OF US, SHE BECAME A FRIEND TO US. Pamela U., 8/7/2024 Testimonial Tree Tori was a pleasure to work with. Highly recommend! Landon G., 7/31/2024 Testimonial Tree Tori was great! Unfortunately I wasn’t ready to buy, but when I do she will definitely be who I go too! Amy O., 4/11/2024 Testimonial Tree The agent I worked with was one of the best. Edith V., 3/5/2024 Testimonial Tree We worked with Tori for one week & she got us in a rental! She returned all our calls within a timely manner. Her customer service skills were top notch. We will use here again in the future when we buy. I will refer Tori to our family & friends. Patricia, 9/19/2023 Testimonial Tree Very professional answer all my questions that I had very responsive Alex B., 7/10/2023 Testimonial Tree Tori has been working with us to help us find a house. She has been such great help and keeps us updated. Very happy with all of her help Briley S., 6/24/2023 Testimonial Tree I have been talking with Tori a couple weeks getting my condo ready to sell. She has been very helpful in pointing me in the right direction so that I can get the most out of my condo. She’s also been very helpful in helping me understand the whole process to sell my home and purchase a new home. I am looking forward to working with her to sell my condo and purchase a new home. Jeff B., 6/23/2023 Testimonial Tree I have been talking with Tori a couple weeks getting my condo ready to sell. She has been very helpful in pointing me in the right direction so that I can get the most out of my condo. She’s also been very helpful in helping me understand the whole process to sell my home and purchase a new home. I am looking forward to working with her to sell my condo and purchase a new home. Jeff B., 6/23/2023 Testimonial Tree Every time i contact Tori, she is prompt and accurate with responses. She has a gentle and capable approach. She listens intently and possesses an amazing memory for detail! I am pleased to work with her! Doug T., 6/23/2023 Testimonial Tree", "name": "Tori Britt", "website": "https://toribritt.robertsbrothers.com/", "agent_phone_numbers": "251-721-7103", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/annbraswell", "description": "About Ann Braswell \"Always deliver more than expected\" Larry Page Co-Founder of Google Ann is a native of Mobile and moved to the Eastern Shore in 2003 and then to the Gulf Coast in 2017. After raising children and owning and operating a restaurant, Ann decided to delve into the world of Real Estate. Ann is a multi-million dollar producer and is known for her local knowledge of condos and investment property along the Gulf Coast of Alabama as well as Florida. She possesses excellent communication skills, integrity and a passion for helping people. Whether you are buying or selling, in either Alabama or Florida, Ann understands the process can be challenging and complicated. She focuses on taking the pressure off of you, so you can make clear and concise decisions throughout the process. Ann gives the utmost care and dedication to all of her clients and is committed to giving them an exceptional experience. Roberts Brothers has served the Mobile and Baldwin County area for over 75 years and their core values of professionalism, commitment to excellence and integrity reflect Ann's own. Roberts Brothers currently has the highest number of sales and listings in the area and Ann knows that her clients will benefit from Roberts Brothers wealth of knowledge, expertise and undisputed formula for success. Give Ann a call and let her help YOU with all your real estate needs! 251-623-0561 Testimonials Ann was great to work with. Never any pressure to make a decision or to make offers. She was easily available for phone calls or to schedule showings. Strongly recommend. Kevin B., 8/13/2023 Testimonial Tree Ann Braswell is outstanding! She never let us down through our entire real estate journey. She is knowledgeable, accountable and approachable. Always available to answer questions and concerns, both in person and remotely. We couldn't have asked for a better experience. Highly recommend Ann!! Christi A., 8/9/2023 Testimonial Tree Ann was GREAT to work with. She was more than helpful, answering all our questions and even worked with us on a holiday weekend! Lacey A., 7/25/2023 Testimonial Tree", "name": "Ann Braswell", "website": "https://annbraswell.robertsbrothers.com/", "agent_phone_numbers": "251-623-0561", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/juliebrannon", "description": "About Julie Brannon Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Julie Brannon", "website": "https://juliebrannon.robertsbrothers.com/", "agent_phone_numbers": "251-680-1281", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/shaibrandon", "description": "About Shai Brandon Sha-Jeariann (Shai) Brandon believes that great work starts with purpose and ends with impact. Shai brings over 20 years of experience in customer service and hospitality to the world of real estate — where care, clarity, and exceptional service truly matter. Shai blends dedication with professionalism to deliver a smooth, informed, one-of-a-kind and successful experience for every client- whether you’re a first-time homebuyer navigating your very first purchase or a luxury client seeking a tailored, high-level approach. She’s known for her warm spirit, nurturing nature, sharp eye for detail, and the ability to turn vision into reality. For Shai, it’s not just about closing deals — it’s about building trust, creating meaningful connections, and ensuring that every client feels empowered at every step of the way. She knows that the little things make the biggest difference, and she treats each transaction with the heart and precision it deserves. Outside of real estate, you’ll find Shai serving her community through church events or personal incentives and leading the 40+ Double Dutch Club for women in the Mobile Southern Region — a movement that empowers women through connection and movement. She also enjoys traveling and spending time with her family, values that keep her grounded and deeply connected to the people she serves.", "name": "Shai Brandon", "website": "https://shaibrandon.robertsbrothers.com/", "agent_phone_numbers": "2515133775", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/colleenbowen", "description": "About Colleen Bowen I was born and raised right here on the Gulf Coast. I attended Saint Paul's Episcopal High School and Spring Hill College. I grew up around my father's property management company and, upon finishing school, worked there for fourteen years as a dedicated leasing agent. I learned a variety of skills in the real estate field being in charge of property inspections, dealing with contractors, vendors, and of course-paperwork! I greatly enjoy helping people find a place to call home and helping them in the process of achieving this goal. My goals are to work hard, be determined, dedicated, loyal, and to be there every step of the way in meeting my client's needs. Testimonials Excellent service Katherine B., 6/14/2025 Testimonial Tree Colleen has sold many residential and commercial properties for me and I highly recommend her for all of your real estate needs! Erin C., 11/16/2023 Testimonial Tree Colleen is extremely knowledgeable and professional. She has handled large complexes to single family houses for myself and other investors. If you want to buy or sell she is the one to go to! Erin C., 10/17/2023 Testimonial Tree colleen is wonderful to work with - very responsive and professional John L., 10/12/2023 Testimonial Tree", "name": "Colleen Bowen", "website": "https://colleenbowen.robertsbrothers.com/", "agent_phone_numbers": "251-377-7472", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/janetboullemetukangsin", "description": "About Janet BoullemetUkangsin Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Janet BoullemetUkangsin", "website": "https://janetboullemetukangsin.robertsbrothers.com/", "agent_phone_numbers": "251-533-8050", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/SomerlynBouler", "description": "About Somerlyn Bouler Somerlyn Bouler is a Mobile County native, born and raised in Semmes, Alabama. She attended Faith Academy and went on to receive a Human Resources degree from the University of South Alabama. Starting out as a Realtors Assistant, Somerlyn developed a love for the Real Estate industry. Now, having earned her real estate license and using her business management background, Somerlyn is excited to guide her buyers and sellers through the home buying and selling process with excellent service, patience and professionalism. Somerlyn loves the gulf coast and is excited to welcome new and returning clients to the area. If you are looking for a new place to call home, Somerlyn is ready to help you make your move!", "name": "Somerlyn Bouler", "website": "https://somerlynbouler.robertsbrothers.com/", "agent_phone_numbers": "251-472-6808", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/jameebooth", "description": "About Jamee Booth Jamee has been a resident of Mobile since 1989. She is a family oriented woman with a devotion to God, her husband Dennis and her children. Jamee has two sons, Seth (19), a proud member of the US Navy, and Brannon (15), a student of Mary G. Montgomery High School. She also has one stepson Conner (22), a Mechanical Engineering student at Baker College in Detroit, MI. Jamee was a hygeinist for 14 years before embarking on her real estate career which gave her the unique ability to work with all types of personalities and to form an enduring bond with the people she serves. Jamee is committed to finding the home that suits your needs with hard work, dedication, and loyalty. Let Jamee help you find the home of your dreams, where you can create memories that will last a lifetime. Testimonials Jamie Booth has helped us in so many ways. She is very professional in what she has helped us with. She leaves no stones unturned. It would not have been possible for us to purchase a home in that area without her constant professional help. We really appreciate what she has done by assisting us for several years now, and we finally closed on the 16th.Yea! yea! Bobby and Shelia Mathis Bobby J., 6/18/2025 Testimonial Tree Jamee has worked with our entire family. She is super nice and will go out of her way for you. She helped us find our first home and helped us sell and get into our new house. The process was stressful but she kept assuring us it was going to happen. We appreciate everything Jamee did for us. Terri B., 5/9/2025 Testimonial Tree Jamee was so friendly and helpful. I am a first time home buyer and she made everything so easy. I highly recommend her and your group to everyone. Alana G., 4/16/2025 Testimonial Tree Total professional, made the process easy. James B., 12/2/2024 Testimonial Tree It was a great and painless experience. My realtor Jamee was amazing. Chad E., 4/2/2024 Testimonial Tree Had a great time working with staff. Darryl A., 8/20/2023 Testimonial Tree Great to work with kept us informed had a great experience. Thank you Jamee for a fast and easy sale. Billie A., 8/19/2023 Testimonial Tree", "name": "Jamee Booth", "website": "https://jameebooth.robertsbrothers.com/", "agent_phone_numbers": "251-402-3499", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/butchblum", "description": "About Butch Blum Top 10 Reasons I'm the Real Estate Agent for You! 1. I have over 52 years of experience in the Mobile business community. 2. I know the neighborhoods, schools, market conditions, zoning regulations and local economy. I can help you with properties in both Mobile and Baldwin counties, including the Eastern Shore and Gulf Shores. 3. I'll do the leg work, keeping you up-to-date with new listings and conditions as they impact the market. 4. I'm a full-time real estate agent - anything less and you'd be short changed. 5. I'll use my connections throughout the mortgage industry to get you the best deals possible. 6. You'll be my client (I will represent you) in the real estate transaction. 7. I'll guide you through the complexities of buying and/or selling a house, eliminating hassles and stress. I will keep you informed every step of the way. 8. As a standard business practice I preview homes as they become available, keeping you apprised of market conditions as they evolve. 9. I won't waste your time - when an offer is made, I'll require acceptance or a counter offer within 24 to 48 hours. 10. You'll have the advantage of personal, one-on-one attention, as well as my dynamic web and e-mail resources. Let's get together to talk about your home buying and/or selling plans. Call me at the office (251-661-4660) or on my cell phone (251-583-3042) or send me an e-mail(ButchBlum@RobertsBrothers.com), we'll set-up a time to meet that is easy and convenient for you. Butch Blum", "name": "Butch Blum", "website": "https://butchblum.robertsbrothers.com/", "agent_phone_numbers": "251-583-3042", "country": "US"}
{"title": "Associate Broker - REALTOR", "address": "559 North Section St. Fairhope AL 36532", "profile_url": "https://www.robertsbrothers.com/bio/katblosser", "description": "About Kat Blosser Everyone needs an oasis. Your home is your comfort zone, and it should be a place you genuinely love, no matter where that address falls on the map. Becoming a REALTOR was the perfect opportunity for me to do something I love while connecting with people and helping them reach their goals. I began my real estate career at Roberts Brothers in 2014 and earned my brokers' license in 2018. In 2020 I became a certified instructor for The Academy of Real Estate where I am in charge of their online school. I also teach real estate classes in person, which I really enjoy. Between buying and selling real estate and teaching, I absolutely love what I do! The process of searching for a home and making a big move can be daunting; it's one of the biggest investments you will ever make. Selling your home can be a rollercoaster of emotions and having a trusted advocate to guide you is so important. I know first-hand the joys and challenges involved, which allows me to identify with your needs and concerns. My husband and I have lived in many places: San Antonio, Dubai, Copenhagen, Singapore, Perth, Houston and Kuala Lumpur. (That's a lot of moving boxes!) Despite having seen so many unique and inspiring places around the world, we knew our forever home was the place my husband was raised, on the beautiful Eastern Shore of Alabama. This vibrant and charming community has it all, and we couldn't love it more. The sunsets are some of the best on earth, but even more wonderful are the friends and family that make it home. And did I mention our favorite 4-legged friend? We have a wonderful rescue dog named Bud who is living his best life here. He keeps us smiling. Whether you are moving next door or thousands of miles away to a new country, I am your best resources for making it a great experience you can feel confident about. Call me today and let's get started! Testimonials She was great to work with every step of the way couldn’t ask for a better caring agent Karen L., 6/18/2025 Testimonial Tree Kat: Did a great job for us. Couldn't have done it without her. Her experience and knowledge were so helpful. Thanks Kat. Excellent experience. Gerald V., 7/2/2024 Testimonial Tree", "name": "Kat Blosser", "website": "https://katblosser.robertsbrothers.com/", "agent_phone_numbers": "251-509-4555", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/harrisonbixler", "description": "About Joining Roberts Brothers in 2020, Harrison quickly gained a reputation for providing exceptional service to his clients and has been unstoppable ever since. Harrison has extensive knowledge of the local real estate market and is skilled in negotiations, marketing, and sales. He uses the most technically advanced tools in the industry, keeping his clients ahead of the curve and informed. Harrison’s number one goal is to provide his clients personalized service and support them every step of the way. A graduate of Auburn University, Harrison has a Bachelor of Science degree in Hotel and Restaurant Management with a minor in Business. He spent many years in the restaurant management field in Birmingham, Nashville, and New Orleans. He has also been a Project Manager for multiple software application companies. Harrison is a graduate of Mobile United Leadership Class of 2023 and a volunteer with Fuse Project, which focus on bringing together local projects for children. Outside of work, you can find Harrison spending time with his family on the water, fishing, and boating. He's a grill/smoker enthusiast and enjoys hosting crawfish boils. He and his wife, Quin, live in Mobile with their three children. Testimonials Harrison is great, whether we are buying or selling. First class always!!! Stephen T., 5/20/2025 Testimonial Tree Very pleased --- Harrison was professional and patient during our 18 month search. Donald W., 3/7/2025 Testimonial Tree Mr. Bixler was great to work with. He is friendly and professional and very responsive to questions. The whole process went smoothly, and I am thrilled with the house that I ultimately bought! Grace W., 5/21/2024 Testimonial Tree Harrison is the best!!! Stephen T., 4/10/2024 Testimonial Tree", "name": "Harrison Bixler", "website": "https://harrisonbixler.robertsbrothers.com/", "agent_phone_numbers": "205-516-8827", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/timbates", "description": "About Tim Bates Welcome! My name is Tim Bates, and I am not only a real estate professional but also a proud husband and father of two wonderful children. Above all, I am a devoted Christ follower, and I strive to approach every aspect of my life, including my work, with integrity, honesty, and compassion. Real estate has been my steadfast passion for over a decade, and I am thrilled to have the opportunity to help individuals and families like yours navigate the exciting world of buying or selling property. As a seasoned property investor, I have firsthand experience with the ins and outs of the market, and I am here to share my knowledge and expertise with you. My goal is not just to complete a transaction, but to create lasting relationships built on trust and mutual understanding. I understand that buying or selling a home is one of the most significant financial decisions you will make, and I am honored to be a part of that journey with you. When you choose to work with me, expect nothing less than exceptional service, personalized attention, and a commitment to your best interests. I will guide you through each step of the process, taking the time to listen to your needs and navigate any challenges that may arise. So, whether you're a first-time homebuyer, a seasoned investor, or looking to sell your property, I am here to help. Let's embark on this exciting real estate journey together, and together, we will achieve your goals. It would be an absolute honor to work with you Testimonials Tim Bates with Roberts Brothers, Malbis, was fantastic to work with. He took great care of us, was knowledgeable about the area, got us a great offer on our house and supported us through the process of buying a new construction home. DOM for our neighborhood was about 60-90 days, so we listed 3 months prior to the expected completion of our new home, and Tim managed to get us two amazing offers in 4-days, then helped us negotiate a great full-price offer that included a delayed closing and a 2-month rent-back, so we could stay in that house until the new one was ready. He was easy to communicate with, prompt with replies and was always friendly. We would definitely work with Tim Bates again, and will recommend Tim to anyone looking for an agent. Amanda R., 6/30/2025 Testimonial Tree Tim was instrumental in finding my new home. He is honest, hard working, and quick to move. I would recommend Tim to anyone that asked. We made it. So can you.. If you call Tim. We appreciate you more than words! Thank you for all the effort and really going through the rollercoaster of our house finding. Alexander H., 4/30/2025 Testimonial Tree Tim, was very professional, knowledgeable, and patient during the entire process. He has this was of breaking everything down and explaining it. I was stressed and nervous, but he was able to keep my stress levels down with the updates and explaining everything. He was there with me every step of the way. He got me what I asked for. I'm very thankful and grateful he was my realtor. I will recommend him to any and everyone who is interested in purchasing a home. Thank you Tim 😊 Lakendra S., 3/10/2025 Testimonial Tree Outstanding Experience with Tim – A True Professional! I recently had the pleasure of working with Tim as my realtor while purchasing my first home, and I can't say enough positive things about the experience! From the very beginning, Tim demonstrated an exceptional level of professionalism and expertise that made the entire home-buying process seamless and stress-free. Tim's took the time to understand my needs and preferences. He was always available to answer my questions, no matter how big or small, and his responsiveness made me feel valued as a client. It was evident that he genuinely cared about helping me find the perfect home. What truly stood out was Tim's top-tier customer service. He went above and beyond to ensure that I was comfortable every step of the way. coordinating viewings, or guiding me through the paperwork, he made everything easy to understand and navigate. His attention to detail and commitment to excellence reassured me that I was in competent hands. I highly recommend Tim to anyone looking to buy or sell a home. His professionalism, dedication, and customer-first attitude truly set him apart in the real estate industry. Thank you, for making this experience so smooth! Maxwell B., 10/30/2024 Testimonial Tree Tim was great to work with during my buying process! He was informative and very responsive with my questions and concerns. I highly recommend him. Anna S., 8/25/2024 Testimonial Tree Tim was the best, put up with me looking at everything Thank you very much Ricky C., 8/7/2024 Testimonial Tree Tim was absolutely awesome throughout this process. I was a lower end buyer, but he treated me just the same as if I were looking at million dollar properties. He helped me find exactly what I was looking for. I've had agents in the past who blew me off or put me on the back burner. I can only assume, but it felt like since I did not represent a big payday for them, I was not much of a priority. Tim took the time with me that most others would not have. I appreciate that very much. I would without a doubt recommend your company. James P., 3/27/2024 Testimonial Tree", "name": "Tim Bates", "website": "https://timbates.robertsbrothers.com/", "agent_phone_numbers": "251-769-3476", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/robbarr", "description": "About Rob Barr Your Go-To Guy for Coastal Alabama Real Estate. A licensed REALTOR with 14 years of marketing experience. An in the loop go-getter with expert knowledge of Mobile Baldwin Counties including, but not limited to: Daphne, Fairhope, Spanish Fort, Mobile, Saraland, Bay Minette, Robertsdale, Foley, Gulf Shores, Orange Beach. Selling: I will work with you to get the best price, in the least amount of time. I will help you get your home ready to sell. I know what buyers are looking for, what they expect, and what gives them the warm fuzzy feelings that turn into offers. Ive even had a listing featured on HGTV. Buying: I will help you find the perfect place. Whatever you are looking for, I can find things that you wont see searching online. If you let me help you, you will be one the first to know when your dream home hits the market. About me: My wife Keri and I (both native Alabamians) live in Spanish Fort with our daughter Sara Grace, our dog Lizzie, some cats, and an ever-growing family of other creatures. Sara Grace enjoys school and playing with her friends in our neighborhood. We moved back to Alabama from Meridian, Mississippi. We miss Meridian and the wonderful friends we made there, but we know that moving to Baldwin County was the best decision we have ever made. We enjoy spending time outdoors, eating fantastic seafood, and taking day trips to the beach. We feel like we are on permanent vacation. Testimonials Rob Barr was extremely communicative and was always available. He made the relocation process easy, and he was always willing to jump right on anything needed. Capital R., 3/14/2025 Testimonial Tree He was helpful in showing us available properties. Stacey L., 9/20/2024 Testimonial Tree Mr. Bates done what no other sales person can do with same property Timothy W., 7/1/2024 Testimonial Tree As out-of-state homebuyers we had a bucket full of questions and lots of learning to achieve our forever home. We could not have done it without the professional knowledge of Rob Barr. We always felt like our questions were important and Rob never failed to supply or chase down the answer. If you are in need of an agent call Rob! He is absolutely the best!🏚🔑 Carla B., 5/26/2024 Testimonial Tree A family member referred us to Rob Barr at Robert Brothers and we couldn’t be happier with the process and outcome. He went above and beyond to help us find our first home. Would definitely recommend. Jessica L., 5/2/2024 Testimonial Tree Rob was the best fit for me. He was flexible with his hours which was a massive need for me. He was also very honest about the houses we toured. Rob made the process enjoyable and stress free. Maria F., 4/16/2024 Testimonial Tree Rob was the best! He was very helpful during the process of getting our home. Rob is knowledgeable of what he does, and it gives you peace of mind to work with him. The best thing about working with Rob was that he supported us during the whole process and even after we signed for the house. If you are looking for a realtor in the Alabama area, Rob is the person you want! Monica E., 12/9/2023 Testimonial Tree Very big help Jo L., 10/24/2023 Testimonial Tree Rob Barr is an amazing agent - I can't recommend him enough. He managed my entire purchase from viewing to closing, while I was across the country. We ran into a few obstacles (on the seller side), and he immediately did everything in his power to get us back on track. He is extremely proactive and incredibly knowledgeable. Even my bank/lender mentioned how great it was working with Rob! Jacquelyn A., 7/11/2023 Testimonial Tree", "name": "Rob Barr", "website": "https://robbarr.robertsbrothers.com/", "agent_phone_numbers": "251-581-4030", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "559 North Section St. Fairhope AL 36532", "profile_url": "https://www.robertsbrothers.com/bio/emilybarber", "description": "About Emily Barber As a dedicated and passionate real estate agent with Roberts Brothers, Emily prides herself on delivering exceptional service and achieving outstanding results for her clients. Whether you are a first-time homebuyer, looking to sell your property, or a buyer exploring the area from afar, she will be there to guide you every step of the way! Emily’s approach is built on integrity, transparency, and a genuine desire to meet her clients' needs. She utilizes the latest technology and marketing strategies to ensure your property is showcased effectively, or that you find the perfect home that meets your lifestyle and budget. When she is not assisting clients, you can find her spending time with her husband and two children. Emily believes that the Eastern Shore is a wonderful place to call home, with its history, charm, and spectacular views! She would love to work with you to make your real estate dreams come true!", "name": "Emily Barber", "website": "https://emilybarber.robertsbrothers.com/", "agent_phone_numbers": "865-454-4240", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/natalyabaranyuk", "description": "About Natalya Baranyuk is a dedicated and knowledgeable real estate professional with a passion for helping buyers find their dream homes. Nothing excites her more than seeing the joy on a client’s face when they step into the perfect property. Whether working with buyers or sellers, she is committed to making the process smooth, stress-free, and rewarding.Fluent in English, Russian, and Ukrainian, Natalya is able to connect with a diverse range of clients, ensuring clear communication and a seamless experience. With a Diamond Excellence Certification for completing both buyer and seller certification classes, she brings expert-level knowledge and top-tier service to every transaction.Known for market expertise, strong negotiation skills, and a client-first approach, Natalya is dedicated to guiding buyers and sellers through every step of their real estate journey. What sets Natalya apart is her unwavering loyalty to her clients – she is dedicated to their success and works tirelessly to ensure they get the best possible outcome. Known for her honesty and integrity, she believes in open communication and always puts her clients’ best interests first. At the same time, she brings a fun and energetic approach to real estate, making the process enjoyable and stress-free.Beyond real estate, Natalya is a proud parent of five children, which has strengthened her ability to multitask, stay organized, and understand the importance of finding the right home for every stage of life. With a deep commitment to helping families and individuals navigate the market, she is dedicated to guiding clients through every step of their real estate journey with care and professionalism. Whether buying, selling, or investing, clients can trust Natalya to provide expert guidance and exceptional service. Testimonials Natalya was very professional and kind. She was very patient and easy to work with. We had a very limited schedule but she made it all happen. Our home is beautiful and we’re grateful for all the work she put in to make the purchase of our home a positive experience. Ximena B., 6/20/2025 Testimonial Tree We had a very positive experience with this company and enjoyed working with our realtor. Ximena B., 6/20/2025 Testimonial Tree Mrs. Natalia was an absolute pleasure to work with. She spent dozens of hours working with us to find our forever home and then tirelessly and diligently worked hard to make the process extremely easy for my wife and me. Not to mention, she NEVER pressured us in any way. Her spirit, attitude, and servants spirit were all wonderful throughout the process. We couldn’t give her high enough ratings! We highly recommend her to you if you are buying or selling a home. Kurt C., 11/21/2024 Testimonial Tree I'm pretty much a novice when it comes to navigating the real estate world, but Natalya helped me out with every detail and vigorously advocated for me with the seller's agent. If any difference of opinion or conflict arose, she was in my corner all the way, and right there for every question I had. Couldn't have done it without her capable help! Rex S., 4/17/2024 Testimonial Tree My husband and I were in a bit of a rush to find a home to purchase. Natalya was ready and willing to help us find a home. She was so patient, always available, friendly, thorough and prepared! Natalya went above and beyond for us and worked so very hard for us to close on the home we found. If Natalya didn't have an answer for us, she either found the information herself or pointed us in the right direction as to where we could get what we needed. She made everything as seamless as possible and was so very pleasant to work with! We would definitely use her in the future and highly recommend Natalya for YOUR next realtor! Susan S., 11/14/2023 Testimonial Tree I had the privilege of working with Natalya toward the end of 2022/beginning of 2023 and she was fantastic! What stuck out to me most was her genuine care, quick response and diligence in helping me find my perfect home in a very short amount of time. I’d recommend Natalya to help find your perfect home because she’ll treat you like family!! Brittnie S., 7/11/2023 Testimonial Tree Natalya was amazing! She helped us find our amazing home plus a rental property. She made everything so quick and easy and was willing to show us home after home until we found the one we loved. Thank you, Natalya! Kurt D., 7/10/2023 Testimonial Tree", "name": "Natalya Baranyuk", "website": "https://natalyabaranyuk.robertsbrothers.com/", "agent_phone_numbers": "251-230-1209", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/jeanettebaldwin", "description": "About Jeanette Baldwin Meet Jeanette Baldwin, a passionate real estate agent serving Mobile County, Alabama, with a special focus on first-time homebuyers. Licensed in November 2024, Jeanette combines over 12 years of experience in customer service, business management, and marketing to provide exceptional guidance to her clients through the home buying and selling process. Jeanette’s passion for helping others extends beyond the business world. She is deeply committed to empowering low-income families and individuals, helping them achieve personal success and growth. Her goal is simple: to make the home buying and selling process as easy and stress-free as possible, being there for her clients every step of the way.What drew Jeanette to real estate was the desire for a career that offers the financial freedom to support her family while still being present in their lives. As a mother to one daughter—who is her world—she understands the importance of work-life balance and strives to create that same sense of balance for her clients.When she's not helping clients find their dream homes, Jeanette enjoys traveling, baking, reading, swimming, and spending quality time with family and friends. A fun fact about Jeanette: she majored in Spanish, which allows her to assist non-English-speaking clients, ensuring everyone feels heard and understood.Jeanette chose to join Roberts Brothers because of their reputation for being a family-oriented company that supports agents in building their businesses from the ground up. She knew Roberts Brothers would treat her as more than just a number, and she is excited to bring her skills, passion, and commitment to the team.", "name": "Jeanette Baldwin", "website": "https://jeanettebaldwin.robertsbrothers.com/", "agent_phone_numbers": "251-408-2213", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/terribaker", "description": "About Terri Baker My nest is nearly empty and I am ready for life’s next adventure and doing what I enjoy. People, projects and property are among the things that I love. This year I have joined the Roberts Brothers team and am a licensed realtor! Bill and I are Mobile natives, graduating from Theodore High and Bill attended University of Mobile. We have three incredible children. Our family has been involved in our community, leading basketball for a community team for high school guys, working with various addiction recovery outreaches, and storm relief teams. We serve with our church family at OPC, teaching Sunday School and working with our Youth department. Just for fun, I have always looked at homes that were for sale in the Mobile area and helped friends and family find a home that was perfect for them. Last year I took on a “flip house” and loved the flip so much that we moved into it. I love renovating, decorating and turning the old and ordinary into something magical. Before starting a family I was a travel agent for many years. I worked in corporate travel and helped plan business trips. Later, I worked as a wedding planner helping couples creating their dream wedding. Now, I would like to help families find their dream home! There is something here in Mobile and on our Gulf Coast for everyone! So, if you are just starting your nest, a new business, or downsizing because of an empty nest, let me help you find a place that you will love, while getting the most for your money! Testimonials Terri was wonderful to work with. This sale was a long process, and she went the extra mile to get it done! Judith E., 12/17/2024 Testimonial Tree My agent was genuine. She was kind. She treated me just like a human. I would imagine just like she wanted to be treated. I have never received this kind of service. We need a Terri Baker over costumer’s service in every establishment. Thank you! Brenda K., 10/6/2024 Testimonial Tree We had no idea where to start when we decided we were looking for a home. Thankfully, Terri knew exactly what to do and helped us every single step of the way! She is an amazing informative realtor. I would recommend her to everyone I could! It was a great experience all around! Victoria S., 7/28/2024 Testimonial Tree I had the pleasure of working with Terri as my real estate agent, and I couldn't be more thrilled with the experience. As a first-time homebuyer in Mobile, Alabama, navigating the process was initially overwhelming, but Terri's guidance and support made all the difference. She went above and beyond, acting not just as an agent but as a reassuring motherly figure, especially considering I left my mom in Florida. Terri's genuine care extended beyond the transactional aspect. Being a Christian, it meant a lot to me when Terri took the time to pray over my new home with me. Her personal touch and heartfelt connection truly set her apart. What impressed me most was Terri's unwavering commitment. When challenges arose, and there was an attempt to delay my closing, Terri fought for me until the very end. Her dedication and advocacy ensured a smooth and timely closing on January 29th. Terri is not just a real estate agent; she's a caring professional who goes the extra mile for her clients. I highly recommend her to anyone seeking not only expertise in real estate but also a genuine and supportive partner in their homebuying journey. Salena, 2/28/2024 Testimonial Tree Terri is as good as they come. Wouldn’t trust anybody else with my real estate needs! Zachary S., 1/17/2024 Testimonial Tree Great company ! Many seamless transactions Willam S., 6/16/2023 Testimonial Tree Miss Terri is an excellent professional and person. I was in a difficult situation since I reside 10 hours away from the property; I have 2 small kids, so the home had some wear and tear. Miss Terri managed all the contractors, at extremely reasonable prices, to do the necessary work to sell the home. Not once was I required to make the trip to the property, saving me hundreds of dollars, travel time, and PTO time. She knew exactly what the house needed; once the property hit the market, it sold in 3 days. Excellent service all around; worth every penny. I also want to say that I am not related to Miss Terri nor Robert's Brothers and this is a completely independent review. Isaac V., 6/15/2023 Testimonial Tree", "name": "Terri Baker", "website": "https://terribaker.robertsbrothers.com/", "agent_phone_numbers": "251-786-0337", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/brentbaker", "description": "About Brent Baker Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you. Testimonials The process went extremely well because Brent Baker kept us informed through the entire process. In fact, because of Brent and his efforts we closed sooner than expected. Kevin A., 8/13/2024 Testimonial Tree Brent went above and beyond to assist in selling my Father's home In Alabama. I live in California and the deal was smooth, fast and easy. Escrow closed early and without any issues. Thank you again and I would highly recommend. Aimee V., 7/2/2024 Testimonial Tree Brent was wonderful to work with and will recommend him to all my friends and family. He made purchasing a home easy. Anne E., 11/10/2023 Testimonial Tree", "name": "Brent Baker", "website": "https://brentbaker.robertsbrothers.com/", "agent_phone_numbers": "251-472-5801", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "559 North Section St. Fairhope AL 36532", "profile_url": "https://www.robertsbrothers.com/bio/jessicabailey", "description": "About Jessica Bailey Jessica Bailey is an experienced Realtor with a deep connection to the Mobile Bay area and Gulf Coast region She has helped buyers and sellers navigate all types of properties and situations, from distressed homes to luxury estates. Jessica's knowledge of the area and her ability to adapt quickly have been critical in helping clients during the pandemic. She has learned to pivot and adjust to the ever-changing landscape, ensuring that her clients receive the best possible service. In addition to her experience and adaptability, Jessica is passionate about educating herself and others in and out of the real estate industry. Jessica is supported by a team of professionals at Robert Brothers who share her dedication to providing exceptional service to clients. Together, they have the expertise and resources to help you with all your real estate needs. When she's not working, Jessica is an avid sailing enthusiast and a devoted mother to her children, Grayson and Abby. She values her connections with family and friends deeply and enjoys spending time with them whenever possible. If you're looking for a Realtor who knows the Mobile Bay area and Gulf Coast region inside and out, and can help you navigate any real estate situation, Jessica and the team at Robert Brothers are here to assist you. Testimonials I have never met anybody like her. She is genuinely in your corner when buying a home. When she says she'll do something, consider it done. And fast. And extremely knowledgeable. She's great!! Floyd M., 7/20/2025 Testimonial Tree Jessica bailey was one of the most down to earth, friendly and professional realtor i have worked with. Her patience on and off the past 3 years was unmatched! Thx so much for hanging in with us!!! Paul A., 11/15/2023 Testimonial Tree Jessica was the best! We really could not have found a better agent for our purchase. She fought for us when we needed help in our home buying purchase. Her motto was that she was going to “get us in this house”. I truly believe we would have lost our dream home if it was not for her excellent communication, willingness to make us her priority, impeccable knowledge of Real Estate and master negotiation skills. We will never use another agent and look forward to using her again with our investment properties. Look no farther and hire Jessica Bailey. Linden J., 6/15/2023 Testimonial Tree I would like to extend my gratitude to Jessica Bailey for her exceptional efforts in selling our family home in Fairhope, Alabama. There has never been a home sold for its true value in this undervalued African American community due to the historical practice of devaluing properties. Thank you, Jessica, for advocating on behalf of our family and ensuring that we were treated fairly. Our brick 3-bedroom house had a value that could have been sold for more than $200,000 or $300,000 in other areas of Fairhope, instead of being sold for less in a minority community. Thank you for rejecting the old practice of mistreating families of color. Jessica Bailey, you are a true lady of Christian values. Our family thanks you, once again, for representing us in the sale of our home. Thank you, Jessica Bailey Sincerely your friend, Alvin Lovett Alvin L., 6/15/2023 Testimonial Tree \"Pierce , Payton , Chris and I want to thank you Jessica for helping us with this house couldn’t of done this without you and of course can’t forget Lance either. We are so excited to have this beautiful home. You are the best and we all love you so very much!!!!!\" Anita N., 6/15/2023 Testimonial Tree", "name": "Jessica Bailey", "website": "https://jessicabailey.robertsbrothers.com/", "agent_phone_numbers": "251-979-6588", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/kylebaggett", "description": "About Kyle Baggett Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Kyle Baggett", "website": "https://kylebaggett.robertsbrothers.com/", "agent_phone_numbers": "843-437-6291", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/annebaggett", "description": "About With over fifteen years of experience as a nurse, and a thirty-year career as a real estate professional, Anne Baggett has dedicated her life to serving people with compassion.Born and raised in Mobile, Anne spent her summers on Mobile Bay, giving her a very special connection to the Gulf Coast and everything that makes it unique. She graduated from Convent of Mercy High School, attended Spring Hill College and graduated from Providence School of Nursing. After graduation, she worked for fifteen years as a Recovery Room Nurse, giving her extensive knowledge on what it means to truly serve others.With a growing family, she took on a new career as a real estate professional, which allowed her to serve others, create lasting relationships, and still have time for family and community service. Her goal is to give tireless service and a happy home hunting/selling experience to her clients. As a top agent with over thirty years in real estate, she has truly found \"HOME\".Deeply committed to serving her community, Anne serves on the Advisory Board of Catholic Social Services, Archdiocesan Council of Catholic Women, a member of the Toy Bowl Board Youth Athletics Committee, a volunteer with Little Sisters of the Poor, and a Member of JDRF.Anne serves on the Advisory Board Roberts Brothers Charitable Fund (Legacy for Lost Children), is a Member of Mobile Chamber of Commerce, and Runner-up “Realtor of the Year” Nappies Award in 2011.A proud mother and grandmother, she loves staying involved in her grandchildren’s many activities. Testimonials Anne Baggett is the best! She is always thorough and keeps us informed step by step. She makes the entire process super easy for us. Susan H., 10/21/2023 Testimonial Tree Anne Baggett is amazing!!! Kathleen D., 10/21/2023 Testimonial Tree", "name": "Anne Baggett", "website": "https://annebaggett.robertsbrothers.com/", "agent_phone_numbers": "251-423-5128", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/michelleautio", "description": "About Michelle Autio Michelle was born and raised here in beautiful Mobile. She is a graduate of St. Pauls Episcopal School and the University of South Alabama. She and her husband of 25 years, Mark (a Navy veteran), have two beautiful girls that are her inspiration. Her daughters attend Auburn University and St. Pauls Episcopal School. Michelle put her career in real estate on the back burner to dedicate her life to being a full-time stay at home mom. During this time she volunteered as a teacher and office worker at St. Pauls while never missing a field trip! She has strong management and organizational skill while also a large network. Now that her girls are older she wants to continue to be a role model for them and has returned to her passion of helping others sell or buy their forever home. In her first year of selling real estate, even in a pandemic, Michelle was awarded Rookie of the Year for all of Roberts Brothers. And last year climbed to #18 in a company of almost 300! She is dedicated and puts her customer first, always answering the phone when it rings. In her free time she enjoys performing as a gospel singer, playing tennis, leading the worship service at Volunteers of America, performing at womens conferences and vacationing with her family. Whether buying or selling, Michelle wants to get to know you and focus on your wants. Since she has always lived in Mobile she knows Mobile and Baldwin counties. Having a passion for getting things done, Michelle takes pride in understanding her clients time-sensitive needs and will put YOU first. She enjoys building lasting relationships with all her buyers and sellers. Testimonials Our realtor, Michelle Autio, was awesome throughout the process of selling our home. She went above and beyond to reach out to potential buyers, represented our interests with integrity, and patiently held our hands all the way through closing. We highly recommend Michelle and Robert's Brothers. Mattie M., 6/16/2025 Testimonial Tree Michelle Autio is an excellent realtor to work with. She went above and beyond in showing us houses all over Mobile and Baldwin county until we found the perfect one. She was able to answer any question we had, even if she had to talk with several people to get the answers. She was punctual, curteous, cheerful and very easy to like. If we ever need assistance with a home. either buying or selling, she will be our first call. The Hendricks Amy H., 4/23/2025 Testimonial Tree Michelle was so very helpful. She walked me through the process. And she was able to answer any questions that we had. She truly did make the home buying process enjoyable. Lori M., 4/8/2025 Testimonial Tree My fiance and I were well taken care of and were ran through everything along with educational tips since we are first times buyers. Nothing but pleased by the help of Michelle Autio. Robert E., 4/8/2025 Testimonial Tree Michelle made this a painless, easy, and enjoyable process. She is a consummate professional who I will use in the future for our next home. Thank you Roberts Brothers and thank you Mrs. Audio. James M., 4/7/2025 Testimonial Tree Michelle Autio was so helpful in helping us sell our parent’s home. She went above and beyond to help us through a difficult time and to make sure everything worked out. Rebecca R., 3/3/2025 Testimonial Tree Michelle is professional and caring. She works very hard to keep all parties informed. Kristin B., 12/28/2024 Testimonial Tree Michelle is a wonderful realtor. She is very professional, hard working and very kind always keeping in touch with you to let you know what's going on . I am so very thankful that I met Michelle she sold my dad's house in Mobile as I live in Washington state. I would highly recommend Michelle one of the best realtors in Mobile. Rose W., 10/29/2024 Testimonial Tree Michelle is a wonderful realtor. She is very professional, hard working and very kind always keeping in touch with you to let you know what's going on . I am so very thankful that I met Michelle she sold my dad's house in Mobile as I live in Washington state. I would highly recommend Michelle one of the best realtors in Mobile. Rose W., 10/29/2024 Testimonial Tree Michelle A. Was amazing , while I with through the most biggest accomplishment in my life … Porshia T., 7/30/2024 Testimonial Tree Michelle was so helpful from the time I met her at an open house till I purchased my home. She’s friendly, down to earth, and responded quickly whenever I needed her. If I ever buy another house, I’m using her! Lynn B., 7/22/2024 Testimonial Tree Michelle is a pleasure to work with. The buying process was a breeze as she was there every step of the way to answer questions and guide me along with whatever actions were needed from me. She was always pleasant, patient, efficient and responsive. I would highly recommend her to anyone and when I have real estate needs in the future, she will be my first call. Monte B., 7/4/2024 Testimonial Tree Michelle has now sold us 3 houses. Her professionalism and attention to detail is unsurpassed. She’s our girl! Ashleigh O., 7/2/2024 Testimonial Tree Our agent Michelle Autio did a fantastic job in every aspect. She guided us through it all, from getting the house ready to be shown, all the way to closing. She couldn’t have done a better job!! Joseph M., 7/2/2024 Testimonial Tree We relocated from out of state and Michelle went above and beyond with us to help us find exactly what we were wanting, and facilitated a smooth transaction. Twila D., 3/6/2024 Testimonial Tree Michelle went out of her way many times to make sure our questions were answered. Kept in touch though closing. She did a magnificent job. Was helpful every step of the way. Roger D., 3/6/2024 Testimonial Tree Michelle Autio has an incredible talent for detail and follow up. Her ability to put the homebuyer’s needs and wants, as it pertains to their home purchase, is impeccable. Ashleigh O., 10/6/2023 Testimonial Tree Michelle Autio was a phenomenal agent! She was proactive every step of the way. Every interaction was personal and she ensured all elements of our house purchase went smoothly. I cannot recommend Michelle enough! ⭐️⭐️⭐️⭐️⭐️ Audrey M., 9/28/2023 Testimonial Tree We closed on our home here in Mobile a couple of months ago and are just a few weeks short of moving in after the renovations. We are so excited and could not have done it without Michelle Autio. Mobile friends if you need to buy or sell a home call her. She’s the best! And we put her through it with the problems selling our home in Florida. She should have gotten a commission off of that one. We’ve been friends since childhood and I’m so thankful to be back in touch with her. Suzanne B., 7/20/2023 Testimonial Tree My wife and I got contact with Michelle in last year and she has helped us to make two purchases! She's not only being nice, patient, and helpful throughout the entire processes of our house hunting but also continue to provide helpful suggestions/information after we complete the purchase. She has been and will continue to be our realter of choice! T. S., 7/19/2023 Testimonial Tree Michelle is absolutely wonderful. She is the agent for my brother, father, and soon my nephew. I keep sending my family to her because she continues to deliver personalized and professional care. Oh how i wish she could assist me in Georgia as well. Toni S., 7/18/2023 Testimonial Tree Michelle, you are such an awesome agent!! You are beyond professional and knowledgeable. I was blessed to be lead to someone determined to find me the right house within my budget. I loved the fact I could always call you anytime with my concerns and you always kept me updated. Your knowledge and expertise is why we are here now! I don’t know where you got all your energy and patience! But I am so thankful you remained focused from day one and kept the same tempo the entire time. It helped me remain hopeful when at times I was ready to give up because of the market itself. If I asked you questions, without delay, you alway found the answer and guided me through this process while looking out for my best interests. I feel like some people are delight and great to work with personality wise yet not proficient or knowledgeable at their jobs and there are those that are absolutely not approachable but overly excels and delivers on what they promise. But I sincerely feel you and Lindsey Bembry (my wonderful loan officer) embody both of those positive characteristics which simply sets you ladies above the rest. I would easily refer friends to Roberts Brothers! Thank you for never judging and always encouraging. My family and I love our new Home. Olivia K., 7/18/2023 Testimonial Tree Michelle was a Godsend. We had touched base a year ago but my personal health intervened before we could even get started. After a year I knew I needed to sell the house quickly before it deteriorated. I got back with her on the last Thursday in June. She did comps the next day. She came up with a strategy Monday the 3rd of July. And I had a great offer on July 11th and we closed on the 14th, 2 weeks after the process started. She was professional, knew her area, and came up with the best offer for me. And she has a great smile, and personality that made working with her oh so easy. Rebecca B., 7/17/2023 Testimonial Tree", "name": "Michelle Autio", "website": "https://michelleautio.robertsbrothers.com/", "agent_phone_numbers": "251-599-1959", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/tayloraustin", "description": "About Taylor Austin Taylor Austin is your dedicated real estate professional serving the beautiful Gulf Coast of Alabama. With a passion for art, socializing, reading, and traveling, Taylor brings a unique blend of creativity, adaptability, and enthusiasm to every client interaction.Originally from the small town of Brewton, Alabama, Taylor has recently relocated to the Gulf Coast in pursuit of a successful real estate career. Being from a small town, Taylor learned the importance of integrity and reliability when forming genuine connections. Taylor pursued academic and athletic endeavors in Brewton, attending the local college. Playing sports her entire life played a big roll in how she handles adverse situations. Sports instilled a strong work ethic, teamwork mentality, and competitive spirit, all of which seamlessly integrate into Taylor’s real estate practice.With years of experience in the service industry, Taylor has mastered the ability to connect with people from all walks of life and easily embraces the fast-paced nature of real estate. Patience, understanding, and a genuine desire to relate to others define Taylor’s approach, allowing for adaptation to any situation and ensuring a positive experience for clients.As Taylor puts it, Working with the community and the people within it is not just a job, but a privilege. Every interaction is an opportunity to make a positive impact and build lasting relationships. Taylor’s goal is to advocate tirelessly for clients, providing them with a personalized and unparalleled experience. Knowing her leverage with the reputation and achievements of Roberts Brothers Inc., Taylor hopes to showcase all of the knowledge Roberts Brothers Inc. continues to provide through out her journey. Taylor aims to use her expertise in social media marketing and plans to showcase properties effectively and reach a wider audience. Taylor aspires to become clients’ go-to-real estate agent, known for her integrity, professionalism, and dedication to exceeding expectations.", "name": "Taylor Austin", "website": "https://tayloraustin.robertsbrothers.com/", "agent_phone_numbers": "334-313-2781", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/janicearrington", "description": "About Janice Arrington She was born and raised in Mississippi, but relocated to Mobile, Alabama to further her education and embarked upon a new career path. She received her A.A. Degree in Business Administration from Jones County Junior College. As a business-oriented person, she endeavored into banking and accounting. As a life-long learner, she received her B.A. in Elementary Education from the University of Southern Mississippi. This milestone led her to receive her M. Ed. in Administration. She retired with 25 years of dedicated service from the Mobile County Public School System. As an entrepreneur, she also has experiences in buying and selling residential property. She is eagerly awaiting to assist your real estate needs during your buying and selling process. Besides investing time with others, she also enjoys spending time with her husband, daughter, and countless family members. Testimonials Janice was  Lamar B., 6/28/2025 Testimonial Tree", "name": "Janice Arrington", "website": "https://janicearrington.robertsbrothers.com/", "agent_phone_numbers": null, "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/sherryarchibald", "description": "About Sherry Archibald Sherry’s roots trace back to the Midwest state of Ohio, but for the past two decades, she has called Mobile, AL home. Her familiarity with Mobile and its surrounding counties blossomed as she accompanied her children to various club sports events like soccer, football, volleyball, and golf. This firsthand knowledge of the area is just one of the many tools she possesses to assist you in finding your perfect permanent residence, rental property, or beach getaway. As a real estate professional affiliated with Roberts Brothers, Sherry offers unparalleled access to top tier resources for both buying and selling properties. Roberts Brothers is renowned for its distinguished reputation of excellence and professionalism, positioning them as leaders in the real estate industry. Beyond her real estate, Sherry finds fulfillment in serving her church and local community, as well as enjoying leisurely walks on the picturesque campus of Springhill College Whether you’re seeking to establish yourself in South Alabama or simply relax on the beautiful beaches, Sherry is committed to being your trusted guide. Reach out to Sherry today for personalized, reliable, and dedicated service that exceeds expectations.", "name": "Sherry Archibald", "website": "https://sherryarchibald.robertsbrothers.com/", "agent_phone_numbers": "251-776-3318", "country": "US"}
{"title": "Associate Broker - REALTOR", "address": "900 Bienville Blvd. Dauphin Island AL 36528", "profile_url": "https://www.robertsbrothers.com/bio/markandrews", "description": "About Mark Andrews When you are ready to buy or sell, contact me and let's put the plan together now. As a lifelong resident and successful business owner in Mobile, I am Ready, Willing, and Able to help you meet all your real estate needs. When you're ready to sell, I'll help you build a marketing plan to fit your needs and goals. Together with myself, the backing of more than 70 years of Roberts Brothers strength in Mobile and Baldwin counties, and more than 200 other Roberts Brothers agents, our efforts will move you closer to reaching your goals in real estate. I also want the buying process to be one that creates a lasting relationship that will bring you back to me now and in your future referrals. Feel free to contact me at MarkAndrews@RobertsBrothers.com through our office number (251) 661-4660, or direct cell (251) 591-4438. Testimonials Mark did a great job helping us find the home of our dreams. Look forward to working with him again in the future. Greg F., 9/25/2023 Testimonial Tree", "name": "Mark Andrews", "website": "https://markandrews.robertsbrothers.com/", "agent_phone_numbers": "251-591-4438", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/barbaraandrews", "description": "About Barbara Andrews Check out this fantastic private estate with 114 acres only 15 minutes from downtown Mobile! https://www.youtube.com/watch?v=CVMwVrxxQSI Prime Location in Downtown Bay Minette! https://www.youtube.com/watch?v=yFgeAKjCx-g Call me for a showing today! Barbara Andrews 251-689-4942 Being a native Mobilian, I am an ambassador for our beautiful historic Gulf Coast. Growing up on Marine Street in downtown Mobile, playing in Washington Square, cheering at Ladd Stadium during the Senior Bowl while my dad reported stats for the Mobile Register or walking through the wooden revolving door of the children's room at the Ben May Library, give me \"story\" behind our location. And isn't real estate all about LOCATION!! LOCATION!! LOCATION!! Later moving to west Mobile county and helping my parents build our family home in Theodore, gave me experience in home construction, style and creative problem solving. Dad bought 14,000 bricks from the old LeVert home, staircases, doors, light fixtures from historic homes and incorporated them into our new home on Belle Terrace Drive. While in Theodore, I enjoyed fishing on Fowl River, skiing on Dog River and strolling in Bellingrath Gardens. I am married to Hamp Andrews and we have three married adult children, three adorable grandchildren and one on the way! We enjoy living on the Eastern Shore where we golf, go antiquing and cheer for our grands! \"It has been satisfying helping my customers achieve their real estate dreams. I have helped grandparents find homes closer to their grandchildren. Families are happier, needs are met and love is shared!\" If you are looking to buy or sell, give me a call, text or email. Testimonials Great to work with! John H., 6/26/2025 Testimonial Tree Barbara was excellent to work with! GREAT communication and was always available to answer any questions! I would rate higher than a 10 if I could! Thank you Barbara, you were an absolute pleasure to work with! Kathryn A., 6/26/2025 Testimonial Tree Barbara Andrews and Roberts Brothers did an outstanding job, from getting our home ready to list to the final closing. Barbara was so helpful and professional. She kept me informed and updated on each step of the process and was always available to answer any questions as they arose. Evelyn H., 5/19/2025 Testimonial Tree Barbara performed beautifully for us and made the transition seamless. As well as being a good friend, she is also a thorough and thoughtful professional realtor. We loved working with her and would tell others the same. Carter B., 5/15/2025 Testimonial Tree Barbara Andrews was excellent. I would highly recommend her. I actually have already! Thank you. Beth I., 5/4/2025 Testimonial Tree Barbara Andrews has helped me with buying and selling several properties. Every time, it has been more than pleasant. She is detailed oriented and is on your side. My last property was for sale and I had moved out of town. She kept me updated on the visual details of the property and the market there. She sold it for me and it was a breeze, even from a distance. She takes care of her clients. I highly recommend Robert’s Bros. Realty and Barbara Andrews! Rebecca J., 12/4/2024 Testimonial Tree Seamless transaction! Frances R., 8/20/2024 Testimonial Tree Barbara was truly a God-send to us! She quickly learned exactly what we wanted and needed and was strategic in the houses she sent us. That was very special! She relentlessly pursued our perfect house and even though we took almost 2 years to find it, she never gave up and kept the most positive, encouraging attitude. Barbara was always such a delightful person and never made us feel negative in any way. We would highly recommend her to be anyone’s agent! Thank you for a wonderful experience Roberts Brothers! Barbara L., 6/18/2024 Testimonial Tree Barbara is a great agent. She showed us homes for over 2 years. We worn her, out but her diligence paid off for us. After the long journey Barbara land our dream home. Thank you Robert's Brother's Fred A., 6/16/2024 Testimonial Tree My past experiences include 5 years as a realtor and 25 years as a residential mortgage loan officer for BBT bank Florida. I have dealt with hundreds of realtors and I can very truthfully say that Barbara Andrews is one of the best I have had the pleasure of working with. Without Barbara, our purchase would never have come to fruition. She consistently went above and beyond to insure that our closing was successful and then helped us beyond measure with our move. I was out of the country and she jumped right in to meet contractors at the house and then to actually help all day with the actual move. She was truly a Godsend! Sue K., 5/28/2024 Testimonial Tree Working with Barbara Andrews throughout the marketing and sale of my property was first class. Thank you! Gerritt G., 3/26/2024 Testimonial Tree I alone have bought and sold over 10 homes in my life. Barbara Andrews is one of the most dedicated and professional agents my with and I have ever worked with. Raymond R., 12/26/2023 Testimonial Tree Barbara Andrews is a top notch realtor and person. She went above and beyond for us in every way. She truly cares about her clients and treats them as real people with varying needs, tastes and emotions. I would heartily and highly recommend her to anyone looking for a realtor, as a buyer or a seller. I cannot say enough about Barbara. I have bought and sold 12+ homes before, and she was the best person to work with by far. Love her! Nancy S., 12/26/2023 Testimonial Tree Barbara Andrews was extremely helpful throughout this process. I enjoyed having her as our realtor. She went above and beyond to guide us through this transaction. Be glad to recommend her to anyone in need of a realtor in this area. Jeri A., 8/15/2023 Testimonial Tree Barbara was very knowledgeable in the area that we were looking and showed us many good options. Very easy to work with. She made the whole process easy for us. Carl D., 8/14/2023 Testimonial Tree", "name": "Barbara Andrews", "website": "https://barbaraandrews.robertsbrothers.com/", "agent_phone_numbers": "251-689-4942", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/susanandersen", "description": "About Susan Andersen Susan is proud to be part of a team that has served our community for nearly 80 years. She shares the same deep commitment to clients and colleagues that has defined our company’s legacy. With 27 years of experience as a registered nurse in this very community, Susan has dedicated her life to caring for others. Now, she brings that same level of compassion, dedication, and attention to detail to every real estate transaction. Whether you're buying your forever home or selling a place filled with memories, Susan is honored to walk beside you through every step—now and in the future. Thank you for choosing Roberts Brothers, and for placing your trust in Susan.", "name": "Susan Andersen", "website": "https://susanandersen.robertsbrothers.com/", "agent_phone_numbers": "251-609-0869", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/rodneyaldridge", "description": "About Rodney Aldridge Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Rodney Aldridge", "website": "https://rodneyaldridge.robertsbrothers.com/", "agent_phone_numbers": "704-860-5804", "country": "US"}
