{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/makivajohnson", "description": "About Makiva Johnson Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Makiva Johnson", "website": "https://makivajohnson.robertsbrothers.com/", "agent_phone_numbers": null, "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/jenniferjohnson", "description": "About Jennifer Johnson As a dedicated retired military spouse, Jennifer understands the importance of finding a home that suits your family’s needs. With four wonderful children, two of which are now young adults, and her first grand baby, Jennifer has navigated the challenges and joys of family life and understands the unique needs of both buyers and sellers. Over the past five years, Mobile has become her home, and herself and her family have grown to love this community. Jennifer is excited to leverage her deep local knowledge and commitment to helping families find their ideal homes. Call, text, or email Jennifer today and let Jennifer do the work for you and your loved ones, ensuring you make the right move for your future. Jennifer is proud to be a part of the Roberts Brothers team, an excellent and professional company with a long-standing reputation in the industry. Rest assured, Jennifer is here to be your go-to resource in the community for all your buying or selling needs. Let Jennifer work for you, and make your real estate dreams a reality.", "name": "Jennifer Johnson", "website": "https://jenniferjohnson.robertsbrothers.com/", "agent_phone_numbers": "251-431-4199", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/angelajohnson", "description": "About Angela Johnson Angela is a native Mobilian, a dedicated and hardworking realtor with a true passion for helping clients achieve their real estate goals. With extensive experience in the industry, Angela has a deep understanding of the local market trends. Known for her professionalism, integrity and personalized approach, Angela takes the time to listen to her clients' needs and develop customized strategies to meet their specific wishes. Whether it's buying, selling or investing in real estate, Angela provides guidance, market insights and negotiation skills to ensure a seamless and successful transaction. Angela's background as an insurance adjuster helps her to provide valuable insights such as, a keen eye for detail when evaluating property conditions, property evaluation and negotiation skills. And throughout her career, she has built a vast network of industry professionals, including lenders, inspectors and contractors, allowing them to provide comprehensive assistance to clients at every step of the transaction process. Angela and her family attends Dayspring Baptist Church and she's an active member of her community. Angela's commitment to faith and her community values informs her work as an agent, fostering a compassionate approach when assisting clients in finding their dream homes. Angela cherishes every relationship she gets to build with her customers and clients, which typically turns into long time friendships. She understands that buying and selling property is one of the biggest decisions you will ever make. Angela is passionate about giving personal attention to every detail of every transaction so that her buyers and sellers can have a happy experience and make wise choices. Contact Angela today for all your real estate needs and experience firsthand her unwavering commitment to delivering exceptional service. Angela's motto: SOLVING PROBLEMS & ACHIEVING GOALS", "name": "Angela Johnson", "website": "https://angelajohnson.robertsbrothers.com/", "agent_phone_numbers": "251-366-6171", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/johnnyjernigan", "description": "About Johnny Jernigan Born and raised in Mobile, Johnny has deep roots in the Gulf Coast. Johnny graduated from high school in Mobile and then married his high school sweetheart, Karen. They have been married since 1984 and their journey has taken many twists and turns. Johnny is an ordained minister and is a nationally known motivational speaker. He assists many churches with strategic planning in helping them develop a networking process to effectively serving the needs of their communities. That experience over the past 30 years has enabled Johnny to learn the value of team building, networking and a \"get it done mentality.\" Three wonderful children, influence in 13 nations and counting, millions of frequent flier miles and numerous relationships across the Gulf Coast, Johnny is perfectly positioned to help others buy, sell or develop their real estate needs. Johnny leads in a professional, relational and hard working process. From Johnny's heart to your home, people are at the heart of Johnny Jernigan's passion for life. So why did Johnny get into the Real Estate business? Whether buyer or seller, Johnny loves to help people. From any walk of life, Johnny has developed a pathway process to ensure that people succeed. By joining the award winning Roberts Brothers Real Estate Team, this allows him to bring his proven track record for life success to an efficiency at the real estate table. With a proven networking solutions process, social media marketing, integrated team connections with lenders, inspectors, contractors and other real estate specialist, Johnny can assist any buyer or seller. Johnny will give a personalized relationship with every client, from contract to close. So why would Johnny be a good agent for your real estate needs? His attention to the heart of every client. Traveling extensively over the past 30 years, Johnny is able to adapt to every situation and serve them uniquely as if they are his only concern. Listening is a lost art in modern culture. If we can listen to the heart and hope of every client, we can properly assist them in a smooth, efficient and hopefully, an enjoyable process for all of their real estate needs. Johnny has proven through these past 30 years of leadership training and professional networking that drive, determination and a \"whatever it takes\" mindset is indeed the answer. Johnny will assist every client with a professional and passionate process in serving their needs. Life experience, life passion and a love for people…..from my heart to your home. This is what agent Johnny Jernigan wants to share with you. Please call Johnny Jernigan at 251-622-0251 or email at: JohnnyJernigan@RobertsBrothers.com", "name": "Johnny Jernigan", "website": "https://johnnyjernigan.robertsbrothers.com/", "agent_phone_numbers": "251-622-0251", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/shawnjenkins", "description": "About Shawn Jenkins Shawn Jenkins is energetic and full of life she loves this dream she gets to live on our beautiful Gulf Coast. Southern Alabama has always been her home, and she has a deep love for all this area has to offer. She is involved in everything this area has to offer from the beautiful old oaks with our Mardi Gras traditions to our coastal waters and warm beaches. After raising her family, she now loves spending time with her grandchildren and seeing them experience everything our area has to offer. She has worked with her husband Jake in the landscape and contract business for many Years and has a lot of knowledge on the uniqueness of each area. She is highly excited and motivated to help you find the area that will fulfill your dreams Roberts Brothers has served the Gulf Coast for 75 years and has the highest listings and sales in our area. She is proud to be a part of the Roberts Brothers family and their abundance of knowledge and commitment to excellence. Shawn is committed to giving her clients an experience of a lifetime with the utmost professionalism and care. Give Shawn a call and let her help you in this community we know as family. “The secret to selling is to sell what you believe in “Frank Bettger”", "name": "Shawn Jenkins", "website": "https://shawnjenkins.robertsbrothers.com/", "agent_phone_numbers": "251-656-4434", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/vivianjackson", "description": "About Vivian Jackson When I was young, my father brought our family from Memphis, Tennessee to Atlanta, Georgia to pursue a career with Delta Airlines. I was originally licensed as a Georgia Real Estate agent in 1979. For the last twenty two years I was licensed in Atlanta with Metro Brokers Better Homes and Gardens. I am happy to now be in Alabama and with Roberts Brothers, Inc. I received a diploma in Interior Design at Lanier Technical College and became an ASP Accredited Stagging Professional. My husband and I recently relocated from Atlanta to Foley to be surrounded by water and beaches. Please let me aide you in staging your home and listing it for sale on the market or show you one of the many beautiful properties available here.", "name": "Vivian Jackson", "website": "https://vivianjackson.robertsbrothers.com/", "agent_phone_numbers": "4044023980", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/maddyireland", "description": "About Maddy Ireland Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Maddy Ireland", "website": "https://maddyireland.robertsbrothers.com/", "agent_phone_numbers": "251-398-0098", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/kristihunter", "description": "About Kristi Hunter Your Goal is My Goal I am originally from Wyoming where I met and married my husband who was in the Air Force for 21 years. Throughout those 21 years we lived in Arkansas, California, the Philippines, and Germany. We did extensive travelling everywhere we went. We enjoyed learning new cultures and getting to know the many types of people and their customs everywhere we went. Being in the military was a great experience for our family. We had our son in Germany and later adopted our daughter from China. We moved to Mobile after retiring from the Air Force and have lived here for almost 20 years. From moving so much, I have learned to communicate with many types of people and cultures and made lots of friends along the way. I now incorporate that into my business by getting know my clients and what is important to them. My goal as a Realtor, is to help my customers with their goal of either buying or selling a home. I understand this is one of the biggest investments people make in their lives. Therefore, I strive for excellent commuication so I can help them achieve their goal. Also, important to me is to build a friendship with all my clients that go beyond the real estate transaction. Real Estate for me, is a tool for helping others and building new relationships. I also am the Administrator for the Academy of Real Estate at Roberts Brothers. I get to help new students with the process of becoming a Realtor. Again, helping people achieve their dream of becoming a Realtor is truly satisfying. In my free time, we still love to travel and spend time together with family and friends. We enjoy doing many activities from board games to disc golf to going to the mountains and amusement parks. We also enjoy our church helping in different ways there. Client Testimonial \"Kristi Hunter was always available to assist with any questions and concerns. Her customer service and knowledgeable expertise was invaluable in purchasing our new home. She provided additional information due to our move to AL from out of state and gave helpful insight and resources to make the transition an easy one. Kristi is the realtor you want to use for sure!\" -Sandra \"Kristi Huter made my home buying process as stress free and fun as possible. It was my first home and she told me and showed me everything I needed to know. She is a very honest and amazing real estate agent and I would always and currently do recommend her to anyone wanting to sell or buy a home.\" Kacey", "name": "Kristi Hunter", "website": "https://kristihunter.robertsbrothers.com/", "agent_phone_numbers": "251-802-7576", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/dianehunter", "description": "About Diane Hunter Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Diane Hunter", "website": "https://dianehunter.robertsbrothers.com/", "agent_phone_numbers": "504-913-5392", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/nancyhughes", "description": "About More information about me. Its All About You... We are all unique and each of us will approach buying or selling a home in our own way. As a Full Time Realtor for over 20 years I enjoy working to make your Real Estate experience easy and comfortable for you! I enjoy delivering specialized service that caters to your lifestyle and decision making. I am available days, nights and weekends to work around your schedule so lets talk about it! Give me a call! I am here for you! Nancy Hughes 251-605-0179 NancyHughes@RobertsBrothers.com About Me... I am a full-time REALTOR in Mobile since 2003. I work for the leading/largest Real Estate Companies in South Alabama. Served on the Executive Board of Directors of Mobile Area Association of REALTORS. Served on the Community Relations Committee of Mobile Area Association of REALTORS Serves on the Board of Directors of Family Promise. I love spending time with my family, friends, photography, and volunteering.", "name": "Nancy Hughes", "website": "https://nancyhughes.robertsbrothers.com/", "agent_phone_numbers": "251-605-0179", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "559 North Section St. Fairhope AL 36532", "profile_url": "https://www.robertsbrothers.com/bio/dianehorst", "description": "About Diane Horst I have been a Realtor in Mobile and Baldwin Counties since 1996, specializing in Eastern Shore, South Baldwin resort and historic properties. I have a ABR designation and am a member of The Council of Risidential Specialists. My greatest compliment is repeat business and referrals from past clients. My formal educaton is in design. Over the past 35 years, I have, and continue to, serve on numerous civic and historic preservation boards, locally and in Northern Virginia. I am a lifelong member of St. Pauls Episcopal Church, Mobile, AL.", "name": "Diane Horst", "website": "https://dianehorst.robertsbrothers.com/", "agent_phone_numbers": "251-490-7644", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/rachelhodges", "description": "About Rachel Hodges After holding a real estate license in her home state of Connecticut for several years and gaining experience across multiple facets of the industry, Rachel and her husband made the move to the beautiful Mobile area in 2022.Rachel recently joined Roberts Brothers, a well-respected company that serves all the local counties and is known for its exceptional support. In fact, Roberts Brothers played a key role in helping her and her family relocate from Connecticut to Alabama, making the transition a smooth and positive experience.Now, Rachel is eager to help buyers and sellers navigate the real estate market in Mobile and the surrounding communities. With a passion for real estate and a deep appreciation for the Gulf Coast lifestyle, Rachel is excited about this new chapter both personally and professionally.In her free time, Rachel enjoys baking, visiting farmers markets, reading, gardening, spending time with her family—including her dogs and chickens—meeting new people, and exploring everything this vibrant community has to offer.", "name": "Rachel Hodges", "website": "https://rachelhodges.robertsbrothers.com/", "agent_phone_numbers": "860-822-3514", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/billhinton", "description": "About Bill Hinton Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Bill Hinton", "website": "https://billhinton.robertsbrothers.com/", "agent_phone_numbers": "251-454-5830", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/emilyhatcher", "description": "About Emily Hatcher As a lifelong resident of Mobile I know what makes Southwest Alabama, and especially Mobile and Baldwin Counties such a uniquely special place to live. I have developed a great knowledge of neighborhoods, public spaces and cultural events throughout Mobile and use that in helping my clients to find not only the best home, but the perfect place to put down roots and build friendships. After graduating the University of Mobile with a bachelor's degree in Phycology, with a History minor, I spent three years with the Mobile Area Chamber of Commerce working in Membership Development. I became interested in real estate through local business associates. I joined the Robert's Brothers Team in August of 2020 with a multi-million-dollar sales year. My greatest joy in real estate is to help someone find a place to call their own; a place that fulfills all the desires they mentioned in our first conversation. I am a member of the local, state and national Association of Realtors, and an Ambassador for the Mobile Area Chamber of Commerce. I am continuing to develop my knowledge and understanding of real estate as I am currently working on my Brokers License. My husband Ray and I have four children, and when they are not involved in various team sports, we enjoy travel and the beach. We are members of South Coast Church in Mobile.", "name": "Emily Hatcher", "website": "https://emilyhatcher.robertsbrothers.com/", "agent_phone_numbers": "251-487-0198", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/richardharski", "description": "About Richard Harski With over 16 years of experience, Richard has made his mark on the real estate industry. \"Let's Get Moving\" is his mantra-and shows in the results of his energetic business style and strong work ethic. Consistently in the top 10 % company-wide, Richard recently started his own real estate team, offering his clients next level service. A native Mobilian, Richard earned his degree in Business Administration from Auburn University. His grandfather was a real estate investor, and having the opportunity to watch him was an inspiration to Richard. Although he began his career in the banking industry, Richard found his calling in real estate in 2011. In 2014, he joined Roberts Brothers. Richard enjoys giving back to his community as an active volunteer and financial supporter of the many incredible hospitals along the Gulf Coast. He and his wife often give to and attend charitable events at USA Health Children's and Women's Hospital and The Mitchell Cancer Center and University Hospital. Married for 15 years, Richard and his wife, Nichole, have 8-year-old twins, George and Camile and their white lab named Daisy. They live in Mobile, AL. When he's not listing and selling real estate, Richard enjoys boating on the beautiful waterways of coastal Alabama and taking advantage of observing the plentiful wildlife in Mobile's timberlands.", "name": "Richard Harski", "website": "https://richardharski.robertsbrothers.com/", "agent_phone_numbers": "251-423-7830", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/erinfowler", "description": "About Erin Fowler Erin has always felt incredible blessed to call Real Estate her passion. She doesn’t just love it. She breathes it.With over two decades in the real estate industry, she serves as an experienced leader, educator, and go-to expert in Relocation. A real estate professional since 2001, Erin holds a license in three states: Mississippi, Alabama, and California. Her family transferred to the West Coast and then back to the Mississippi Gulf Coast in 2018. She has served as a dedicated leader in her community, including many years with the Alabama State Chapter Women's Council of REALTORS.As a Certified Relocation Specialist, she has mastered the process of buyer and seller transferee packages provided by employers and the conditions that need to be fulfilled to maintain those benefits. High Standard Service is at the forefront of everything she does, and the personal connection she creates with her buyers and sellers extends beyond the closing process. Whether it be helping her buyers get acclimated to their new communities or assisting her sellers in choosing a trusted realtor in their new location, Erin is a dedicated professional from start to finish.Her family has always been her biggest support. She and her husband, David, have been married for 34 years and have two sons. Her older son Andrew and his wife, Amanda, have a daughter, Caroline. Luke, her younger son, is married to Jordan. In her free time, she loves traveling, spending time with her granddaughter, Caroline and relaxing with her Cavalier King Charles, Bella Rose.", "name": "Erin Fowler", "website": "https://erinfowler.robertsbrothers.com/", "agent_phone_numbers": "251-510-2645", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/duncancrow", "description": "About Duncan Crow Duncan’s extensive background and deep-rooted connection to Alabama make him a valuable asset in the real estate market. With nearly forty years of legal experience, he brings a wealth of knowledge to his real estate practice, ensuring that both buyers and sellers are well-informed and supported throughout their transactions. A father of three sons, Duncan’s commitment to family and community shines through in his professional dealings. His active involvement in church and civic life reflects his dedication to service, and his musical talents—performing in local bands and participating in community theater—demonstrate his creative side and ability to connect with others. Understanding the often-overwhelming nature of buying and selling homes, Duncan prioritizes a smooth and stress-free experience for his clients. He empathizes with first-time homebuyers and aims to demystify the process, fostering an environment of trust and transparency. For sellers, he recognizes the pride and emotional investment they have in their homes, and he works diligently to ensure their property is valued appropriately, helping them to maximize their return on investment. With his combination of legal expertise, passion for real estate, and commitment to community, Duncan is well-equipped to guide his clients through the intricacies of the real estate market with professionalism and care.", "name": "Duncan Crow", "website": "https://duncancrow.robertsbrothers.com/", "agent_phone_numbers": "(251) 554-9546", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "900 Bienville Blvd. Dauphin Island AL 36528", "profile_url": "https://www.robertsbrothers.com/bio/genefox", "description": "About Gene Fox Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Gene Fox", "website": "https://genefox.robertsbrothers.com/", "agent_phone_numbers": "251-370-8150", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/hopebrown", "description": "About Hope Brown Hope Sessions Brown has been in the real estate industry for over 20 years, providing quality service and creating lasting relationships with her clients. Her extensive background in finance has allowed her to close nearly 2 million in her first full year of selling real estate in Mobile, earning her the Rookie of the Year award for the Roberts Brothers West office in 2015. She has since been a multiple million dollar producer every year. After living in Florida when she started her family, Hope returned to Mobile with a new appreciation of life on the Gulf Coast and is dedicated to giving back to her community. She is always looking for ways to help her clients and build relationships old and new to Mobile. She is able to provide knowledge and expertise in both the sale of million dollar estate properties, to more rural areas with a more modest way of life. Her love for family and passion for cooking and gardening keep her grounded in the fast paced and growing city of Mobile. Client reviews of Hopes work speak for themselves: \"Hope is not only an experienced, capable, and reliable agent, she is also one of the most caring and positive people you will ever meet. Hope help me buy a home when I had given up. My experience with her was so wonderful that when I decided to buy my next home, she was the first person that came to mind. Now Im living in my dream home thanks to the expertise of Hope...I can not recommend her enough. I tell everyone I know to go see her first thing! I was in my new home in less than a month from the time I first went to see it.\" - April R. \"Hope is excellent at what she does! She is extremely knowledgeable about the market and worked hard for us...she gave great support and understanding through one of the biggest moments of my life.\" -Stephanie M. \"My husband and I would gladly work with Hope again and would highly recommend her to anyone looking to get their home sold.\" - Stephanie D. \"Hope Brown was amazing! I told her what I was looking for and she found it. She didnt try to talk me out of anything I wanted or push any house on me. She was amazing!\" - Matt K.", "name": "Hope Brown", "website": "https://hopebrown.robertsbrothers.com/", "agent_phone_numbers": "251-463-4304", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/hopebrooks", "description": "About Hope Brooks My husband and I moved with our family to the Malbis area in 2001 and quickly fell in love with its charm. With access to some of our county's best schools and Alabama's gorgeous beaches so near it has been the perfect place to raise our girls. Our family continued to grow and we now have 4 beautiful daughters, a son-in-law and 2 grandsons whom we adore.I am dedicated to providing you with an exceptional experience and vow to work tirelessly to hear your dreams and make them a reality. Allow me to list your home and get the most return with the least stress on you or lets find a house to make your home! I look forward to helping you with all your real estate needs.Now serving a third generation of customers, Roberts Brothers, Inc. has over 300 sales associates staff in five branch offices covering the residential and rental markets in Mobile and Baldwin County, Alabama. Roberts Brothers is the leading Real Estate company in South Alabama and has offered superior service to its clients and customers for over 75 years. My husband and I moved with our family to the Malbis area in 2001 and quickly fell in love with its charm. With access to some of our county's best schools and Alabama's gorgeous beaches so near it has been the perfect place to raise our girls. Our family continued to grow and we now have 4 beautiful daughters, a son-in-law and a grandson whom we adore. I am dedicated to providing you with an exceptional experience and vow to work tirelessly to hear your dreams and make them a reality. Lets find a house to make your home! Let me help you with all your real estate needs. Now serving a third generation of customers, Roberts Brothers, Inc. has over 300 sales associates staff in five branch offices covering the residential and rental markets in Mobile and Baldwin County, Alabama. Roberts Brothers is the leading Real Estate company in South Alabama and has offered superior service to its clients and customers for over 75 years.", "name": "Hope Brooks", "website": "https://hopebrooks.robertsbrothers.com/", "agent_phone_numbers": "251-605-9582", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/AlicenBrizendine", "description": "About Alicen Brizendine Throughout her life as a military child, Alicen has lived in over ten different places from South Texas to Puerto Rico and everywhere in between, which she attributes to her genuine love for people and her desire to help in any way possible.She was afforded the opportunity to compete as an NCAA Division One athlete, which instilled in her keen time management and organizational skill sets that she is confident are beneficial to you as your agent.Alicen is a Faith Academy graduate. Following her high school graduation, she moved to Mississippi to attend the University of Southern Mississippi, where she was a golfer for two years. After her sophomore year, she married her husband Matthew, and began following him around with his Coast Guard career.After a couple of transfers, Alicen graduated from Georgia Southern University, having earned a BBA with a major in Marketing. She is also a University of Southern Mississippi grad, where she earned her Masters in Business Administration.Her first job out of college was a Listing Coordinator / Marketing Manager for a Real Estate Agent in Savannah, Georgia. She knew from that moment, that her heart belonged in real estate.Alicen and her family have planted roots in Mobile, following her husband completing his military service and transition to Airbus. They have three children, Nora, Brooks, and Holden and also two rescue dogs, Duke and Ranger.She is an active member in her church, West Mobile Baptist Church, the Mobile Jaycees, the secretary for her HOA, and enjoys volunteering with various organizations, such as Ransom Ministries.She loves everything about Gulf Coast life and can’t wait to help you find that feeling of being home in being here as well!", "name": "Alicen Brizendine", "website": "https://alicenbrizendine.robertsbrothers.com/", "agent_phone_numbers": "361-765-4628", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/toribritt", "description": "About Me: I am knowledgeable about Mobile County (having lived here for 40 years) I have more than 15 years experience in sales. I have also worked in the legal field for 15 years, I know that cient relationships are very important. I have dealt with sensitive and confidential information as well. I love helping a client/customer with this process. Whether it is curb appeal, to staging the interior of a home. I have great ideas to share with my clients/customers to spruce up their home for a sale. I am always available and committed to providing great service. I enjoy meeting my clients & learning all about them and how I can meet there needs. I am an honest, hardworking and reliable with an upbeat personality and great communication skills I am a member of the local, state and national Association of Realtors. I am on the Committee for the Governmental Affairs and Community Relations within the Association of Realtors. I am involved in the Mobile Area Chamber of Commerce Young Professionals and also part of the Roberts Brothers Young Professionals. I am continuing to develop my knowledge and understanding of real estate.", "name": "Tori Britt", "website": "https://toribritt.robertsbrothers.com/", "agent_phone_numbers": "251-721-7103", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/annbraswell", "description": "About Ann Braswell \"Always deliver more than expected\" Larry Page Co-Founder of Google Ann is a native of Mobile and moved to the Eastern Shore in 2003 and then to the Gulf Coast in 2017. After raising children and owning and operating a restaurant, Ann decided to delve into the world of Real Estate. Ann is a multi-million dollar producer and is known for her local knowledge of condos and investment property along the Gulf Coast of Alabama as well as Florida. She possesses excellent communication skills, integrity and a passion for helping people. Whether you are buying or selling, in either Alabama or Florida, Ann understands the process can be challenging and complicated. She focuses on taking the pressure off of you, so you can make clear and concise decisions throughout the process. Ann gives the utmost care and dedication to all of her clients and is committed to giving them an exceptional experience. Roberts Brothers has served the Mobile and Baldwin County area for over 75 years and their core values of professionalism, commitment to excellence and integrity reflect Ann's own. Roberts Brothers currently has the highest number of sales and listings in the area and Ann knows that her clients will benefit from Roberts Brothers wealth of knowledge, expertise and undisputed formula for success. Give Ann a call and let her help YOU with all your real estate needs! 251-623-0561", "name": "Ann Braswell", "website": "https://annbraswell.robertsbrothers.com/", "agent_phone_numbers": "251-623-0561", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/juliebrannon", "description": "About Julie Brannon Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Julie Brannon", "website": "https://juliebrannon.robertsbrothers.com/", "agent_phone_numbers": "251-680-1281", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/shaibrandon", "description": "About Shai Brandon Sha-Jeariann (Shai) Brandon believes that great work starts with purpose and ends with impact. Shai brings over 20 years of experience in customer service and hospitality to the world of real estate — where care, clarity, and exceptional service truly matter. Shai blends dedication with professionalism to deliver a smooth, informed, one-of-a-kind and successful experience for every client- whether you’re a first-time homebuyer navigating your very first purchase or a luxury client seeking a tailored, high-level approach. She’s known for her warm spirit, nurturing nature, sharp eye for detail, and the ability to turn vision into reality. For Shai, it’s not just about closing deals — it’s about building trust, creating meaningful connections, and ensuring that every client feels empowered at every step of the way. She knows that the little things make the biggest difference, and she treats each transaction with the heart and precision it deserves. Outside of real estate, you’ll find Shai serving her community through church events or personal incentives and leading the 40+ Double Dutch Club for women in the Mobile Southern Region — a movement that empowers women through connection and movement. She also enjoys traveling and spending time with her family, values that keep her grounded and deeply connected to the people she serves.", "name": "Shai Brandon", "website": "https://shaibrandon.robertsbrothers.com/", "agent_phone_numbers": "2515133775", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/colleenbowen", "description": "About Colleen Bowen I was born and raised right here on the Gulf Coast. I attended Saint Paul's Episcopal High School and Spring Hill College. I grew up around my father's property management company and, upon finishing school, worked there for fourteen years as a dedicated leasing agent. I learned a variety of skills in the real estate field being in charge of property inspections, dealing with contractors, vendors, and of course-paperwork! I greatly enjoy helping people find a place to call home and helping them in the process of achieving this goal. My goals are to work hard, be determined, dedicated, loyal, and to be there every step of the way in meeting my client's needs.", "name": "Colleen Bowen", "website": "https://colleenbowen.robertsbrothers.com/", "agent_phone_numbers": "251-377-7472", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/janetboullemetukangsin", "description": "About Janet BoullemetUkangsin Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Janet BoullemetUkangsin", "website": "https://janetboullemetukangsin.robertsbrothers.com/", "agent_phone_numbers": "251-533-8050", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/SomerlynBouler", "description": "About Somerlyn Bouler Somerlyn Bouler is a Mobile County native, born and raised in Semmes, Alabama. She attended Faith Academy and went on to receive a Human Resources degree from the University of South Alabama. Starting out as a Realtors Assistant, Somerlyn developed a love for the Real Estate industry. Now, having earned her real estate license and using her business management background, Somerlyn is excited to guide her buyers and sellers through the home buying and selling process with excellent service, patience and professionalism. Somerlyn loves the gulf coast and is excited to welcome new and returning clients to the area. If you are looking for a new place to call home, Somerlyn is ready to help you make your move!", "name": "Somerlyn Bouler", "website": "https://somerlynbouler.robertsbrothers.com/", "agent_phone_numbers": "251-472-6808", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/jameebooth", "description": "About Jamee Booth Jamee has been a resident of Mobile since 1989. She is a family oriented woman with a devotion to God, her husband Dennis and her children. Jamee has two sons, Seth (19), a proud member of the US Navy, and Brannon (15), a student of Mary G. Montgomery High School. She also has one stepson Conner (22), a Mechanical Engineering student at Baker College in Detroit, MI. Jamee was a hygeinist for 14 years before embarking on her real estate career which gave her the unique ability to work with all types of personalities and to form an enduring bond with the people she serves. Jamee is committed to finding the home that suits your needs with hard work, dedication, and loyalty. Let Jamee help you find the home of your dreams, where you can create memories that will last a lifetime.", "name": "Jamee Booth", "website": "https://jameebooth.robertsbrothers.com/", "agent_phone_numbers": "251-402-3499", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/butchblum", "description": "About Butch Blum Top 10 Reasons I'm the Real Estate Agent for You! 1. I have over 52 years of experience in the Mobile business community. 2. I know the neighborhoods, schools, market conditions, zoning regulations and local economy. I can help you with properties in both Mobile and Baldwin counties, including the Eastern Shore and Gulf Shores. 3. I'll do the leg work, keeping you up-to-date with new listings and conditions as they impact the market. 4. I'm a full-time real estate agent - anything less and you'd be short changed. 5. I'll use my connections throughout the mortgage industry to get you the best deals possible. 6. You'll be my client (I will represent you) in the real estate transaction. 7. I'll guide you through the complexities of buying and/or selling a house, eliminating hassles and stress. I will keep you informed every step of the way. 8. As a standard business practice I preview homes as they become available, keeping you apprised of market conditions as they evolve. 9. I won't waste your time - when an offer is made, I'll require acceptance or a counter offer within 24 to 48 hours. 10. You'll have the advantage of personal, one-on-one attention, as well as my dynamic web and e-mail resources. Let's get together to talk about your home buying and/or selling plans. Call me at the office (251-661-4660) or on my cell phone (251-583-3042) or send me an e-mail(ButchBlum@RobertsBrothers.com), we'll set-up a time to meet that is easy and convenient for you. Butch Blum", "name": "Butch Blum", "website": "https://butchblum.robertsbrothers.com/", "agent_phone_numbers": "251-583-3042", "country": "US"}
{"title": "Associate Broker - REALTOR", "address": "559 North Section St. Fairhope AL 36532", "profile_url": "https://www.robertsbrothers.com/bio/katblosser", "description": "About Kat Blosser Everyone needs an oasis. Your home is your comfort zone, and it should be a place you genuinely love, no matter where that address falls on the map. Becoming a REALTOR was the perfect opportunity for me to do something I love while connecting with people and helping them reach their goals. I began my real estate career at Roberts Brothers in 2014 and earned my brokers' license in 2018. In 2020 I became a certified instructor for The Academy of Real Estate where I am in charge of their online school. I also teach real estate classes in person, which I really enjoy. Between buying and selling real estate and teaching, I absolutely love what I do! The process of searching for a home and making a big move can be daunting; it's one of the biggest investments you will ever make. Selling your home can be a rollercoaster of emotions and having a trusted advocate to guide you is so important. I know first-hand the joys and challenges involved, which allows me to identify with your needs and concerns. My husband and I have lived in many places: San Antonio, Dubai, Copenhagen, Singapore, Perth, Houston and Kuala Lumpur. (That's a lot of moving boxes!) Despite having seen so many unique and inspiring places around the world, we knew our forever home was the place my husband was raised, on the beautiful Eastern Shore of Alabama. This vibrant and charming community has it all, and we couldn't love it more. The sunsets are some of the best on earth, but even more wonderful are the friends and family that make it home. And did I mention our favorite 4-legged friend? We have a wonderful rescue dog named Bud who is living his best life here. He keeps us smiling. Whether you are moving next door or thousands of miles away to a new country, I am your best resources for making it a great experience you can feel confident about. Call me today and let's get started!", "name": "Kat Blosser", "website": "https://katblosser.robertsbrothers.com/", "agent_phone_numbers": "251-509-4555", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/harrisonbixler", "description": "About Joining Roberts Brothers in 2020, Harrison quickly gained a reputation for providing exceptional service to his clients and has been unstoppable ever since. Harrison has extensive knowledge of the local real estate market and is skilled in negotiations, marketing, and sales. He uses the most technically advanced tools in the industry, keeping his clients ahead of the curve and informed. Harrison’s number one goal is to provide his clients personalized service and support them every step of the way. A graduate of Auburn University, Harrison has a Bachelor of Science degree in Hotel and Restaurant Management with a minor in Business. He spent many years in the restaurant management field in Birmingham, Nashville, and New Orleans. He has also been a Project Manager for multiple software application companies. Harrison is a graduate of Mobile United Leadership Class of 2023 and a volunteer with Fuse Project, which focus on bringing together local projects for children. Outside of work, you can find Harrison spending time with his family on the water, fishing, and boating. He's a grill/smoker enthusiast and enjoys hosting crawfish boils. He and his wife, Quin, live in Mobile with their three children.", "name": "Harrison Bixler", "website": "https://harrisonbixler.robertsbrothers.com/", "agent_phone_numbers": "205-516-8827", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/timbates", "description": "About Tim Bates Welcome! My name is Tim Bates, and I am not only a real estate professional but also a proud husband and father of two wonderful children. Above all, I am a devoted Christ follower, and I strive to approach every aspect of my life, including my work, with integrity, honesty, and compassion. Real estate has been my steadfast passion for over a decade, and I am thrilled to have the opportunity to help individuals and families like yours navigate the exciting world of buying or selling property. As a seasoned property investor, I have firsthand experience with the ins and outs of the market, and I am here to share my knowledge and expertise with you. My goal is not just to complete a transaction, but to create lasting relationships built on trust and mutual understanding. I understand that buying or selling a home is one of the most significant financial decisions you will make, and I am honored to be a part of that journey with you. When you choose to work with me, expect nothing less than exceptional service, personalized attention, and a commitment to your best interests. I will guide you through each step of the process, taking the time to listen to your needs and navigate any challenges that may arise. So, whether you're a first-time homebuyer, a seasoned investor, or looking to sell your property, I am here to help. Let's embark on this exciting real estate journey together, and together, we will achieve your goals. It would be an absolute honor to work with you", "name": "Tim Bates", "website": "https://timbates.robertsbrothers.com/", "agent_phone_numbers": "251-769-3476", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/robbarr", "description": "About Rob Barr Your Go-To Guy for Coastal Alabama Real Estate. A licensed REALTOR with 14 years of marketing experience. An in the loop go-getter with expert knowledge of Mobile Baldwin Counties including, but not limited to: Daphne, Fairhope, Spanish Fort, Mobile, Saraland, Bay Minette, Robertsdale, Foley, Gulf Shores, Orange Beach. Selling: I will work with you to get the best price, in the least amount of time. I will help you get your home ready to sell. I know what buyers are looking for, what they expect, and what gives them the warm fuzzy feelings that turn into offers. Ive even had a listing featured on HGTV. Buying: I will help you find the perfect place. Whatever you are looking for, I can find things that you wont see searching online. If you let me help you, you will be one the first to know when your dream home hits the market. About me: My wife Keri and I (both native Alabamians) live in Spanish Fort with our daughter Sara Grace, our dog Lizzie, some cats, and an ever-growing family of other creatures. Sara Grace enjoys school and playing with her friends in our neighborhood. We moved back to Alabama from Meridian, Mississippi. We miss Meridian and the wonderful friends we made there, but we know that moving to Baldwin County was the best decision we have ever made. We enjoy spending time outdoors, eating fantastic seafood, and taking day trips to the beach. We feel like we are on permanent vacation.", "name": "Rob Barr", "website": "https://robbarr.robertsbrothers.com/", "agent_phone_numbers": "251-581-4030", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "559 North Section St. Fairhope AL 36532", "profile_url": "https://www.robertsbrothers.com/bio/emilybarber", "description": "About Emily Barber As a dedicated and passionate real estate agent with Roberts Brothers, Emily prides herself on delivering exceptional service and achieving outstanding results for her clients. Whether you are a first-time homebuyer, looking to sell your property, or a buyer exploring the area from afar, she will be there to guide you every step of the way! Emily’s approach is built on integrity, transparency, and a genuine desire to meet her clients' needs. She utilizes the latest technology and marketing strategies to ensure your property is showcased effectively, or that you find the perfect home that meets your lifestyle and budget. When she is not assisting clients, you can find her spending time with her husband and two children. Emily believes that the Eastern Shore is a wonderful place to call home, with its history, charm, and spectacular views! She would love to work with you to make your real estate dreams come true!", "name": "Emily Barber", "website": "https://emilybarber.robertsbrothers.com/", "agent_phone_numbers": "865-454-4240", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/natalyabaranyuk", "description": "About Natalya Baranyuk is a dedicated and knowledgeable real estate professional with a passion for helping buyers find their dream homes. Nothing excites her more than seeing the joy on a client’s face when they step into the perfect property. Whether working with buyers or sellers, she is committed to making the process smooth, stress-free, and rewarding.Fluent in English, Russian, and Ukrainian, Natalya is able to connect with a diverse range of clients, ensuring clear communication and a seamless experience. With a Diamond Excellence Certification for completing both buyer and seller certification classes, she brings expert-level knowledge and top-tier service to every transaction.Known for market expertise, strong negotiation skills, and a client-first approach, Natalya is dedicated to guiding buyers and sellers through every step of their real estate journey. What sets Natalya apart is her unwavering loyalty to her clients – she is dedicated to their success and works tirelessly to ensure they get the best possible outcome. Known for her honesty and integrity, she believes in open communication and always puts her clients’ best interests first. At the same time, she brings a fun and energetic approach to real estate, making the process enjoyable and stress-free.Beyond real estate, Natalya is a proud parent of five children, which has strengthened her ability to multitask, stay organized, and understand the importance of finding the right home for every stage of life. With a deep commitment to helping families and individuals navigate the market, she is dedicated to guiding clients through every step of their real estate journey with care and professionalism. Whether buying, selling, or investing, clients can trust Natalya to provide expert guidance and exceptional service.", "name": "Natalya Baranyuk", "website": "https://natalyabaranyuk.robertsbrothers.com/", "agent_phone_numbers": "251-230-1209", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/jeanettebaldwin", "description": "About Jeanette Baldwin Meet Jeanette Baldwin, a passionate real estate agent serving Mobile County, Alabama, with a special focus on first-time homebuyers. Licensed in November 2024, Jeanette combines over 12 years of experience in customer service, business management, and marketing to provide exceptional guidance to her clients through the home buying and selling process. Jeanette’s passion for helping others extends beyond the business world. She is deeply committed to empowering low-income families and individuals, helping them achieve personal success and growth. Her goal is simple: to make the home buying and selling process as easy and stress-free as possible, being there for her clients every step of the way.What drew Jeanette to real estate was the desire for a career that offers the financial freedom to support her family while still being present in their lives. As a mother to one daughter—who is her world—she understands the importance of work-life balance and strives to create that same sense of balance for her clients.When she's not helping clients find their dream homes, Jeanette enjoys traveling, baking, reading, swimming, and spending quality time with family and friends. A fun fact about Jeanette: she majored in Spanish, which allows her to assist non-English-speaking clients, ensuring everyone feels heard and understood.Jeanette chose to join Roberts Brothers because of their reputation for being a family-oriented company that supports agents in building their businesses from the ground up. She knew Roberts Brothers would treat her as more than just a number, and she is excited to bring her skills, passion, and commitment to the team.", "name": "Jeanette Baldwin", "website": "https://jeanettebaldwin.robertsbrothers.com/", "agent_phone_numbers": "251-408-2213", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/terribaker", "description": "About Terri Baker My nest is nearly empty and I am ready for life’s next adventure and doing what I enjoy. People, projects and property are among the things that I love. This year I have joined the Roberts Brothers team and am a licensed realtor! Bill and I are Mobile natives, graduating from Theodore High and Bill attended University of Mobile. We have three incredible children. Our family has been involved in our community, leading basketball for a community team for high school guys, working with various addiction recovery outreaches, and storm relief teams. We serve with our church family at OPC, teaching Sunday School and working with our Youth department. Just for fun, I have always looked at homes that were for sale in the Mobile area and helped friends and family find a home that was perfect for them. Last year I took on a “flip house” and loved the flip so much that we moved into it. I love renovating, decorating and turning the old and ordinary into something magical. Before starting a family I was a travel agent for many years. I worked in corporate travel and helped plan business trips. Later, I worked as a wedding planner helping couples creating their dream wedding. Now, I would like to help families find their dream home! There is something here in Mobile and on our Gulf Coast for everyone! So, if you are just starting your nest, a new business, or downsizing because of an empty nest, let me help you find a place that you will love, while getting the most for your money!", "name": "Terri Baker", "website": "https://terribaker.robertsbrothers.com/", "agent_phone_numbers": "251-786-0337", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/brentbaker", "description": "About Brent Baker Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Brent Baker", "website": "https://brentbaker.robertsbrothers.com/", "agent_phone_numbers": "251-472-5801", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "559 North Section St. Fairhope AL 36532", "profile_url": "https://www.robertsbrothers.com/bio/jessicabailey", "description": "About Jessica Bailey Jessica Bailey is an experienced Realtor with a deep connection to the Mobile Bay area and Gulf Coast region She has helped buyers and sellers navigate all types of properties and situations, from distressed homes to luxury estates. Jessica's knowledge of the area and her ability to adapt quickly have been critical in helping clients during the pandemic. She has learned to pivot and adjust to the ever-changing landscape, ensuring that her clients receive the best possible service. In addition to her experience and adaptability, Jessica is passionate about educating herself and others in and out of the real estate industry. Jessica is supported by a team of professionals at Robert Brothers who share her dedication to providing exceptional service to clients. Together, they have the expertise and resources to help you with all your real estate needs. When she's not working, Jessica is an avid sailing enthusiast and a devoted mother to her children, Grayson and Abby. She values her connections with family and friends deeply and enjoys spending time with them whenever possible. If you're looking for a Realtor who knows the Mobile Bay area and Gulf Coast region inside and out, and can help you navigate any real estate situation, Jessica and the team at Robert Brothers are here to assist you.", "name": "Jessica Bailey", "website": "https://jessicabailey.robertsbrothers.com/", "agent_phone_numbers": "251-979-6588", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/kylebaggett", "description": "About Kyle Baggett Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Kyle Baggett", "website": "https://kylebaggett.robertsbrothers.com/", "agent_phone_numbers": "843-437-6291", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/annebaggett", "description": "About With over fifteen years of experience as a nurse, and a thirty-year career as a real estate professional, Anne Baggett has dedicated her life to serving people with compassion.Born and raised in Mobile, Anne spent her summers on Mobile Bay, giving her a very special connection to the Gulf Coast and everything that makes it unique. She graduated from Convent of Mercy High School, attended Spring Hill College and graduated from Providence School of Nursing. After graduation, she worked for fifteen years as a Recovery Room Nurse, giving her extensive knowledge on what it means to truly serve others.With a growing family, she took on a new career as a real estate professional, which allowed her to serve others, create lasting relationships, and still have time for family and community service. Her goal is to give tireless service and a happy home hunting/selling experience to her clients. As a top agent with over thirty years in real estate, she has truly found \"HOME\".Deeply committed to serving her community, Anne serves on the Advisory Board of Catholic Social Services, Archdiocesan Council of Catholic Women, a member of the Toy Bowl Board Youth Athletics Committee, a volunteer with Little Sisters of the Poor, and a Member of JDRF.Anne serves on the Advisory Board Roberts Brothers Charitable Fund (Legacy for Lost Children), is a Member of Mobile Chamber of Commerce, and Runner-up “Realtor of the Year” Nappies Award in 2011.A proud mother and grandmother, she loves staying involved in her grandchildren’s many activities.", "name": "Anne Baggett", "website": "https://annebaggett.robertsbrothers.com/", "agent_phone_numbers": "251-423-5128", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "3601 Spring Hill Business Park Ste 101 Mobile AL 36608", "profile_url": "https://www.robertsbrothers.com/bio/michelleautio", "description": "About Michelle Autio Michelle was born and raised here in beautiful Mobile. She is a graduate of St. Pauls Episcopal School and the University of South Alabama. She and her husband of 25 years, Mark (a Navy veteran), have two beautiful girls that are her inspiration. Her daughters attend Auburn University and St. Pauls Episcopal School. Michelle put her career in real estate on the back burner to dedicate her life to being a full-time stay at home mom. During this time she volunteered as a teacher and office worker at St. Pauls while never missing a field trip! She has strong management and organizational skill while also a large network. Now that her girls are older she wants to continue to be a role model for them and has returned to her passion of helping others sell or buy their forever home. In her first year of selling real estate, even in a pandemic, Michelle was awarded Rookie of the Year for all of Roberts Brothers. And last year climbed to #18 in a company of almost 300! She is dedicated and puts her customer first, always answering the phone when it rings. In her free time she enjoys performing as a gospel singer, playing tennis, leading the worship service at Volunteers of America, performing at womens conferences and vacationing with her family. Whether buying or selling, Michelle wants to get to know you and focus on your wants. Since she has always lived in Mobile she knows Mobile and Baldwin counties. Having a passion for getting things done, Michelle takes pride in understanding her clients time-sensitive needs and will put YOU first. She enjoys building lasting relationships with all her buyers and sellers.", "name": "Michelle Autio", "website": "https://michelleautio.robertsbrothers.com/", "agent_phone_numbers": "251-599-1959", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/tayloraustin", "description": "About Taylor Austin Taylor Austin is your dedicated real estate professional serving the beautiful Gulf Coast of Alabama. With a passion for art, socializing, reading, and traveling, Taylor brings a unique blend of creativity, adaptability, and enthusiasm to every client interaction.Originally from the small town of Brewton, Alabama, Taylor has recently relocated to the Gulf Coast in pursuit of a successful real estate career. Being from a small town, Taylor learned the importance of integrity and reliability when forming genuine connections. Taylor pursued academic and athletic endeavors in Brewton, attending the local college. Playing sports her entire life played a big roll in how she handles adverse situations. Sports instilled a strong work ethic, teamwork mentality, and competitive spirit, all of which seamlessly integrate into Taylor’s real estate practice.With years of experience in the service industry, Taylor has mastered the ability to connect with people from all walks of life and easily embraces the fast-paced nature of real estate. Patience, understanding, and a genuine desire to relate to others define Taylor’s approach, allowing for adaptation to any situation and ensuring a positive experience for clients.As Taylor puts it, Working with the community and the people within it is not just a job, but a privilege. Every interaction is an opportunity to make a positive impact and build lasting relationships. Taylor’s goal is to advocate tirelessly for clients, providing them with a personalized and unparalleled experience. Knowing her leverage with the reputation and achievements of Roberts Brothers Inc., Taylor hopes to showcase all of the knowledge Roberts Brothers Inc. continues to provide through out her journey. Taylor aims to use her expertise in social media marketing and plans to showcase properties effectively and reach a wider audience. Taylor aspires to become clients’ go-to-real estate agent, known for her integrity, professionalism, and dedication to exceeding expectations.", "name": "Taylor Austin", "website": "https://tayloraustin.robertsbrothers.com/", "agent_phone_numbers": "334-313-2781", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/janicearrington", "description": "About Janice Arrington She was born and raised in Mississippi, but relocated to Mobile, Alabama to further her education and embarked upon a new career path. She received her A.A. Degree in Business Administration from Jones County Junior College. As a business-oriented person, she endeavored into banking and accounting. As a life-long learner, she received her B.A. in Elementary Education from the University of Southern Mississippi. This milestone led her to receive her M. Ed. in Administration. She retired with 25 years of dedicated service from the Mobile County Public School System. As an entrepreneur, she also has experiences in buying and selling residential property. She is eagerly awaiting to assist your real estate needs during your buying and selling process. Besides investing time with others, she also enjoys spending time with her husband, daughter, and countless family members.", "name": "Janice Arrington", "website": "https://janicearrington.robertsbrothers.com/", "agent_phone_numbers": null, "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "6721 Grelot Road, Suite A Mobile AL 36695", "profile_url": "https://www.robertsbrothers.com/bio/sherryarchibald", "description": "About Sherry Archibald Sherry’s roots trace back to the Midwest state of Ohio, but for the past two decades, she has called Mobile, AL home. Her familiarity with Mobile and its surrounding counties blossomed as she accompanied her children to various club sports events like soccer, football, volleyball, and golf. This firsthand knowledge of the area is just one of the many tools she possesses to assist you in finding your perfect permanent residence, rental property, or beach getaway. As a real estate professional affiliated with Roberts Brothers, Sherry offers unparalleled access to top tier resources for both buying and selling properties. Roberts Brothers is renowned for its distinguished reputation of excellence and professionalism, positioning them as leaders in the real estate industry. Beyond her real estate, Sherry finds fulfillment in serving her church and local community, as well as enjoying leisurely walks on the picturesque campus of Springhill College Whether you’re seeking to establish yourself in South Alabama or simply relax on the beautiful beaches, Sherry is committed to being your trusted guide. Reach out to Sherry today for personalized, reliable, and dedicated service that exceeds expectations.", "name": "Sherry Archibald", "website": "https://sherryarchibald.robertsbrothers.com/", "agent_phone_numbers": "251-776-3318", "country": "US"}
{"title": "Associate Broker - REALTOR", "address": "900 Bienville Blvd. Dauphin Island AL 36528", "profile_url": "https://www.robertsbrothers.com/bio/markandrews", "description": "About Mark Andrews When you are ready to buy or sell, contact me and let's put the plan together now. As a lifelong resident and successful business owner in Mobile, I am Ready, Willing, and Able to help you meet all your real estate needs. When you're ready to sell, I'll help you build a marketing plan to fit your needs and goals. Together with myself, the backing of more than 70 years of Roberts Brothers strength in Mobile and Baldwin counties, and more than 200 other Roberts Brothers agents, our efforts will move you closer to reaching your goals in real estate. I also want the buying process to be one that creates a lasting relationship that will bring you back to me now and in your future referrals. Feel free to contact me at MarkAndrews@RobertsBrothers.com through our office number (251) 661-4660, or direct cell (251) 591-4438.", "name": "Mark Andrews", "website": "https://markandrews.robertsbrothers.com/", "agent_phone_numbers": "251-591-4438", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/barbaraandrews", "description": "About Barbara Andrews Check out this fantastic private estate with 114 acres only 15 minutes from downtown Mobile! https://www.youtube.com/watch?v=CVMwVrxxQSI Prime Location in Downtown Bay Minette! https://www.youtube.com/watch?v=yFgeAKjCx-g Call me for a showing today! Barbara Andrews 251-689-4942 Being a native Mobilian, I am an ambassador for our beautiful historic Gulf Coast. Growing up on Marine Street in downtown Mobile, playing in Washington Square, cheering at Ladd Stadium during the Senior Bowl while my dad reported stats for the Mobile Register or walking through the wooden revolving door of the children's room at the Ben May Library, give me \"story\" behind our location. And isn't real estate all about LOCATION!! LOCATION!! LOCATION!! Later moving to west Mobile county and helping my parents build our family home in Theodore, gave me experience in home construction, style and creative problem solving. Dad bought 14,000 bricks from the old LeVert home, staircases, doors, light fixtures from historic homes and incorporated them into our new home on Belle Terrace Drive. While in Theodore, I enjoyed fishing on Fowl River, skiing on Dog River and strolling in Bellingrath Gardens. I am married to Hamp Andrews and we have three married adult children, three adorable grandchildren and one on the way! We enjoy living on the Eastern Shore where we golf, go antiquing and cheer for our grands! \"It has been satisfying helping my customers achieve their real estate dreams. I have helped grandparents find homes closer to their grandchildren. Families are happier, needs are met and love is shared!\" If you are looking to buy or sell, give me a call, text or email.", "name": "Barbara Andrews", "website": "https://barbaraandrews.robertsbrothers.com/", "agent_phone_numbers": "251-689-4942", "country": "US"}
{"title": "Sales Associate - REALTOR", "address": "200 N. OWA Blvd. Suite H Foley AL 36535", "profile_url": "https://www.robertsbrothers.com/bio/susanandersen", "description": "About Susan Andersen Susan is proud to be part of a team that has served our community for nearly 80 years. She shares the same deep commitment to clients and colleagues that has defined our company’s legacy. With 27 years of experience as a registered nurse in this very community, Susan has dedicated her life to caring for others. Now, she brings that same level of compassion, dedication, and attention to detail to every real estate transaction. Whether you're buying your forever home or selling a place filled with memories, Susan is honored to walk beside you through every step—now and in the future. Thank you for choosing Roberts Brothers, and for placing your trust in Susan.", "name": "Susan Andersen", "website": "https://susanandersen.robertsbrothers.com/", "agent_phone_numbers": "251-609-0869", "country": "US"}
{"title": "SALES ASSOCIATE - REALTOR", "address": "29640 A Hwy 181, Suite 103 Daphne AL 36526", "profile_url": "https://www.robertsbrothers.com/bio/rodneyaldridge", "description": "About Rodney Aldridge Whether you are exploring the area from afar for the first time, or a seasoned local looking to start a new journey, I am here to assist you with all your real estate needs. From beginning to end, I will be here to listen, treat you with respect, and make your goals my priority. As a real estate professional at Roberts Brothers, I provide my clients the very best resources in the industry for buying and selling a home. Serving the community since 1946, Roberts Brothers has 250 top-notch agents in six offices spanning South Alabama, earning a reputation for excellence and professionalism that is second-to-none. There's a reason people love to call South Alabama home. Whether strolling under the shady oaks in historic midtown, soaking in the sunshine on our beautiful waterways and beaches, or settling in for a spectacular sunset after a day of shopping and amazing cuisine, this unique area has it all. If you are considering a relocation to South Alabama, or a local ready for a change of scenery, I will serve as your trusted resource, helping you find the home or property that best fits your needs. And when the time comes to sell your home or property, I will use all the marketing resources and expertise you will need to make that happen. No matter your real estate needs, it would be my pleasure to assist you.", "name": "Rodney Aldridge", "website": "https://rodneyaldridge.robertsbrothers.com/", "agent_phone_numbers": "704-860-5804", "country": "US"}
